Library "BossBiolizardConfig"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct BossBiolizardLockonCameraParam
    {
        [FieldOffset(0x00)] public bool enable;
        [FieldOffset(0x04)] public float fovy;
        [FieldOffset(0x08)] public float distance;
        [FieldOffset(0x0C)] public float offsetHeight;
        [FieldOffset(0x10)] public float offsetHeightAdded;
        [FieldOffset(0x14)] public float minElevation;
        [FieldOffset(0x18)] public float maxElevation;
        [FieldOffset(0x1C)] public float panningSuspensionK;
        [FieldOffset(0x20)] public float interiorPanningSuspensionK;
        [FieldOffset(0x24)] public float time;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x90)]
    public struct BossBiolizardBodyPressParam
    {
        [FieldOffset(0x00)] public float pressBodyCollisionRadius;
        [FieldOffset(0x04)] public float pressBodyCollisionHeight;
        [FieldOffset(0x10)] public Vector3 pressNeckCollisionSize;
        [FieldOffset(0x20)] public float pressBodySensorRadius;
        [FieldOffset(0x24)] public float pressBodySensorHeight;
        [FieldOffset(0x30)] public Vector3 pressNeckSensorSize;
        [FieldOffset(0x40)] public Vector3 pressNeckSideSensorSize;
        [FieldOffset(0x50)] public Vector3 pressNeckSideSensorOffset;
        [FieldOffset(0x60)] public float pressStartTime;
        [FieldOffset(0x64)] public BossBiolizardLockonCameraParam lockonCamera;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x100)]
    public struct BossBiolizardCommonParam
    {
        [FieldOffset(0x00)] public float damageColliderRadius;
        [FieldOffset(0x04)] public float damageColliderHeight;
        [FieldOffset(0x10)] public Vector3 damageColliderOffset;
        [FieldOffset(0x20)] public float shockwaveColliderRadius;
        [FieldOffset(0x24)] public float shockwaveColliderHeight;
        [FieldOffset(0x30)] public Vector3 shockwaveColliderOffset;
        [FieldOffset(0x40)] public int coreDropRingNum;
        [FieldOffset(0x50)] public Vector3 coreDropRingOffset;
        [FieldOffset(0x60)] public float waterFlowRotateSpeed;
        [FieldOffset(0x64)] public float waterFlowIntakeSpeed;
        [FieldOffset(0x70)] public BossBiolizardBodyPressParam bodyPress;
    }

    public enum ActionType : int
    {
        INVALID_ACTION = 0,
        PHASE1_IDLE = 1,
        PHASE1_Y_ROT_HEAD = 2,
        PHASE1_Y_ROT_TAIL = 3,
        PHASE1_ENERGY_BALL = 4,
        PHASE1_DOWN = 5,
        PHASE2_IDLE = 6,
        PHASE2_HAND_NORMAL = 7,
        PHASE2_HAND_WAVE = 8,
        PHASE2_HAND_IKURA = 9,
        PHASE2_HAND_TRIPLE_0 = 10,
        PHASE2_HAND_TRIPLE_1 = 11,
        PHASE2_HAND_TRIPLE_2 = 12,
        PHASE2_HAND_TRIPLE_3 = 13,
        PHASE2_JUMP = 14,
        PHASE3_IDLE = 15,
        PHASE3_HOMING_IKURA_0 = 16,
        PHASE3_HOMING_IKURA_1 = 17,
        PHASE3_HOMING_IKURA_2 = 18,
        PHASE3_HOMING_IKURA_3 = 19,
        PHASE3_GIANT_IKURA = 20,
        ACTION_TYPE_NUM = 21
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct BossBiolizardActionData
    {
        [FieldOffset(0x00)] public ActionType actionType;
        [FieldOffset(0x04)] public float time;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x310)]
    public struct BossBiolizardPhaseParam
    {
        [FieldOffset(0x00)] public int lifeCount;
        [FieldOffset(0x04)] public int healthPoint;
        [FieldOffset(0x08)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTable[128];

        public unsafe BossBiolizardActionData* actionTable
        {
            get
            {
                fixed (byte* p_actionTable = _actionTable)
                    return (BossBiolizardActionData*)p_actionTable;
            }
        }

        [FieldOffset(0x88)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTable2[128];

        public unsafe BossBiolizardActionData* actionTable2
        {
            get
            {
                fixed (byte* p_actionTable2 = _actionTable2)
                    return (BossBiolizardActionData*)p_actionTable2;
            }
        }

        [FieldOffset(0x108)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTable3[128];

        public unsafe BossBiolizardActionData* actionTable3
        {
            get
            {
                fixed (byte* p_actionTable3 = _actionTable3)
                    return (BossBiolizardActionData*)p_actionTable3;
            }
        }

        [FieldOffset(0x188)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTableByHard[128];

        public unsafe BossBiolizardActionData* actionTableByHard
        {
            get
            {
                fixed (byte* p_actionTableByHard = _actionTableByHard)
                    return (BossBiolizardActionData*)p_actionTableByHard;
            }
        }

        [FieldOffset(0x208)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTable2ByHard[128];

        public unsafe BossBiolizardActionData* actionTable2ByHard
        {
            get
            {
                fixed (byte* p_actionTable2ByHard = _actionTable2ByHard)
                    return (BossBiolizardActionData*)p_actionTable2ByHard;
            }
        }

        [FieldOffset(0x288)] public unsafe fixed byte /* BossBiolizardActionData[16] */ _actionTable3ByHard[128];

        public unsafe BossBiolizardActionData* actionTable3ByHard
        {
            get
            {
                fixed (byte* p_actionTable3ByHard = _actionTable3ByHard)
                    return (BossBiolizardActionData*)p_actionTable3ByHard;
            }
        }

        [FieldOffset(0x308)] public int useActTblHealthPoint2;
        [FieldOffset(0x30C)] public int useActTblHealthPoint3;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA0)]
    public struct BossBiolizardYRotParam
    {
        [FieldOffset(0x00)] public float motionSpeed;
        [FieldOffset(0x10)] public Vector3 headCollisionSize;
        [FieldOffset(0x20)] public Vector3 tailCollisionSize;
        [FieldOffset(0x30)] public Vector3 headBlockSize;
        [FieldOffset(0x40)] public Vector3 tailBlockSize;
        [FieldOffset(0x50)] public float footCollisionRadius;
        [FieldOffset(0x54)] public float footCollisionHeight;
        [FieldOffset(0x58)] public float blendMotionDistanceMin;
        [FieldOffset(0x5C)] public float blendMotionDistanceMax;
        [FieldOffset(0x60)] public BossBiolizardLockonCameraParam lockonCamera;
        [FieldOffset(0x88)] public float waitTime;
        [FieldOffset(0x8C)] public float changeDelayTime;
        [FieldOffset(0x90)] public float neckMoveDelayTime;
        [FieldOffset(0x94)] public float hitWaitTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xD0)]
    public struct BossBiolizardEnergyBallParam
    {
        [FieldOffset(0x00)] public float chargeTime;
        [FieldOffset(0x04)] public float chargeTimeByHard;
        [FieldOffset(0x08)] public int shotNum;
        [FieldOffset(0x0C)] public int shotNumByHard;
        [FieldOffset(0x10)] public float shotDelayTime;
        [FieldOffset(0x14)] public float shotDelayTimeByHard;
        [FieldOffset(0x18)] public float frontSpeed;
        [FieldOffset(0x1C)] public float frontSpeedByHard;
        [FieldOffset(0x20)] public float sideSpeed;
        [FieldOffset(0x24)] public float sideSpeedByHard;
        [FieldOffset(0x28)] public float startSize;
        [FieldOffset(0x2C)] public float startSizeByHard;
        [FieldOffset(0x30)] public float maxSize;
        [FieldOffset(0x34)] public float maxSizeByHard;
        [FieldOffset(0x38)] public float endSize;
        [FieldOffset(0x3C)] public float endSizeByHard;
        [FieldOffset(0x40)] public float startHeight;
        [FieldOffset(0x44)] public float startHeightByHard;
        [FieldOffset(0x48)] public float maxHeight;
        [FieldOffset(0x4C)] public float maxHeightByHard;
        [FieldOffset(0x50)] public float endHeight;
        [FieldOffset(0x54)] public float endHeightByHard;
        [FieldOffset(0x58)] public float sizeUpDist;
        [FieldOffset(0x5C)] public float sizeUpDistByHard;
        [FieldOffset(0x60)] public float keepMaxDist;
        [FieldOffset(0x64)] public float keepMaxDistByHard;
        [FieldOffset(0x68)] public float sizeDownDist;
        [FieldOffset(0x6C)] public float sizeDownDistByHard;
        [FieldOffset(0x70)] public float endDist;
        [FieldOffset(0x74)] public float endDistByHard;
        [FieldOffset(0x78)] public float explodeSize;
        [FieldOffset(0x7C)] public float explodeSizeByHard;
        [FieldOffset(0x80)] public float explodeTime;
        [FieldOffset(0x84)] public float explodeTimeByHard;
        [FieldOffset(0x88)] public float hitWaitTime;
        [FieldOffset(0x8C)] public float hitWaitTimeByHard;
        [FieldOffset(0x90)] public BossBiolizardLockonCameraParam lockonCamera;
        [FieldOffset(0xC0)] public Vector3 spawnOffset;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct BossBiolizardPhase1CameraExtensionInfo
    {
        [FieldOffset(0x00)] public float addDistance;
        [FieldOffset(0x04)] public float addElevationOffset;
        [FieldOffset(0x08)] public float addTargetUpOffset;
        [FieldOffset(0x0C)] public float addLookatUpOffset;
        [FieldOffset(0x10)] public float addLookatWorldUpOffset;
        [FieldOffset(0x14)] public bool isDisableAvoidance;
        [FieldOffset(0x18)] public float easeIn;
        [FieldOffset(0x1C)] public float easeOut;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x54)]
    public struct BossBiolizardPhase1CameraExtensionParam
    {
        [FieldOffset(0x00)] public float nearCameraRange;
        [FieldOffset(0x04)] public float nearCameraMargin;
        [FieldOffset(0x08)] public BossBiolizardPhase1CameraExtensionInfo nearCameraInfo;
        [FieldOffset(0x28)] public float outrangeCameraAngle;
        [FieldOffset(0x2C)] public float outrangeCameraAngleOffset;
        [FieldOffset(0x30)] public float outrangeCameraAngleMargin;
        [FieldOffset(0x34)] public BossBiolizardPhase1CameraExtensionInfo outrangeCameraInfo;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x360)]
    public struct BossBiolizardPhase1Param
    {
        [FieldOffset(0x00)] public BossBiolizardYRotParam yRotParam;
        [FieldOffset(0xA0)] public BossBiolizardEnergyBallParam energyBall;
        [FieldOffset(0x170)] public BossBiolizardLockonCameraParam waterLockonCamera;
        [FieldOffset(0x198)] public BossBiolizardLockonCameraParam downLockonCamera;
        [FieldOffset(0x1C0)] public BossBiolizardPhase1CameraExtensionParam extensionCamera;
        [FieldOffset(0x214)] public BossBiolizardPhase1CameraExtensionParam extensionCameraEB;
        [FieldOffset(0x268)] public float downPanCameraRatio;
        [FieldOffset(0x270)] public Vector3 downPanCameraOffset;
        [FieldOffset(0x280)] public Vector3 downPanCameraOffsetPlayer;
        [FieldOffset(0x290)] public float downPanCameraFadeTime;
        [FieldOffset(0x294)] public float downRailCameraDistance;
        [FieldOffset(0x2A0)] public Vector3 downRailCameraOffsetPlayer;
        [FieldOffset(0x2B0)] public float downRailCameraAzimuth;
        [FieldOffset(0x2B4)] public float downRailCameraElavation;
        [FieldOffset(0x2B8)] public float downRailCameraAnglePerSec;
        [FieldOffset(0x2BC)] public float downRailCameraFadeTime;
        [FieldOffset(0x2C0)] public float downRailGrindBoosterSpeed;
        [FieldOffset(0x2C4)] public BossBiolizardLockonCameraParam downSpringLockonCamera;
        [FieldOffset(0x2F0)] public Vector3 downSpringVelocity;
        [FieldOffset(0x300)] public BossBiolizardLockonCameraParam downEndHitCamera;
        [FieldOffset(0x328)] public BossBiolizardLockonCameraParam downEndMissCamera;
        [FieldOffset(0x350)] public float downEndHitMoveSpeed;
        [FieldOffset(0x354)] public float downEndMissMoveSpeed;
        [FieldOffset(0x358)] public float downEndHitSlideDistance;
        [FieldOffset(0x35C)] public float downEndMissSlideDistance;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x06)]
    public struct BossBiolizardRoeArmTripleAttackInfo
    {
        [FieldOffset(0x00)] public unsafe fixed bool isWave[3];
        [FieldOffset(0x03)] public unsafe fixed bool isDebris[3];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    public struct BossBiolizardRoeArm
    {
        [FieldOffset(0x00)] public int roeHandHp;
        [FieldOffset(0x04)] public unsafe fixed int roeHandHpByHard[4];
        [FieldOffset(0x14)] public float roeHandSwingWaitTime;
        [FieldOffset(0x18)] public float roeHandBreakDamageTime;
        [FieldOffset(0x1C)] public float roeHandBreakDamageTimeByHard;
        [FieldOffset(0x20)] public float rangeDistanceMin;
        [FieldOffset(0x24)] public float rangeDistanceMax;
        [FieldOffset(0x28)] public float rangeAngel;
        [FieldOffset(0x2C)] public float rangeAngelOffset;
        [FieldOffset(0x30)] public float targetDelay;
        [FieldOffset(0x34)] public float breakPlayerHoldTime;
        [FieldOffset(0x38)] public unsafe fixed byte /* BossBiolizardRoeArmTripleAttackInfo[4] */ _tripleAttacks[24];

        public unsafe BossBiolizardRoeArmTripleAttackInfo* tripleAttacks
        {
            get
            {
                fixed (byte* p_tripleAttacks = _tripleAttacks)
                    return (BossBiolizardRoeArmTripleAttackInfo*)p_tripleAttacks;
            }
        }

        [FieldOffset(0x50)] public unsafe fixed byte /* BossBiolizardRoeArmTripleAttackInfo[4] */ _tripleAttacksByHard[24];

        public unsafe BossBiolizardRoeArmTripleAttackInfo* tripleAttacksByHard
        {
            get
            {
                fixed (byte* p_tripleAttacksByHard = _tripleAttacksByHard)
                    return (BossBiolizardRoeArmTripleAttackInfo*)p_tripleAttacksByHard;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public struct BossBiolizardAttackImpactWave
    {
        [FieldOffset(0x00)] public float time;
        [FieldOffset(0x04)] public float damageByHand;
        [FieldOffset(0x08)] public float damageByBody;
        [FieldOffset(0x0C)] public float delay;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2C)]
    public struct BossBiolizardDropIkura
    {
        [FieldOffset(0x00)] public int roeHandAttackDropIkuraNum;
        [FieldOffset(0x04)] public int boundNum;
        [FieldOffset(0x08)] public float boundDecRatio;
        [FieldOffset(0x0C)] public float moveSpeed;
        [FieldOffset(0x10)] public float moveSpeedRandomRange;
        [FieldOffset(0x14)] public float shotAngleRandomRange;
        [FieldOffset(0x18)] public float downSpeed;
        [FieldOffset(0x1C)] public int chaosSpearBreakRingNum;
        [FieldOffset(0x20)] public int chaosSpearBreakRingNumByHard;
        [FieldOffset(0x24)] public float dBlownPowerRatioY;
        [FieldOffset(0x28)] public float dBlownPowerRatioXZ;
    }

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x90)]
    public struct BossBiolizardPointCamera
    {
        [FieldOffset(0x00)] public float fovy;
        [FieldOffset(0x04)] public float toPointDistanceMin;
        [FieldOffset(0x08)] public float toPointDistanceMax;
        [FieldOffset(0x0C)] public float distanceMin;
        [FieldOffset(0x10)] public float distanceMax;
        [FieldOffset(0x14)] public float gravityOffsetMin;
        [FieldOffset(0x18)] public float gravityOffsetMax;
        [FieldOffset(0x20)] public Vector3 playerOffsetMin;
        [FieldOffset(0x30)] public Vector3 playerOffsetMax;
        [FieldOffset(0x40)] public Vector3 worldOffsetMin;
        [FieldOffset(0x50)] public Vector3 worldOffsetMax;
        [FieldOffset(0x60)] public Vector3 pointLocalOffsetMin;
        [FieldOffset(0x70)] public Vector3 pointLocalOffsetMax;
        [FieldOffset(0x80)] public UnmanagedString nodeName;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct BossBiolizardDamageCamera
    {
        [FieldOffset(0x00)] public float fovy;
        [FieldOffset(0x04)] public float distance;
        [FieldOffset(0x08)] public float elevation;
        [FieldOffset(0x0C)] public float gravityOffset;
        [FieldOffset(0x10)] public Vector3 worldOffset;
        [FieldOffset(0x20)] public float keepTime;
        [FieldOffset(0x24)] public float easeInTime;
        [FieldOffset(0x28)] public float easeOutTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public struct BossBiolizardArmBreakCamera
    {
        [FieldOffset(0x00)] public float fovy;
        [FieldOffset(0x04)] public float distance;
        [FieldOffset(0x08)] public float elevation;
        [FieldOffset(0x0C)] public float rotation;
        [FieldOffset(0x10)] public float gravityOffset;
        [FieldOffset(0x20)] public Vector3 worldOffset;
        [FieldOffset(0x30)] public float keepTime;
        [FieldOffset(0x34)] public float easeInTime;
        [FieldOffset(0x38)] public float easeOutTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct BossBiolizardStuckCollisionData
    {
        [FieldOffset(0x00)] public float radius;
        [FieldOffset(0x04)] public float height;
        [FieldOffset(0x10)] public Vector3 position;
        [FieldOffset(0x20)] public Vector3 rotation;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x3A0)]
    public struct BossBiolizardPhase2Param
    {
        [FieldOffset(0x00)] public float roeArmBreakIkuraTime;
        [FieldOffset(0x04)] public float battleAreaMoveDistance;
        [FieldOffset(0x08)] public float defaultCameraDistanceScale;
        [FieldOffset(0x0C)] public float ikuraCameraDistanceScale;
        [FieldOffset(0x10)] public float ikuraCameraDistanceKeepTime;
        [FieldOffset(0x14)] public float handAttackSuccessAddWaitTime;
        [FieldOffset(0x18)] public int breakRingNum;
        [FieldOffset(0x1C)] public int timeStopBreakRingNum;
        [FieldOffset(0x20)] public int breakRingNumByHard;
        [FieldOffset(0x24)] public int timeStopBreakRingNumByHard;
        [FieldOffset(0x28)] public BossBiolizardRoeArm roeArm;
        [FieldOffset(0x90)] public BossBiolizardAttackImpactWave wave;
        [FieldOffset(0xA0)] public BossBiolizardAttackImpactWave waveTriple;
        [FieldOffset(0xB0)] public unsafe fixed byte /* BossBiolizardAttackImpactWave[4] */ _waveTripleByHard[64];

        public unsafe BossBiolizardAttackImpactWave* waveTripleByHard
        {
            get
            {
                fixed (byte* p_waveTripleByHard = _waveTripleByHard)
                    return (BossBiolizardAttackImpactWave*)p_waveTripleByHard;
            }
        }

        [FieldOffset(0xF0)] public BossBiolizardDropIkura dropIkura;
        [FieldOffset(0x120)] public BossBiolizardPointCamera camera;
        [FieldOffset(0x1B0)] public BossBiolizardDamageCamera damageCamera;
        [FieldOffset(0x1E0)] public BossBiolizardArmBreakCamera armBreakCamera;
        [FieldOffset(0x220)] public BossBiolizardArmBreakCamera armBreakCameraTS;
        [FieldOffset(0x260)] public BossBiolizardPhase1CameraExtensionInfo armBreakedDownCameraInfo;
        [FieldOffset(0x280)] public unsafe fixed byte /* BossBiolizardStuckCollisionData[6] */ _stuckCollisions[288];

        public unsafe BossBiolizardStuckCollisionData* stuckCollisions
        {
            get
            {
                fixed (byte* p_stuckCollisions = _stuckCollisions)
                    return (BossBiolizardStuckCollisionData*)p_stuckCollisions;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct BossBiolizardPhase3Param
    {
        [FieldOffset(0x00)] public int roeHandAttackDropIkuraNum;
    }

    public enum ShotType : int
    {
        NONE = 0,
        ONE_SHOT = 1,
        ONE_SHOT_PLAYER = 2,
        ONE_SHOT_HOMING = 3,
        MULTI_SHOT = 4,
        MULTI_SHOT_HOMING = 5
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public struct BossBiolizardHomingIkuraTableDataParam
    {
        [FieldOffset(0x00)] public ShotType type;
        [FieldOffset(0x04)] public int num;
        [FieldOffset(0x08)] public float waitTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x120)]
    public struct BossBiolizardHomingIkuraTableParam
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* BossBiolizardHomingIkuraTableDataParam[24] */ _tableData[288];

        public unsafe BossBiolizardHomingIkuraTableDataParam* tableData
        {
            get
            {
                fixed (byte* p_tableData = _tableData)
                    return (BossBiolizardHomingIkuraTableDataParam*)p_tableData;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x560)]
    public struct BossBiolizardHomingIkuraParam
    {
        [FieldOffset(0x00)] public float radius;
        [FieldOffset(0x04)] public float hitRadius;
        [FieldOffset(0x08)] public float bodyRadius;
        [FieldOffset(0x0C)] public float speed;
        [FieldOffset(0x10)] public float minSpeed;
        [FieldOffset(0x14)] public float decelePower;
        [FieldOffset(0x18)] public float speedRandom;
        [FieldOffset(0x1C)] public float minSpeedRandom;
        [FieldOffset(0x20)] public float decelePowerRandom;
        [FieldOffset(0x24)] public bool enableChaosSpearRandom;
        [FieldOffset(0x28)] public float lifeTime;
        [FieldOffset(0x2C)] public float homingAngularSpeed;
        [FieldOffset(0x30)] public float homingEndDistance;
        [FieldOffset(0x34)] public float homingEndHeight;
        [FieldOffset(0x38)] public int firstSpawnNum;
        [FieldOffset(0x40)] public Vector3 spawnAreaSize;
        [FieldOffset(0x50)] public Vector3 spawnAreaOffset;
        [FieldOffset(0x60)] public Vector3 spawnNumMax;
        [FieldOffset(0x70)] public float appearWaitTime;
        [FieldOffset(0x74)] public float startWaitTime;
        [FieldOffset(0x78)] public float endWaitTime;
        [FieldOffset(0x7C)] public float endWaitTimeByGaugeMax;
        [FieldOffset(0x80)] public float floatSEDelay;
        [FieldOffset(0x84)] public int ringNum;
        [FieldOffset(0x90)] public Vector3 attackCenter;
        [FieldOffset(0xA0)] public float attackRadius;
        [FieldOffset(0xA4)] public BossBiolizardLockonCameraParam nearDistLockonCamera;
        [FieldOffset(0xD0)] public Vector3 nearDistCameraOffset;
        [FieldOffset(0xE0)] public unsafe fixed byte /* BossBiolizardHomingIkuraTableParam[4] */ _numTable[1152];

        public unsafe BossBiolizardHomingIkuraTableParam* numTable
        {
            get
            {
                fixed (byte* p_numTable = _numTable)
                    return (BossBiolizardHomingIkuraTableParam*)p_numTable;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct BossBiolizardGiantIkuraStartCamera
    {
        [FieldOffset(0x00)] public float fovy;
        [FieldOffset(0x04)] public float roll;
        [FieldOffset(0x10)] public Vector3 target;
        [FieldOffset(0x20)] public Vector3 position;
        [FieldOffset(0x30)] public Vector3 up;
        [FieldOffset(0x40)] public float delay;
        [FieldOffset(0x44)] public float keepTime;
        [FieldOffset(0x48)] public float easeInTime;
        [FieldOffset(0x4C)] public float easeOutTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public struct BossBiolizardFixedCamera
    {
        [FieldOffset(0x00)] public Vector3 eyeLocalOffset;
        [FieldOffset(0x10)] public Vector3 lookAtLocalOffset;
        [FieldOffset(0x20)] public float fov;
        [FieldOffset(0x24)] public float roll;
        [FieldOffset(0x28)] public float easeInTime;
        [FieldOffset(0x2C)] public float easeOutTime;
        [FieldOffset(0x30)] public float keepTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xD0)]
    public struct BossBiolizardGiantIkuraParam
    {
        [FieldOffset(0x00)] public float radius;
        [FieldOffset(0x04)] public float speed;
        [FieldOffset(0x08)] public int health;
        [FieldOffset(0x0C)] public int childNum;
        [FieldOffset(0x10)] public float childSpawnTime;
        [FieldOffset(0x14)] public float childSpeedMin;
        [FieldOffset(0x18)] public float childSpeedMax;
        [FieldOffset(0x1C)] public float childLifeTime;
        [FieldOffset(0x20)] public float timeStopGaugeStopTime;
        [FieldOffset(0x30)] public BossBiolizardGiantIkuraStartCamera startCamera;
        [FieldOffset(0x80)] public BossBiolizardFixedCamera fixedCamera;
        [FieldOffset(0xC0)] public float fixedCameraStartDelay;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xC00)]
    public struct BossBiolizardPhase4Param
    {
        [FieldOffset(0x00)] public BossBiolizardHomingIkuraParam homingIkura;
        [FieldOffset(0x560)] public BossBiolizardHomingIkuraParam homingIkuraByHard;
        [FieldOffset(0xAC0)] public BossBiolizardGiantIkuraParam giantIkura;
        [FieldOffset(0xB90)] public float downTime;
        [FieldOffset(0xB94)] public float cameraDistanceScale;
        [FieldOffset(0xB98)] public BossBiolizardLockonCameraParam waterLockonCamera;
        [FieldOffset(0xBC0)] public Vector3 waterCameraOffset;
        [FieldOffset(0xBD0)] public BossBiolizardLockonCameraParam lockonCamera;
        [FieldOffset(0xBF8)] public float chaosSpearInputGuideDelayTime;
        [FieldOffset(0xBFC)] public sbyte chaosSpearGuideDispInputCount;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2050)]
    public struct BossBiolizardConfig
    {
        [FieldOffset(0x00)] public BossBiolizardCommonParam commonParam;
        [FieldOffset(0x100)] public unsafe fixed byte /* BossBiolizardPhaseParam[4] */ _phaseParam[3136];

        public unsafe BossBiolizardPhaseParam* phaseParam
        {
            get
            {
                fixed (byte* p_phaseParam = _phaseParam)
                    return (BossBiolizardPhaseParam*)p_phaseParam;
            }
        }

        [FieldOffset(0xD40)] public BossBiolizardPhase1Param phase1;
        [FieldOffset(0x10A0)] public BossBiolizardPhase2Param phase2;
        [FieldOffset(0x1440)] public BossBiolizardPhase3Param phase3;
        [FieldOffset(0x1450)] public BossBiolizardPhase4Param phase4;
    }

}