Library "CreditParamter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    public enum CreditItemKind : sbyte
    {
        Empty = 0,
        Category = 1,
        Post = 2,
        Name = 3,
        Logo = 4,
        Num = 5
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    public struct CreditItemInfo
    {
        [FieldOffset(0x00)] public CreditItemKind creditItemKind;
        [FieldOffset(0x01)] public byte numItems;
        [FieldOffset(0x02)] public bool isLastItem;
        [FieldOffset(0x08)] public unsafe fixed byte /* UnmanagedString[6] */ _str[1530];

        public unsafe UnmanagedString* str
        {
            get
            {
                fixed (byte* p_str = _str)
                    return (UnmanagedString*)p_str;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct CreditBGInfo
    {
        [FieldOffset(0x00)] public UnmanagedString bgName;
        [FieldOffset(0x10)] public float displayTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x34130)]
    public struct CreditParamter
    {
        [FieldOffset(0x00)] public float blackBGTime;
        [FieldOffset(0x04)] public float emptySize;
        [FieldOffset(0x08)] public float creditTime;
        [FieldOffset(0x0C)] public float finishInterval;
        [FieldOffset(0x10)] public float guideDisplayTime;
        [FieldOffset(0x14)] public float lastItemStopHeight;
        [FieldOffset(0x18)] public float bgmDelay;
        [FieldOffset(0x1C)] public float bgmFadeOutTime;
        [FieldOffset(0x20)] public UnmanagedString unclearBGMName;
        [FieldOffset(0x30)] public UnmanagedString bgmName;
        [FieldOffset(0x40)] public unsafe fixed byte /* CreditItemInfo[2048] */ _itemInfos[212992];

        public unsafe CreditItemInfo* itemInfos
        {
            get
            {
                fixed (byte* p_itemInfos = _itemInfos)
                    return (CreditItemInfo*)p_itemInfos;
            }
        }

        [FieldOffset(0x34040)] public unsafe fixed byte /* CreditBGInfo[10] */ _bgInfos[240];

        public unsafe CreditBGInfo* bgInfos
        {
            get
            {
                fixed (byte* p_bgInfos = _bgInfos)
                    return (CreditBGInfo*)p_bgInfos;
            }
        }
    }

}