Library "GameHitStopParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct GameHitStopParameterData
    {
        [FieldOffset(0x00)] public UnmanagedString name;
        [FieldOffset(0x10)] public float scale;
        [FieldOffset(0x14)] public float time;
        [FieldOffset(0x18)] public float easeOutTime;
        [FieldOffset(0x1C)] public float delayTime;
        [FieldOffset(0x20)] public bool layerPlayer;
        [FieldOffset(0x21)] public bool layerEnemy;
        [FieldOffset(0x22)] public bool layerDamagedEnemy;
        [FieldOffset(0x23)] public bool layerGimmick;
        [FieldOffset(0x24)] public bool layerCamera;
        [FieldOffset(0x25)] public bool layerOthers;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA00)]
    public struct GameHitStopParameter
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* GameHitStopParameterData[64] */ _data[2560];

        public unsafe GameHitStopParameterData* data
        {
            get
            {
                fixed (byte* p_data = _data)
                    return (GameHitStopParameterData*)p_data;
            }
        }
    }

}