Library "GameResultParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x1C)]
    public struct ResultViewParam
    {
        [FieldOffset(0x00)] public float waitTimeStart;
        [FieldOffset(0x04)] public float waitTimeRing;
        [FieldOffset(0x08)] public float waitTimeRank;
        [FieldOffset(0x0C)] public float waitTimeRankAS;
        [FieldOffset(0x10)] public float waitTimeNextRank;
        [FieldOffset(0x14)] public float waitTimeObj;
        [FieldOffset(0x18)] public float scoreChangeTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct ResultScoreParam
    {
        [FieldOffset(0x00)] public UnmanagedString stageCode;
        [FieldOffset(0x10)] public int baseScore;
        [FieldOffset(0x14)] public int coefTime;
        [FieldOffset(0x18)] public int coefRing;
        [FieldOffset(0x1C)] public int ringScoreMax;
        [FieldOffset(0x20)] public int scoreRankS;
        [FieldOffset(0x24)] public int scoreRankA;
        [FieldOffset(0x28)] public int scoreRankB;
        [FieldOffset(0x2C)] public int scoreRankC;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x410)]
    public struct GameResultParameter
    {
        [FieldOffset(0x00)] public ResultViewParam viewParam;
        [FieldOffset(0x20)] public ResultScoreParam defaultScore;
        [FieldOffset(0x50)] public unsafe fixed byte /* ResultScoreParam[20] */ _stageScore[960];

        public unsafe ResultScoreParam* stageScore
        {
            get
            {
                fixed (byte* p_stageScore = _stageScore)
                    return (ResultScoreParam*)p_stageScore;
            }
        }
    }

}