Library "LicenseParamter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct LicenseItemInfo
    {
        [FieldOffset(0x00)] public sbyte pageIndex;
        [FieldOffset(0x08)] public UnmanagedString label;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x3C8)]
    public struct LicenseInfo
    {
        [FieldOffset(0x00)] public bool isEnable;
        [FieldOffset(0x04)] public float fontScale;
        [FieldOffset(0x08)] public unsafe fixed byte /* LicenseItemInfo[40] */ _infos[960];

        public unsafe LicenseItemInfo* infos
        {
            get
            {
                fixed (byte* p_infos = _infos)
                    return (LicenseItemInfo*)p_infos;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1A78)]
    public struct LicenseParamter
    {
        [FieldOffset(0x00)] public LicenseInfo ps4_Infos;
        [FieldOffset(0x3C8)] public LicenseInfo ps5_Infos;
        [FieldOffset(0x790)] public LicenseInfo xbox_Infos;
        [FieldOffset(0xB58)] public LicenseInfo scarlett_Infos;
        [FieldOffset(0xF20)] public LicenseInfo nx_Infos;
        [FieldOffset(0x12E8)] public LicenseInfo steam_Infos;
        [FieldOffset(0x16B0)] public LicenseInfo epic_Infos;
    }

}