Library "SystemData"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    public enum Status : sbyte
    {
        STATUS_ZERO_FILL = 0,
        STATUS_INITIALIZED = 1
    }

    public enum Sequence : sbyte
    {
        NewGame = 0,
        DSpearTutorialAfter = 1,
        FinalBossBefore = 2,
        FinalBossAfter = 3
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct HeaderData
    {
        [FieldOffset(0x00)] public uint signature;
        [FieldOffset(0x04)] public byte version;
        [FieldOffset(0x05)] public Status status;
        [FieldOffset(0x06)] public byte config;
        [FieldOffset(0x07)] public Sequence sequence;
        [FieldOffset(0x08)] public uint playTime;
        [FieldOffset(0x0C)] public byte reserved0;
        [FieldOffset(0x0E)] public ushort reserved1;
        [FieldOffset(0x10)] public long saveDate;
        [FieldOffset(0x18)] public byte index;
        [FieldOffset(0x1C)] public unsafe fixed uint reserved[4];
    }

    public enum VoiceLanguageType : sbyte
    {
        VOICE_LANGUAGE_ENGLISH = 0,
        VOICE_LANGUAGE_FRENCH = 1,
        VOICE_LANGUAGE_ITALIAN = 2,
        VOICE_LANGUAGE_GERMAN = 3,
        VOICE_LANGUAGE_SPANISH = 4,
        VOICE_LANGUAGE_JAPANESE = 5,
        NUM_VOICE_LANGUAGES = 6
    }

    public enum LanguageType : sbyte
    {
        LANGUAGE_ENGLISH = 0,
        LANGUAGE_FRENCH = 1,
        LANGUAGE_ITALIAN = 2,
        LANGUAGE_GERMAN = 3,
        LANGUAGE_SPANISH = 4,
        LANGUAGE_POLISH = 5,
        LANGUAGE_PORTUGUESE = 6,
        LANGUAGE_RUSSIAN = 7,
        LANGUAGE_JAPANESE = 8,
        LANGUAGE_ZHONGWEN = 9,
        LANGUAGE_ZHONGWEN_S = 10,
        LANGUAGE_KOREAN = 11,
        LANGUAGE_THAI = 12,
        NUM_LANGUAGES = 13
    }

    public enum SkinType : sbyte
    {
        Original = 0,
        Type1 = 1
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x24)]
    public struct OptionGamePlayData
    {
        [FieldOffset(0x00)] public byte initialSpeedRate;
        [FieldOffset(0x01)] public byte boostInitialSpeedRate;
        [FieldOffset(0x02)] public byte acceleRate;
        [FieldOffset(0x03)] public byte maxSpeedRate;
        [FieldOffset(0x04)] public byte minTurnSpeedRate;
        [FieldOffset(0x05)] public byte boostMinTurnSpeedRate;
        [FieldOffset(0x06)] public byte rotateForceRate;
        [FieldOffset(0x07)] public byte bumpJumpGravityRate;
        [FieldOffset(0x08)] public byte brakeRate;
        [FieldOffset(0x09)] public VoiceLanguageType speech;
        [FieldOffset(0x0A)] public LanguageType text;
        [FieldOffset(0x0C)] public ushort config;
        [FieldOffset(0x0E)] public byte padSensibilityRate;
        [FieldOffset(0x0F)] public byte mouseSensibilityRate;
        [FieldOffset(0x10)] public byte flags;
        [FieldOffset(0x11)] public SkinType dlcSkinGeneClassic;
        [FieldOffset(0x12)] public SkinType dlcSkinGeneModern;
        [FieldOffset(0x13)] public SkinType dlcSkinShadow;
        [FieldOffset(0x14)] public byte dlcConfig;
        [FieldOffset(0x15)] public unsafe fixed byte reserved1[5];
        [FieldOffset(0x1C)] public unsafe fixed uint reserved2[2];
    }

    public enum InputButtonImageKind : sbyte
    {
        Default = 0,
        PS4 = 1,
        PS5 = 2,
        XBOX = 3,
        SCARLETT = 4,
        SWITCH = 5,
        STEAM = 6,
        Num = 7
    }

    public enum InputStyleKind : sbyte
    {
        InputStyleKind_Default = 0,
        Style2 = 1,
        Custom = 2,
        InputStyleKind_Num = 3
    }

    public enum InputKey : int
    {
        Invalid = -1,
        GamePad_DPadLeft = 0,
        GamePad_DPadRight = 1,
        GamePad_DPadUp = 2,
        GamePad_DPadDown = 3,
        GamePad_ButtonLeft = 4,
        GamePad_ButtonRight = 5,
        GamePad_ButtonTop = 6,
        GamePad_ButtonBottom = 7,
        GamePad_LeftX = 8,
        GamePad_LeftY = 9,
        GamePad_RightX = 10,
        GamePad_RightY = 11,
        GamePad_LeftShoulder = 12,
        GamePad_LeftTrigger = 13,
        GamePad_LeftClick = 14,
        GamePad_RightShoulder = 15,
        GamePad_RightTrigger = 16,
        GamePad_RightClick = 17,
        GamePad_LeftStickLeft = 18,
        GamePad_LeftStickRight = 19,
        GamePad_LeftStickUp = 20,
        GamePad_LeftStickDown = 21,
        GamePad_RightStickLeft = 22,
        GamePad_RightStickRight = 23,
        GamePad_RightStickUp = 24,
        GamePad_RightStickDown = 25,
        GamePad_Start = 26,
        GamePad_Select = 27,
        GamePad_LeftSideTriggerLeft = 28,
        GamePad_LeftSideTriggerRight = 29,
        GamePad_RightSideTriggerLeft = 30,
        GamePad_RightSideTriggerRight = 31,
        Keyboard_Nop = 32,
        Keyboard_A = 33,
        Keyboard_B = 34,
        Keyboard_C = 35,
        Keyboard_D = 36,
        Keyboard_E = 37,
        Keyboard_F = 38,
        Keyboard_G = 39,
        Keyboard_H = 40,
        Keyboard_I = 41,
        Keyboard_J = 42,
        Keyboard_K = 43,
        Keyboard_L = 44,
        Keyboard_M = 45,
        Keyboard_N = 46,
        Keyboard_O = 47,
        Keyboard_P = 48,
        Keyboard_Q = 49,
        Keyboard_R = 50,
        Keyboard_S = 51,
        Keyboard_T = 52,
        Keyboard_U = 53,
        Keyboard_V = 54,
        Keyboard_W = 55,
        Keyboard_X = 56,
        Keyboard_Y = 57,
        Keyboard_Z = 58,
        Keyboard_1 = 59,
        Keyboard_2 = 60,
        Keyboard_3 = 61,
        Keyboard_4 = 62,
        Keyboard_5 = 63,
        Keyboard_6 = 64,
        Keyboard_7 = 65,
        Keyboard_8 = 66,
        Keyboard_9 = 67,
        Keyboard_0 = 68,
        Keyboard_Enter = 69,
        Keyboard_Escape = 70,
        Keyboard_BackSpace = 71,
        Keyboard_Tab = 72,
        Keyboard_Spacebar = 73,
        Keyboard_Minus = 74,
        Keyboard_Accent = 75,
        Keyboard_Atmark = 76,
        Keyboard_LeftBracket = 77,
        Keyboard_BackSlash = 78,
        Keyboard_RightBracket = 79,
        Keyboard_SemiColon = 80,
        Keyboard_Colon = 81,
        Keyboard_Comma = 82,
        Keyboard_Period = 83,
        Keyboard_Slash = 84,
        Keyboard_CapsLock = 85,
        Keyboard_Grave = 86,
        Keyboard_Equals = 87,
        Keyboard_Apostrophe = 88,
        Keyboard_OEM_102 = 89,
        Keyboard_ABNT_C1 = 90,
        Keyboard_F1 = 91,
        Keyboard_F2 = 92,
        Keyboard_F3 = 93,
        Keyboard_F4 = 94,
        Keyboard_F5 = 95,
        Keyboard_F6 = 96,
        Keyboard_F7 = 97,
        Keyboard_F8 = 98,
        Keyboard_F9 = 99,
        Keyboard_F10 = 100,
        Keyboard_F11 = 101,
        Keyboard_F12 = 102,
        Keyboard_Insert = 103,
        Keyboard_Home = 104,
        Keyboard_PageUp = 105,
        Keyboard_Delete = 106,
        Keyboard_End = 107,
        Keyboard_PageDown = 108,
        Keyboard_LeftArrow = 109,
        Keyboard_RightArrow = 110,
        Keyboard_UpArrow = 111,
        Keyboard_DownArrow = 112,
        Keyboard_PadSlash = 113,
        Keyboard_PadAsterisk = 114,
        Keyboard_PadMinus = 115,
        Keyboard_PadPlus = 116,
        Keyboard_PadEnter = 117,
        Keyboard_PadNum1 = 118,
        Keyboard_PadNum2 = 119,
        Keyboard_PadNum3 = 120,
        Keyboard_PadNum4 = 121,
        Keyboard_PadNum5 = 122,
        Keyboard_PadNum6 = 123,
        Keyboard_PadNum7 = 124,
        Keyboard_PadNum8 = 125,
        Keyboard_PadNum9 = 126,
        Keyboard_PadNum0 = 127,
        Keyboard_PadPeriod = 128,
        Keyboard_LeftCtrl = 129,
        Keyboard_RightCtrl = 130,
        Keyboard_LeftShift = 131,
        Keyboard_RightShift = 132,
        Keyboard_LeftAlt = 133,
        Keyboard_RightAlt = 134,
        Keyboard_LeftGui = 135,
        Keyboard_RightGui = 136,
        Mouse_X = 137,
        Mouse_Y = 138,
        Mouse_ButtonLeft = 139,
        Mouse_ButtonRight = 140,
        Mouse_ButtonMiddle = 141,
        Mouse_ButtonX1 = 142,
        Mouse_ButtonX2 = 143,
        Mouse_ButtonX3 = 144,
        Mouse_ButtonX4 = 145,
        Mouse_ButtonX5 = 146,
        Mouse_Wheel = 147,
        Mouse_WheelUp = 148,
        Mouse_WheelDown = 149
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x224)]
    public struct OptionControlsData
    {
        [FieldOffset(0x00)] public InputButtonImageKind buttonImageKind;
        [FieldOffset(0x01)] public InputStyleKind gamepadStyleKind;
        [FieldOffset(0x04)] public unsafe fixed byte /* InputKey[45] */ _padMappings[180];

        public unsafe InputKey* padMappings
        {
            get
            {
                fixed (byte* p_padMappings = _padMappings)
                    return (InputKey*)p_padMappings;
            }
        }

        [FieldOffset(0xB8)] public unsafe fixed byte /* InputKey[45] */ _mainMappings[180];

        public unsafe InputKey* mainMappings
        {
            get
            {
                fixed (byte* p_mainMappings = _mainMappings)
                    return (InputKey*)p_mainMappings;
            }
        }

        [FieldOffset(0x16C)] public unsafe fixed byte /* InputKey[45] */ _subMappings[180];

        public unsafe InputKey* subMappings
        {
            get
            {
                fixed (byte* p_subMappings = _subMappings)
                    return (InputKey*)p_subMappings;
            }
        }

        [FieldOffset(0x220)] public byte reserved;
    }

    public enum MovementStyle : sbyte
    {
        PadSimulate = 0,
        Aiming = 1
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct OptionCameraData
    {
        [FieldOffset(0x00)] public float rotateSpeedPad;
        [FieldOffset(0x04)] public float rotateSpeedVertMouse;
        [FieldOffset(0x08)] public float rotateSpeedHorzMouse;
        [FieldOffset(0x0C)] public float reticleSpeedPad;
        [FieldOffset(0x10)] public float reticleSpeedVertMouse;
        [FieldOffset(0x14)] public float reticleSpeedHorzMouse;
        [FieldOffset(0x18)] public byte rotateSpeedRate;
        [FieldOffset(0x19)] public byte distanceRate;
        [FieldOffset(0x1A)] public byte fovyRate;
        [FieldOffset(0x1B)] public MovementStyle movementStyle;
        [FieldOffset(0x1C)] public byte config;
        [FieldOffset(0x20)] public unsafe fixed uint reserved[4];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x14)]
    public struct OptionAudioData
    {
        [FieldOffset(0x00)] public byte masterVolume;
        [FieldOffset(0x01)] public byte sfxVolume;
        [FieldOffset(0x02)] public byte musicVolume;
        [FieldOffset(0x03)] public byte voiceVolume;
        [FieldOffset(0x04)] public unsafe fixed uint reserved[4];
    }

    public enum FrameRate : sbyte
    {
        FPS60 = 0,
        FPS30 = 1,
        FPS120 = 2,
        FPSNoLimit = 3
    }

    public enum Shadow : sbyte
    {
        High = 0,
        Low = 1
    }

    public enum Bloom : sbyte
    {
        Bloom_High = 0,
        Bloom_Low = 1
    }

    public enum VolumetricLight : sbyte
    {
        VolumetricLight_High = 0,
        VolumetricLight_Low = 1
    }

    public enum AntiAliasing : sbyte
    {
        TAA = 0,
        FXAA = 1,
        None = 2
    }

    public enum AnisotropicFiltering : sbyte
    {
        AnisotropicFiltering_None = 0,
        AnisotropicFiltering_Low = 1,
        Medium = 2,
        AnisotropicFiltering_High = 3
    }

    public enum DOF : sbyte
    {
        Disabled = 0,
        DOF_Low = 1,
        DOF_Medium = 2,
        DOF_High = 3
    }

    public enum RederingScale : sbyte
    {
        RederingScale_High = 0,
        RederingScale_Medium = 1,
        RederingScale_Low = 2
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct OptionGraphicsData
    {
        [FieldOffset(0x00)] public FrameRate frameRate;
        [FieldOffset(0x01)] public Shadow shadow;
        [FieldOffset(0x02)] public Bloom bloom;
        [FieldOffset(0x03)] public VolumetricLight volumetricLight;
        [FieldOffset(0x04)] public byte brightness;
        [FieldOffset(0x05)] public AntiAliasing antiAliasing;
        [FieldOffset(0x06)] public AnisotropicFiltering anisotropicFiltering;
        [FieldOffset(0x07)] public DOF depthOfField;
        [FieldOffset(0x08)] public byte config;
        [FieldOffset(0x09)] public RederingScale renderingScale;
        [FieldOffset(0x0A)] public ushort width;
        [FieldOffset(0x0C)] public ushort height;
        [FieldOffset(0x0E)] public byte reserved1;
        [FieldOffset(0x10)] public unsafe fixed uint reserved[2];
    }

    public enum RankType : byte
    {
        RANK_S = 0,
        RANK_A = 1,
        RANK_B = 2,
        RANK_C = 3,
        RANK_D = 4,
        RANK_NUM = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public struct RankingData
    {
        [FieldOffset(0x00)] public byte flags;
        [FieldOffset(0x04)] public uint bestScore;
        [FieldOffset(0x08)] public uint bestScoreDwing;
        [FieldOffset(0x0C)] public uint bestRing;
        [FieldOffset(0x10)] public uint bestRingDwing;
        [FieldOffset(0x14)] public unsafe fixed uint bestTime[3];
        [FieldOffset(0x20)] public unsafe fixed uint bestTimeDwing[3];
        [FieldOffset(0x2C)] public RankType bestRank;
        [FieldOffset(0x2D)] public RankType bestRankDwing;
        [FieldOffset(0x30)] public uint clearCount;
        [FieldOffset(0x34)] public bool uploaded;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x57C)]
    public struct RankingContainerData
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* RankingData[25] */ _ranking[1400];

        public unsafe RankingData* ranking
        {
            get
            {
                fixed (byte* p_ranking = _ranking)
                    return (RankingData*)p_ranking;
            }
        }

        [FieldOffset(0x578)] public bool enableDWing;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public struct CRMContainerData
    {
        [FieldOffset(0x00)] public unsafe fixed sbyte uuid[40];
        [FieldOffset(0x28)] public unsafe fixed uint reserved[4];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2B0)]
    public struct AddContentDataSystem
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* RankingData[10] */ _addRanking[560];

        public unsafe RankingData* addRanking
        {
            get
            {
                fixed (byte* p_addRanking = _addRanking)
                    return (RankingData*)p_addRanking;
            }
        }

        [FieldOffset(0x230)] public unsafe fixed uint reserved[32];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xB38)]
    public struct SystemData
    {
        [FieldOffset(0x00)] public HeaderData header;
        [FieldOffset(0x30)] public OptionGamePlayData gameplay;
        [FieldOffset(0x54)] public OptionControlsData controls;
        [FieldOffset(0x278)] public OptionCameraData camera;
        [FieldOffset(0x2A8)] public OptionAudioData audio;
        [FieldOffset(0x2BC)] public OptionGraphicsData graphics;
        [FieldOffset(0x2D4)] public RankingContainerData rankings;
        [FieldOffset(0x850)] public CRMContainerData crm;
        [FieldOffset(0x888)] public AddContentDataSystem addData;
    }

}