Library "CreditParamter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 8)]
    public struct UnmanagedString
    {
        [FieldOffset(0)] public long pValue;

        public string Value
        {
            get
            {
                if (pValue == 0)
                    return string.Empty;

                return Marshal.PtrToStringAnsi((nint)pValue);
            }

            set => pValue = (long)Marshal.StringToHGlobalAnsi(value);
        }

        public UnmanagedString(string in_value)
        {
            Value = in_value;
        }

        public static implicit operator UnmanagedString(string in_value)
        {
            return new UnmanagedString(in_value);
        }

        public static bool operator ==(UnmanagedString in_left, string in_right)
        {
            return in_left.Value == in_right;
        }

        public static bool operator !=(UnmanagedString in_left, string in_right)
        {
            return !(in_left == in_right);
        }

        public override bool Equals(object in_obj)
        {
            if (in_obj is string str)
                return Value == str;

            return base.Equals(in_obj);
        }

        public override int GetHashCode()
        {
            return Value.GetHashCode();
        }

        public override string ToString()
        {
            return Value;
        }
    }

    public enum CreditItemKind : sbyte
    {
        Empty = 0,
        Category = 1,
        Post = 2,
        Name = 3,
        Logo = 4,
        Num = 5
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x68)]
    public struct CreditItemInfo
    {
        [FieldOffset(0x00)] public CreditItemKind creditItemKind;
        [FieldOffset(0x01)] public byte numItems;
        [FieldOffset(0x02)] public bool isLastItem;
        [FieldOffset(0x08)] public UnmanagedString str__arr0;
        [FieldOffset(0x18)] public UnmanagedString str__arr1;
        [FieldOffset(0x28)] public UnmanagedString str__arr2;
        [FieldOffset(0x38)] public UnmanagedString str__arr3;
        [FieldOffset(0x48)] public UnmanagedString str__arr4;
        [FieldOffset(0x58)] public UnmanagedString str__arr5;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x18)]
    public struct CreditBGInfo
    {
        [FieldOffset(0x00)] public UnmanagedString bgName;
        [FieldOffset(0x10)] public float displayTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x34130)]
    public struct CreditParamter
    {
        [FieldOffset(0x00)] public float blackBGTime;
        [FieldOffset(0x04)] public float emptySize;
        [FieldOffset(0x08)] public float creditTime;
        [FieldOffset(0x0C)] public float finishInterval;
        [FieldOffset(0x10)] public float guideDisplayTime;
        [FieldOffset(0x14)] public float lastItemStopHeight;
        [FieldOffset(0x18)] public float bgmDelay;
        [FieldOffset(0x1C)] public float bgmFadeOutTime;
        [FieldOffset(0x20)] public UnmanagedString unclearBGMName;
        [FieldOffset(0x30)] public UnmanagedString bgmName;
        [FieldOffset(0x40)] public CreditItemInfo itemInfos__arr0;
        [FieldOffset(0xA8)] public CreditItemInfo itemInfos__arr1;
        [FieldOffset(0x110)] public CreditItemInfo itemInfos__arr2;
        [FieldOffset(0x178)] public CreditItemInfo itemInfos__arr3;
        [FieldOffset(0x1E0)] public CreditItemInfo itemInfos__arr4;
        [FieldOffset(0x248)] public CreditItemInfo itemInfos__arr5;
        [FieldOffset(0x2B0)] public CreditItemInfo itemInfos__arr6;
        [FieldOffset(0x318)] public CreditItemInfo itemInfos__arr7;
        [FieldOffset(0x380)] public CreditItemInfo itemInfos__arr8;
        [FieldOffset(0x3E8)] public CreditItemInfo itemInfos__arr9;
        [FieldOffset(0x450)] public CreditItemInfo itemInfos__arr10;
        [FieldOffset(0x4B8)] public CreditItemInfo itemInfos__arr11;
        [FieldOffset(0x520)] public CreditItemInfo itemInfos__arr12;
        [FieldOffset(0x588)] public CreditItemInfo itemInfos__arr13;
        [FieldOffset(0x5F0)] public CreditItemInfo itemInfos__arr14;
        [FieldOffset(0x658)] public CreditItemInfo itemInfos__arr15;
        [FieldOffset(0x6C0)] public CreditItemInfo itemInfos__arr16;
        [FieldOffset(0x728)] public CreditItemInfo itemInfos__arr17;
        [FieldOffset(0x790)] public CreditItemInfo itemInfos__arr18;
        [FieldOffset(0x7F8)] public CreditItemInfo itemInfos__arr19;
        [FieldOffset(0x860)] public CreditItemInfo itemInfos__arr20;
        [FieldOffset(0x8C8)] public CreditItemInfo itemInfos__arr21;
        [FieldOffset(0x930)] public CreditItemInfo itemInfos__arr22;
        [FieldOffset(0x998)] public CreditItemInfo itemInfos__arr23;
        [FieldOffset(0xA00)] public CreditItemInfo itemInfos__arr24;
        [FieldOffset(0xA68)] public CreditItemInfo itemInfos__arr25;
        [FieldOffset(0xAD0)] public CreditItemInfo itemInfos__arr26;
        [FieldOffset(0xB38)] public CreditItemInfo itemInfos__arr27;
        [FieldOffset(0xBA0)] public CreditItemInfo itemInfos__arr28;
        [FieldOffset(0xC08)] public CreditItemInfo itemInfos__arr29;
        [FieldOffset(0xC70)] public CreditItemInfo itemInfos__arr30;
        [FieldOffset(0xCD8)] public CreditItemInfo itemInfos__arr31;
        [FieldOffset(0xD40)] public CreditItemInfo itemInfos__arr32;
        [FieldOffset(0xDA8)] public CreditItemInfo itemInfos__arr33;
        [FieldOffset(0xE10)] public CreditItemInfo itemInfos__arr34;
        [FieldOffset(0xE78)] public CreditItemInfo itemInfos__arr35;
        [FieldOffset(0xEE0)] public CreditItemInfo itemInfos__arr36;
        [FieldOffset(0xF48)] public CreditItemInfo itemInfos__arr37;
        [FieldOffset(0xFB0)] public CreditItemInfo itemInfos__arr38;
        [FieldOffset(0x1018)] public CreditItemInfo itemInfos__arr39;
        [FieldOffset(0x1080)] public CreditItemInfo itemInfos__arr40;
        [FieldOffset(0x10E8)] public CreditItemInfo itemInfos__arr41;
        [FieldOffset(0x1150)] public CreditItemInfo itemInfos__arr42;
        [FieldOffset(0x11B8)] public CreditItemInfo itemInfos__arr43;
        [FieldOffset(0x1220)] public CreditItemInfo itemInfos__arr44;
        [FieldOffset(0x1288)] public CreditItemInfo itemInfos__arr45;
        [FieldOffset(0x12F0)] public CreditItemInfo itemInfos__arr46;
        [FieldOffset(0x1358)] public CreditItemInfo itemInfos__arr47;
        [FieldOffset(0x13C0)] public CreditItemInfo itemInfos__arr48;
        [FieldOffset(0x1428)] public CreditItemInfo itemInfos__arr49;
        [FieldOffset(0x1490)] public CreditItemInfo itemInfos__arr50;
        [FieldOffset(0x14F8)] public CreditItemInfo itemInfos__arr51;
        [FieldOffset(0x1560)] public CreditItemInfo itemInfos__arr52;
        [FieldOffset(0x15C8)] public CreditItemInfo itemInfos__arr53;
        [FieldOffset(0x1630)] public CreditItemInfo itemInfos__arr54;
        [FieldOffset(0x1698)] public CreditItemInfo itemInfos__arr55;
        [FieldOffset(0x1700)] public CreditItemInfo itemInfos__arr56;
        [FieldOffset(0x1768)] public CreditItemInfo itemInfos__arr57;
        [FieldOffset(0x17D0)] public CreditItemInfo itemInfos__arr58;
        [FieldOffset(0x1838)] public CreditItemInfo itemInfos__arr59;
        [FieldOffset(0x18A0)] public CreditItemInfo itemInfos__arr60;
        [FieldOffset(0x1908)] public CreditItemInfo itemInfos__arr61;
        [FieldOffset(0x1970)] public CreditItemInfo itemInfos__arr62;
        [FieldOffset(0x19D8)] public CreditItemInfo itemInfos__arr63;
        [FieldOffset(0x1A40)] public CreditItemInfo itemInfos__arr64;
        [FieldOffset(0x1AA8)] public CreditItemInfo itemInfos__arr65;
        [FieldOffset(0x1B10)] public CreditItemInfo itemInfos__arr66;
        [FieldOffset(0x1B78)] public CreditItemInfo itemInfos__arr67;
        [FieldOffset(0x1BE0)] public CreditItemInfo itemInfos__arr68;
        [FieldOffset(0x1C48)] public CreditItemInfo itemInfos__arr69;
        [FieldOffset(0x1CB0)] public CreditItemInfo itemInfos__arr70;
        [FieldOffset(0x1D18)] public CreditItemInfo itemInfos__arr71;
        [FieldOffset(0x1D80)] public CreditItemInfo itemInfos__arr72;
        [FieldOffset(0x1DE8)] public CreditItemInfo itemInfos__arr73;
        [FieldOffset(0x1E50)] public CreditItemInfo itemInfos__arr74;
        [FieldOffset(0x1EB8)] public CreditItemInfo itemInfos__arr75;
        [FieldOffset(0x1F20)] public CreditItemInfo itemInfos__arr76;
        [FieldOffset(0x1F88)] public CreditItemInfo itemInfos__arr77;
        [FieldOffset(0x1FF0)] public CreditItemInfo itemInfos__arr78;
        [FieldOffset(0x2058)] public CreditItemInfo itemInfos__arr79;
        [FieldOffset(0x20C0)] public CreditItemInfo itemInfos__arr80;
        [FieldOffset(0x2128)] public CreditItemInfo itemInfos__arr81;
        [FieldOffset(0x2190)] public CreditItemInfo itemInfos__arr82;
        [FieldOffset(0x21F8)] public CreditItemInfo itemInfos__arr83;
        [FieldOffset(0x2260)] public CreditItemInfo itemInfos__arr84;
        [FieldOffset(0x22C8)] public CreditItemInfo itemInfos__arr85;
        [FieldOffset(0x2330)] public CreditItemInfo itemInfos__arr86;
        [FieldOffset(0x2398)] public CreditItemInfo itemInfos__arr87;
        [FieldOffset(0x2400)] public CreditItemInfo itemInfos__arr88;
        [FieldOffset(0x2468)] public CreditItemInfo itemInfos__arr89;
        [FieldOffset(0x24D0)] public CreditItemInfo itemInfos__arr90;
        [FieldOffset(0x2538)] public CreditItemInfo itemInfos__arr91;
        [FieldOffset(0x25A0)] public CreditItemInfo itemInfos__arr92;
        [FieldOffset(0x2608)] public CreditItemInfo itemInfos__arr93;
        [FieldOffset(0x2670)] public CreditItemInfo itemInfos__arr94;
        [FieldOffset(0x26D8)] public CreditItemInfo itemInfos__arr95;
        [FieldOffset(0x2740)] public CreditItemInfo itemInfos__arr96;
        [FieldOffset(0x27A8)] public CreditItemInfo itemInfos__arr97;
        [FieldOffset(0x2810)] public CreditItemInfo itemInfos__arr98;
        [FieldOffset(0x2878)] public CreditItemInfo itemInfos__arr99;
        [FieldOffset(0x28E0)] public CreditItemInfo itemInfos__arr100;
        [FieldOffset(0x2948)] public CreditItemInfo itemInfos__arr101;
        [FieldOffset(0x29B0)] public CreditItemInfo itemInfos__arr102;
        [FieldOffset(0x2A18)] public CreditItemInfo itemInfos__arr103;
        [FieldOffset(0x2A80)] public CreditItemInfo itemInfos__arr104;
        [FieldOffset(0x2AE8)] public CreditItemInfo itemInfos__arr105;
        [FieldOffset(0x2B50)] public CreditItemInfo itemInfos__arr106;
        [FieldOffset(0x2BB8)] public CreditItemInfo itemInfos__arr107;
        [FieldOffset(0x2C20)] public CreditItemInfo itemInfos__arr108;
        [FieldOffset(0x2C88)] public CreditItemInfo itemInfos__arr109;
        [FieldOffset(0x2CF0)] public CreditItemInfo itemInfos__arr110;
        [FieldOffset(0x2D58)] public CreditItemInfo itemInfos__arr111;
        [FieldOffset(0x2DC0)] public CreditItemInfo itemInfos__arr112;
        [FieldOffset(0x2E28)] public CreditItemInfo itemInfos__arr113;
        [FieldOffset(0x2E90)] public CreditItemInfo itemInfos__arr114;
        [FieldOffset(0x2EF8)] public CreditItemInfo itemInfos__arr115;
        [FieldOffset(0x2F60)] public CreditItemInfo itemInfos__arr116;
        [FieldOffset(0x2FC8)] public CreditItemInfo itemInfos__arr117;
        [FieldOffset(0x3030)] public CreditItemInfo itemInfos__arr118;
        [FieldOffset(0x3098)] public CreditItemInfo itemInfos__arr119;
        [FieldOffset(0x3100)] public CreditItemInfo itemInfos__arr120;
        [FieldOffset(0x3168)] public CreditItemInfo itemInfos__arr121;
        [FieldOffset(0x31D0)] public CreditItemInfo itemInfos__arr122;
        [FieldOffset(0x3238)] public CreditItemInfo itemInfos__arr123;
        [FieldOffset(0x32A0)] public CreditItemInfo itemInfos__arr124;
        [FieldOffset(0x3308)] public CreditItemInfo itemInfos__arr125;
        [FieldOffset(0x3370)] public CreditItemInfo itemInfos__arr126;
        [FieldOffset(0x33D8)] public CreditItemInfo itemInfos__arr127;
        [FieldOffset(0x3440)] public CreditItemInfo itemInfos__arr128;
        [FieldOffset(0x34A8)] public CreditItemInfo itemInfos__arr129;
        [FieldOffset(0x3510)] public CreditItemInfo itemInfos__arr130;
        [FieldOffset(0x3578)] public CreditItemInfo itemInfos__arr131;
        [FieldOffset(0x35E0)] public CreditItemInfo itemInfos__arr132;
        [FieldOffset(0x3648)] public CreditItemInfo itemInfos__arr133;
        [FieldOffset(0x36B0)] public CreditItemInfo itemInfos__arr134;
        [FieldOffset(0x3718)] public CreditItemInfo itemInfos__arr135;
        [FieldOffset(0x3780)] public CreditItemInfo itemInfos__arr136;
        [FieldOffset(0x37E8)] public CreditItemInfo itemInfos__arr137;
        [FieldOffset(0x3850)] public CreditItemInfo itemInfos__arr138;
        [FieldOffset(0x38B8)] public CreditItemInfo itemInfos__arr139;
        [FieldOffset(0x3920)] public CreditItemInfo itemInfos__arr140;
        [FieldOffset(0x3988)] public CreditItemInfo itemInfos__arr141;
        [FieldOffset(0x39F0)] public CreditItemInfo itemInfos__arr142;
        [FieldOffset(0x3A58)] public CreditItemInfo itemInfos__arr143;
        [FieldOffset(0x3AC0)] public CreditItemInfo itemInfos__arr144;
        [FieldOffset(0x3B28)] public CreditItemInfo itemInfos__arr145;
        [FieldOffset(0x3B90)] public CreditItemInfo itemInfos__arr146;
        [FieldOffset(0x3BF8)] public CreditItemInfo itemInfos__arr147;
        [FieldOffset(0x3C60)] public CreditItemInfo itemInfos__arr148;
        [FieldOffset(0x3CC8)] public CreditItemInfo itemInfos__arr149;
        [FieldOffset(0x3D30)] public CreditItemInfo itemInfos__arr150;
        [FieldOffset(0x3D98)] public CreditItemInfo itemInfos__arr151;
        [FieldOffset(0x3E00)] public CreditItemInfo itemInfos__arr152;
        [FieldOffset(0x3E68)] public CreditItemInfo itemInfos__arr153;
        [FieldOffset(0x3ED0)] public CreditItemInfo itemInfos__arr154;
        [FieldOffset(0x3F38)] public CreditItemInfo itemInfos__arr155;
        [FieldOffset(0x3FA0)] public CreditItemInfo itemInfos__arr156;
        [FieldOffset(0x4008)] public CreditItemInfo itemInfos__arr157;
        [FieldOffset(0x4070)] public CreditItemInfo itemInfos__arr158;
        [FieldOffset(0x40D8)] public CreditItemInfo itemInfos__arr159;
        [FieldOffset(0x4140)] public CreditItemInfo itemInfos__arr160;
        [FieldOffset(0x41A8)] public CreditItemInfo itemInfos__arr161;
        [FieldOffset(0x4210)] public CreditItemInfo itemInfos__arr162;
        [FieldOffset(0x4278)] public CreditItemInfo itemInfos__arr163;
        [FieldOffset(0x42E0)] public CreditItemInfo itemInfos__arr164;
        [FieldOffset(0x4348)] public CreditItemInfo itemInfos__arr165;
        [FieldOffset(0x43B0)] public CreditItemInfo itemInfos__arr166;
        [FieldOffset(0x4418)] public CreditItemInfo itemInfos__arr167;
        [FieldOffset(0x4480)] public CreditItemInfo itemInfos__arr168;
        [FieldOffset(0x44E8)] public CreditItemInfo itemInfos__arr169;
        [FieldOffset(0x4550)] public CreditItemInfo itemInfos__arr170;
        [FieldOffset(0x45B8)] public CreditItemInfo itemInfos__arr171;
        [FieldOffset(0x4620)] public CreditItemInfo itemInfos__arr172;
        [FieldOffset(0x4688)] public CreditItemInfo itemInfos__arr173;
        [FieldOffset(0x46F0)] public CreditItemInfo itemInfos__arr174;
        [FieldOffset(0x4758)] public CreditItemInfo itemInfos__arr175;
        [FieldOffset(0x47C0)] public CreditItemInfo itemInfos__arr176;
        [FieldOffset(0x4828)] public CreditItemInfo itemInfos__arr177;
        [FieldOffset(0x4890)] public CreditItemInfo itemInfos__arr178;
        [FieldOffset(0x48F8)] public CreditItemInfo itemInfos__arr179;
        [FieldOffset(0x4960)] public CreditItemInfo itemInfos__arr180;
        [FieldOffset(0x49C8)] public CreditItemInfo itemInfos__arr181;
        [FieldOffset(0x4A30)] public CreditItemInfo itemInfos__arr182;
        [FieldOffset(0x4A98)] public CreditItemInfo itemInfos__arr183;
        [FieldOffset(0x4B00)] public CreditItemInfo itemInfos__arr184;
        [FieldOffset(0x4B68)] public CreditItemInfo itemInfos__arr185;
        [FieldOffset(0x4BD0)] public CreditItemInfo itemInfos__arr186;
        [FieldOffset(0x4C38)] public CreditItemInfo itemInfos__arr187;
        [FieldOffset(0x4CA0)] public CreditItemInfo itemInfos__arr188;
        [FieldOffset(0x4D08)] public CreditItemInfo itemInfos__arr189;
        [FieldOffset(0x4D70)] public CreditItemInfo itemInfos__arr190;
        [FieldOffset(0x4DD8)] public CreditItemInfo itemInfos__arr191;
        [FieldOffset(0x4E40)] public CreditItemInfo itemInfos__arr192;
        [FieldOffset(0x4EA8)] public CreditItemInfo itemInfos__arr193;
        [FieldOffset(0x4F10)] public CreditItemInfo itemInfos__arr194;
        [FieldOffset(0x4F78)] public CreditItemInfo itemInfos__arr195;
        [FieldOffset(0x4FE0)] public CreditItemInfo itemInfos__arr196;
        [FieldOffset(0x5048)] public CreditItemInfo itemInfos__arr197;
        [FieldOffset(0x50B0)] public CreditItemInfo itemInfos__arr198;
        [FieldOffset(0x5118)] public CreditItemInfo itemInfos__arr199;
        [FieldOffset(0x5180)] public CreditItemInfo itemInfos__arr200;
        [FieldOffset(0x51E8)] public CreditItemInfo itemInfos__arr201;
        [FieldOffset(0x5250)] public CreditItemInfo itemInfos__arr202;
        [FieldOffset(0x52B8)] public CreditItemInfo itemInfos__arr203;
        [FieldOffset(0x5320)] public CreditItemInfo itemInfos__arr204;
        [FieldOffset(0x5388)] public CreditItemInfo itemInfos__arr205;
        [FieldOffset(0x53F0)] public CreditItemInfo itemInfos__arr206;
        [FieldOffset(0x5458)] public CreditItemInfo itemInfos__arr207;
        [FieldOffset(0x54C0)] public CreditItemInfo itemInfos__arr208;
        [FieldOffset(0x5528)] public CreditItemInfo itemInfos__arr209;
        [FieldOffset(0x5590)] public CreditItemInfo itemInfos__arr210;
        [FieldOffset(0x55F8)] public CreditItemInfo itemInfos__arr211;
        [FieldOffset(0x5660)] public CreditItemInfo itemInfos__arr212;
        [FieldOffset(0x56C8)] public CreditItemInfo itemInfos__arr213;
        [FieldOffset(0x5730)] public CreditItemInfo itemInfos__arr214;
        [FieldOffset(0x5798)] public CreditItemInfo itemInfos__arr215;
        [FieldOffset(0x5800)] public CreditItemInfo itemInfos__arr216;
        [FieldOffset(0x5868)] public CreditItemInfo itemInfos__arr217;
        [FieldOffset(0x58D0)] public CreditItemInfo itemInfos__arr218;
        [FieldOffset(0x5938)] public CreditItemInfo itemInfos__arr219;
        [FieldOffset(0x59A0)] public CreditItemInfo itemInfos__arr220;
        [FieldOffset(0x5A08)] public CreditItemInfo itemInfos__arr221;
        [FieldOffset(0x5A70)] public CreditItemInfo itemInfos__arr222;
        [FieldOffset(0x5AD8)] public CreditItemInfo itemInfos__arr223;
        [FieldOffset(0x5B40)] public CreditItemInfo itemInfos__arr224;
        [FieldOffset(0x5BA8)] public CreditItemInfo itemInfos__arr225;
        [FieldOffset(0x5C10)] public CreditItemInfo itemInfos__arr226;
        [FieldOffset(0x5C78)] public CreditItemInfo itemInfos__arr227;
        [FieldOffset(0x5CE0)] public CreditItemInfo itemInfos__arr228;
        [FieldOffset(0x5D48)] public CreditItemInfo itemInfos__arr229;
        [FieldOffset(0x5DB0)] public CreditItemInfo itemInfos__arr230;
        [FieldOffset(0x5E18)] public CreditItemInfo itemInfos__arr231;
        [FieldOffset(0x5E80)] public CreditItemInfo itemInfos__arr232;
        [FieldOffset(0x5EE8)] public CreditItemInfo itemInfos__arr233;
        [FieldOffset(0x5F50)] public CreditItemInfo itemInfos__arr234;
        [FieldOffset(0x5FB8)] public CreditItemInfo itemInfos__arr235;
        [FieldOffset(0x6020)] public CreditItemInfo itemInfos__arr236;
        [FieldOffset(0x6088)] public CreditItemInfo itemInfos__arr237;
        [FieldOffset(0x60F0)] public CreditItemInfo itemInfos__arr238;
        [FieldOffset(0x6158)] public CreditItemInfo itemInfos__arr239;
        [FieldOffset(0x61C0)] public CreditItemInfo itemInfos__arr240;
        [FieldOffset(0x6228)] public CreditItemInfo itemInfos__arr241;
        [FieldOffset(0x6290)] public CreditItemInfo itemInfos__arr242;
        [FieldOffset(0x62F8)] public CreditItemInfo itemInfos__arr243;
        [FieldOffset(0x6360)] public CreditItemInfo itemInfos__arr244;
        [FieldOffset(0x63C8)] public CreditItemInfo itemInfos__arr245;
        [FieldOffset(0x6430)] public CreditItemInfo itemInfos__arr246;
        [FieldOffset(0x6498)] public CreditItemInfo itemInfos__arr247;
        [FieldOffset(0x6500)] public CreditItemInfo itemInfos__arr248;
        [FieldOffset(0x6568)] public CreditItemInfo itemInfos__arr249;
        [FieldOffset(0x65D0)] public CreditItemInfo itemInfos__arr250;
        [FieldOffset(0x6638)] public CreditItemInfo itemInfos__arr251;
        [FieldOffset(0x66A0)] public CreditItemInfo itemInfos__arr252;
        [FieldOffset(0x6708)] public CreditItemInfo itemInfos__arr253;
        [FieldOffset(0x6770)] public CreditItemInfo itemInfos__arr254;
        [FieldOffset(0x67D8)] public CreditItemInfo itemInfos__arr255;
        [FieldOffset(0x6840)] public CreditItemInfo itemInfos__arr256;
        [FieldOffset(0x68A8)] public CreditItemInfo itemInfos__arr257;
        [FieldOffset(0x6910)] public CreditItemInfo itemInfos__arr258;
        [FieldOffset(0x6978)] public CreditItemInfo itemInfos__arr259;
        [FieldOffset(0x69E0)] public CreditItemInfo itemInfos__arr260;
        [FieldOffset(0x6A48)] public CreditItemInfo itemInfos__arr261;
        [FieldOffset(0x6AB0)] public CreditItemInfo itemInfos__arr262;
        [FieldOffset(0x6B18)] public CreditItemInfo itemInfos__arr263;
        [FieldOffset(0x6B80)] public CreditItemInfo itemInfos__arr264;
        [FieldOffset(0x6BE8)] public CreditItemInfo itemInfos__arr265;
        [FieldOffset(0x6C50)] public CreditItemInfo itemInfos__arr266;
        [FieldOffset(0x6CB8)] public CreditItemInfo itemInfos__arr267;
        [FieldOffset(0x6D20)] public CreditItemInfo itemInfos__arr268;
        [FieldOffset(0x6D88)] public CreditItemInfo itemInfos__arr269;
        [FieldOffset(0x6DF0)] public CreditItemInfo itemInfos__arr270;
        [FieldOffset(0x6E58)] public CreditItemInfo itemInfos__arr271;
        [FieldOffset(0x6EC0)] public CreditItemInfo itemInfos__arr272;
        [FieldOffset(0x6F28)] public CreditItemInfo itemInfos__arr273;
        [FieldOffset(0x6F90)] public CreditItemInfo itemInfos__arr274;
        [FieldOffset(0x6FF8)] public CreditItemInfo itemInfos__arr275;
        [FieldOffset(0x7060)] public CreditItemInfo itemInfos__arr276;
        [FieldOffset(0x70C8)] public CreditItemInfo itemInfos__arr277;
        [FieldOffset(0x7130)] public CreditItemInfo itemInfos__arr278;
        [FieldOffset(0x7198)] public CreditItemInfo itemInfos__arr279;
        [FieldOffset(0x7200)] public CreditItemInfo itemInfos__arr280;
        [FieldOffset(0x7268)] public CreditItemInfo itemInfos__arr281;
        [FieldOffset(0x72D0)] public CreditItemInfo itemInfos__arr282;
        [FieldOffset(0x7338)] public CreditItemInfo itemInfos__arr283;
        [FieldOffset(0x73A0)] public CreditItemInfo itemInfos__arr284;
        [FieldOffset(0x7408)] public CreditItemInfo itemInfos__arr285;
        [FieldOffset(0x7470)] public CreditItemInfo itemInfos__arr286;
        [FieldOffset(0x74D8)] public CreditItemInfo itemInfos__arr287;
        [FieldOffset(0x7540)] public CreditItemInfo itemInfos__arr288;
        [FieldOffset(0x75A8)] public CreditItemInfo itemInfos__arr289;
        [FieldOffset(0x7610)] public CreditItemInfo itemInfos__arr290;
        [FieldOffset(0x7678)] public CreditItemInfo itemInfos__arr291;
        [FieldOffset(0x76E0)] public CreditItemInfo itemInfos__arr292;
        [FieldOffset(0x7748)] public CreditItemInfo itemInfos__arr293;
        [FieldOffset(0x77B0)] public CreditItemInfo itemInfos__arr294;
        [FieldOffset(0x7818)] public CreditItemInfo itemInfos__arr295;
        [FieldOffset(0x7880)] public CreditItemInfo itemInfos__arr296;
        [FieldOffset(0x78E8)] public CreditItemInfo itemInfos__arr297;
        [FieldOffset(0x7950)] public CreditItemInfo itemInfos__arr298;
        [FieldOffset(0x79B8)] public CreditItemInfo itemInfos__arr299;
        [FieldOffset(0x7A20)] public CreditItemInfo itemInfos__arr300;
        [FieldOffset(0x7A88)] public CreditItemInfo itemInfos__arr301;
        [FieldOffset(0x7AF0)] public CreditItemInfo itemInfos__arr302;
        [FieldOffset(0x7B58)] public CreditItemInfo itemInfos__arr303;
        [FieldOffset(0x7BC0)] public CreditItemInfo itemInfos__arr304;
        [FieldOffset(0x7C28)] public CreditItemInfo itemInfos__arr305;
        [FieldOffset(0x7C90)] public CreditItemInfo itemInfos__arr306;
        [FieldOffset(0x7CF8)] public CreditItemInfo itemInfos__arr307;
        [FieldOffset(0x7D60)] public CreditItemInfo itemInfos__arr308;
        [FieldOffset(0x7DC8)] public CreditItemInfo itemInfos__arr309;
        [FieldOffset(0x7E30)] public CreditItemInfo itemInfos__arr310;
        [FieldOffset(0x7E98)] public CreditItemInfo itemInfos__arr311;
        [FieldOffset(0x7F00)] public CreditItemInfo itemInfos__arr312;
        [FieldOffset(0x7F68)] public CreditItemInfo itemInfos__arr313;
        [FieldOffset(0x7FD0)] public CreditItemInfo itemInfos__arr314;
        [FieldOffset(0x8038)] public CreditItemInfo itemInfos__arr315;
        [FieldOffset(0x80A0)] public CreditItemInfo itemInfos__arr316;
        [FieldOffset(0x8108)] public CreditItemInfo itemInfos__arr317;
        [FieldOffset(0x8170)] public CreditItemInfo itemInfos__arr318;
        [FieldOffset(0x81D8)] public CreditItemInfo itemInfos__arr319;
        [FieldOffset(0x8240)] public CreditItemInfo itemInfos__arr320;
        [FieldOffset(0x82A8)] public CreditItemInfo itemInfos__arr321;
        [FieldOffset(0x8310)] public CreditItemInfo itemInfos__arr322;
        [FieldOffset(0x8378)] public CreditItemInfo itemInfos__arr323;
        [FieldOffset(0x83E0)] public CreditItemInfo itemInfos__arr324;
        [FieldOffset(0x8448)] public CreditItemInfo itemInfos__arr325;
        [FieldOffset(0x84B0)] public CreditItemInfo itemInfos__arr326;
        [FieldOffset(0x8518)] public CreditItemInfo itemInfos__arr327;
        [FieldOffset(0x8580)] public CreditItemInfo itemInfos__arr328;
        [FieldOffset(0x85E8)] public CreditItemInfo itemInfos__arr329;
        [FieldOffset(0x8650)] public CreditItemInfo itemInfos__arr330;
        [FieldOffset(0x86B8)] public CreditItemInfo itemInfos__arr331;
        [FieldOffset(0x8720)] public CreditItemInfo itemInfos__arr332;
        [FieldOffset(0x8788)] public CreditItemInfo itemInfos__arr333;
        [FieldOffset(0x87F0)] public CreditItemInfo itemInfos__arr334;
        [FieldOffset(0x8858)] public CreditItemInfo itemInfos__arr335;
        [FieldOffset(0x88C0)] public CreditItemInfo itemInfos__arr336;
        [FieldOffset(0x8928)] public CreditItemInfo itemInfos__arr337;
        [FieldOffset(0x8990)] public CreditItemInfo itemInfos__arr338;
        [FieldOffset(0x89F8)] public CreditItemInfo itemInfos__arr339;
        [FieldOffset(0x8A60)] public CreditItemInfo itemInfos__arr340;
        [FieldOffset(0x8AC8)] public CreditItemInfo itemInfos__arr341;
        [FieldOffset(0x8B30)] public CreditItemInfo itemInfos__arr342;
        [FieldOffset(0x8B98)] public CreditItemInfo itemInfos__arr343;
        [FieldOffset(0x8C00)] public CreditItemInfo itemInfos__arr344;
        [FieldOffset(0x8C68)] public CreditItemInfo itemInfos__arr345;
        [FieldOffset(0x8CD0)] public CreditItemInfo itemInfos__arr346;
        [FieldOffset(0x8D38)] public CreditItemInfo itemInfos__arr347;
        [FieldOffset(0x8DA0)] public CreditItemInfo itemInfos__arr348;
        [FieldOffset(0x8E08)] public CreditItemInfo itemInfos__arr349;
        [FieldOffset(0x8E70)] public CreditItemInfo itemInfos__arr350;
        [FieldOffset(0x8ED8)] public CreditItemInfo itemInfos__arr351;
        [FieldOffset(0x8F40)] public CreditItemInfo itemInfos__arr352;
        [FieldOffset(0x8FA8)] public CreditItemInfo itemInfos__arr353;
        [FieldOffset(0x9010)] public CreditItemInfo itemInfos__arr354;
        [FieldOffset(0x9078)] public CreditItemInfo itemInfos__arr355;
        [FieldOffset(0x90E0)] public CreditItemInfo itemInfos__arr356;
        [FieldOffset(0x9148)] public CreditItemInfo itemInfos__arr357;
        [FieldOffset(0x91B0)] public CreditItemInfo itemInfos__arr358;
        [FieldOffset(0x9218)] public CreditItemInfo itemInfos__arr359;
        [FieldOffset(0x9280)] public CreditItemInfo itemInfos__arr360;
        [FieldOffset(0x92E8)] public CreditItemInfo itemInfos__arr361;
        [FieldOffset(0x9350)] public CreditItemInfo itemInfos__arr362;
        [FieldOffset(0x93B8)] public CreditItemInfo itemInfos__arr363;
        [FieldOffset(0x9420)] public CreditItemInfo itemInfos__arr364;
        [FieldOffset(0x9488)] public CreditItemInfo itemInfos__arr365;
        [FieldOffset(0x94F0)] public CreditItemInfo itemInfos__arr366;
        [FieldOffset(0x9558)] public CreditItemInfo itemInfos__arr367;
        [FieldOffset(0x95C0)] public CreditItemInfo itemInfos__arr368;
        [FieldOffset(0x9628)] public CreditItemInfo itemInfos__arr369;
        [FieldOffset(0x9690)] public CreditItemInfo itemInfos__arr370;
        [FieldOffset(0x96F8)] public CreditItemInfo itemInfos__arr371;
        [FieldOffset(0x9760)] public CreditItemInfo itemInfos__arr372;
        [FieldOffset(0x97C8)] public CreditItemInfo itemInfos__arr373;
        [FieldOffset(0x9830)] public CreditItemInfo itemInfos__arr374;
        [FieldOffset(0x9898)] public CreditItemInfo itemInfos__arr375;
        [FieldOffset(0x9900)] public CreditItemInfo itemInfos__arr376;
        [FieldOffset(0x9968)] public CreditItemInfo itemInfos__arr377;
        [FieldOffset(0x99D0)] public CreditItemInfo itemInfos__arr378;
        [FieldOffset(0x9A38)] public CreditItemInfo itemInfos__arr379;
        [FieldOffset(0x9AA0)] public CreditItemInfo itemInfos__arr380;
        [FieldOffset(0x9B08)] public CreditItemInfo itemInfos__arr381;
        [FieldOffset(0x9B70)] public CreditItemInfo itemInfos__arr382;
        [FieldOffset(0x9BD8)] public CreditItemInfo itemInfos__arr383;
        [FieldOffset(0x9C40)] public CreditItemInfo itemInfos__arr384;
        [FieldOffset(0x9CA8)] public CreditItemInfo itemInfos__arr385;
        [FieldOffset(0x9D10)] public CreditItemInfo itemInfos__arr386;
        [FieldOffset(0x9D78)] public CreditItemInfo itemInfos__arr387;
        [FieldOffset(0x9DE0)] public CreditItemInfo itemInfos__arr388;
        [FieldOffset(0x9E48)] public CreditItemInfo itemInfos__arr389;
        [FieldOffset(0x9EB0)] public CreditItemInfo itemInfos__arr390;
        [FieldOffset(0x9F18)] public CreditItemInfo itemInfos__arr391;
        [FieldOffset(0x9F80)] public CreditItemInfo itemInfos__arr392;
        [FieldOffset(0x9FE8)] public CreditItemInfo itemInfos__arr393;
        [FieldOffset(0xA050)] public CreditItemInfo itemInfos__arr394;
        [FieldOffset(0xA0B8)] public CreditItemInfo itemInfos__arr395;
        [FieldOffset(0xA120)] public CreditItemInfo itemInfos__arr396;
        [FieldOffset(0xA188)] public CreditItemInfo itemInfos__arr397;
        [FieldOffset(0xA1F0)] public CreditItemInfo itemInfos__arr398;
        [FieldOffset(0xA258)] public CreditItemInfo itemInfos__arr399;
        [FieldOffset(0xA2C0)] public CreditItemInfo itemInfos__arr400;
        [FieldOffset(0xA328)] public CreditItemInfo itemInfos__arr401;
        [FieldOffset(0xA390)] public CreditItemInfo itemInfos__arr402;
        [FieldOffset(0xA3F8)] public CreditItemInfo itemInfos__arr403;
        [FieldOffset(0xA460)] public CreditItemInfo itemInfos__arr404;
        [FieldOffset(0xA4C8)] public CreditItemInfo itemInfos__arr405;
        [FieldOffset(0xA530)] public CreditItemInfo itemInfos__arr406;
        [FieldOffset(0xA598)] public CreditItemInfo itemInfos__arr407;
        [FieldOffset(0xA600)] public CreditItemInfo itemInfos__arr408;
        [FieldOffset(0xA668)] public CreditItemInfo itemInfos__arr409;
        [FieldOffset(0xA6D0)] public CreditItemInfo itemInfos__arr410;
        [FieldOffset(0xA738)] public CreditItemInfo itemInfos__arr411;
        [FieldOffset(0xA7A0)] public CreditItemInfo itemInfos__arr412;
        [FieldOffset(0xA808)] public CreditItemInfo itemInfos__arr413;
        [FieldOffset(0xA870)] public CreditItemInfo itemInfos__arr414;
        [FieldOffset(0xA8D8)] public CreditItemInfo itemInfos__arr415;
        [FieldOffset(0xA940)] public CreditItemInfo itemInfos__arr416;
        [FieldOffset(0xA9A8)] public CreditItemInfo itemInfos__arr417;
        [FieldOffset(0xAA10)] public CreditItemInfo itemInfos__arr418;
        [FieldOffset(0xAA78)] public CreditItemInfo itemInfos__arr419;
        [FieldOffset(0xAAE0)] public CreditItemInfo itemInfos__arr420;
        [FieldOffset(0xAB48)] public CreditItemInfo itemInfos__arr421;
        [FieldOffset(0xABB0)] public CreditItemInfo itemInfos__arr422;
        [FieldOffset(0xAC18)] public CreditItemInfo itemInfos__arr423;
        [FieldOffset(0xAC80)] public CreditItemInfo itemInfos__arr424;
        [FieldOffset(0xACE8)] public CreditItemInfo itemInfos__arr425;
        [FieldOffset(0xAD50)] public CreditItemInfo itemInfos__arr426;
        [FieldOffset(0xADB8)] public CreditItemInfo itemInfos__arr427;
        [FieldOffset(0xAE20)] public CreditItemInfo itemInfos__arr428;
        [FieldOffset(0xAE88)] public CreditItemInfo itemInfos__arr429;
        [FieldOffset(0xAEF0)] public CreditItemInfo itemInfos__arr430;
        [FieldOffset(0xAF58)] public CreditItemInfo itemInfos__arr431;
        [FieldOffset(0xAFC0)] public CreditItemInfo itemInfos__arr432;
        [FieldOffset(0xB028)] public CreditItemInfo itemInfos__arr433;
        [FieldOffset(0xB090)] public CreditItemInfo itemInfos__arr434;
        [FieldOffset(0xB0F8)] public CreditItemInfo itemInfos__arr435;
        [FieldOffset(0xB160)] public CreditItemInfo itemInfos__arr436;
        [FieldOffset(0xB1C8)] public CreditItemInfo itemInfos__arr437;
        [FieldOffset(0xB230)] public CreditItemInfo itemInfos__arr438;
        [FieldOffset(0xB298)] public CreditItemInfo itemInfos__arr439;
        [FieldOffset(0xB300)] public CreditItemInfo itemInfos__arr440;
        [FieldOffset(0xB368)] public CreditItemInfo itemInfos__arr441;
        [FieldOffset(0xB3D0)] public CreditItemInfo itemInfos__arr442;
        [FieldOffset(0xB438)] public CreditItemInfo itemInfos__arr443;
        [FieldOffset(0xB4A0)] public CreditItemInfo itemInfos__arr444;
        [FieldOffset(0xB508)] public CreditItemInfo itemInfos__arr445;
        [FieldOffset(0xB570)] public CreditItemInfo itemInfos__arr446;
        [FieldOffset(0xB5D8)] public CreditItemInfo itemInfos__arr447;
        [FieldOffset(0xB640)] public CreditItemInfo itemInfos__arr448;
        [FieldOffset(0xB6A8)] public CreditItemInfo itemInfos__arr449;
        [FieldOffset(0xB710)] public CreditItemInfo itemInfos__arr450;
        [FieldOffset(0xB778)] public CreditItemInfo itemInfos__arr451;
        [FieldOffset(0xB7E0)] public CreditItemInfo itemInfos__arr452;
        [FieldOffset(0xB848)] public CreditItemInfo itemInfos__arr453;
        [FieldOffset(0xB8B0)] public CreditItemInfo itemInfos__arr454;
        [FieldOffset(0xB918)] public CreditItemInfo itemInfos__arr455;
        [FieldOffset(0xB980)] public CreditItemInfo itemInfos__arr456;
        [FieldOffset(0xB9E8)] public CreditItemInfo itemInfos__arr457;
        [FieldOffset(0xBA50)] public CreditItemInfo itemInfos__arr458;
        [FieldOffset(0xBAB8)] public CreditItemInfo itemInfos__arr459;
        [FieldOffset(0xBB20)] public CreditItemInfo itemInfos__arr460;
        [FieldOffset(0xBB88)] public CreditItemInfo itemInfos__arr461;
        [FieldOffset(0xBBF0)] public CreditItemInfo itemInfos__arr462;
        [FieldOffset(0xBC58)] public CreditItemInfo itemInfos__arr463;
        [FieldOffset(0xBCC0)] public CreditItemInfo itemInfos__arr464;
        [FieldOffset(0xBD28)] public CreditItemInfo itemInfos__arr465;
        [FieldOffset(0xBD90)] public CreditItemInfo itemInfos__arr466;
        [FieldOffset(0xBDF8)] public CreditItemInfo itemInfos__arr467;
        [FieldOffset(0xBE60)] public CreditItemInfo itemInfos__arr468;
        [FieldOffset(0xBEC8)] public CreditItemInfo itemInfos__arr469;
        [FieldOffset(0xBF30)] public CreditItemInfo itemInfos__arr470;
        [FieldOffset(0xBF98)] public CreditItemInfo itemInfos__arr471;
        [FieldOffset(0xC000)] public CreditItemInfo itemInfos__arr472;
        [FieldOffset(0xC068)] public CreditItemInfo itemInfos__arr473;
        [FieldOffset(0xC0D0)] public CreditItemInfo itemInfos__arr474;
        [FieldOffset(0xC138)] public CreditItemInfo itemInfos__arr475;
        [FieldOffset(0xC1A0)] public CreditItemInfo itemInfos__arr476;
        [FieldOffset(0xC208)] public CreditItemInfo itemInfos__arr477;
        [FieldOffset(0xC270)] public CreditItemInfo itemInfos__arr478;
        [FieldOffset(0xC2D8)] public CreditItemInfo itemInfos__arr479;
        [FieldOffset(0xC340)] public CreditItemInfo itemInfos__arr480;
        [FieldOffset(0xC3A8)] public CreditItemInfo itemInfos__arr481;
        [FieldOffset(0xC410)] public CreditItemInfo itemInfos__arr482;
        [FieldOffset(0xC478)] public CreditItemInfo itemInfos__arr483;
        [FieldOffset(0xC4E0)] public CreditItemInfo itemInfos__arr484;
        [FieldOffset(0xC548)] public CreditItemInfo itemInfos__arr485;
        [FieldOffset(0xC5B0)] public CreditItemInfo itemInfos__arr486;
        [FieldOffset(0xC618)] public CreditItemInfo itemInfos__arr487;
        [FieldOffset(0xC680)] public CreditItemInfo itemInfos__arr488;
        [FieldOffset(0xC6E8)] public CreditItemInfo itemInfos__arr489;
        [FieldOffset(0xC750)] public CreditItemInfo itemInfos__arr490;
        [FieldOffset(0xC7B8)] public CreditItemInfo itemInfos__arr491;
        [FieldOffset(0xC820)] public CreditItemInfo itemInfos__arr492;
        [FieldOffset(0xC888)] public CreditItemInfo itemInfos__arr493;
        [FieldOffset(0xC8F0)] public CreditItemInfo itemInfos__arr494;
        [FieldOffset(0xC958)] public CreditItemInfo itemInfos__arr495;
        [FieldOffset(0xC9C0)] public CreditItemInfo itemInfos__arr496;
        [FieldOffset(0xCA28)] public CreditItemInfo itemInfos__arr497;
        [FieldOffset(0xCA90)] public CreditItemInfo itemInfos__arr498;
        [FieldOffset(0xCAF8)] public CreditItemInfo itemInfos__arr499;
        [FieldOffset(0xCB60)] public CreditItemInfo itemInfos__arr500;
        [FieldOffset(0xCBC8)] public CreditItemInfo itemInfos__arr501;
        [FieldOffset(0xCC30)] public CreditItemInfo itemInfos__arr502;
        [FieldOffset(0xCC98)] public CreditItemInfo itemInfos__arr503;
        [FieldOffset(0xCD00)] public CreditItemInfo itemInfos__arr504;
        [FieldOffset(0xCD68)] public CreditItemInfo itemInfos__arr505;
        [FieldOffset(0xCDD0)] public CreditItemInfo itemInfos__arr506;
        [FieldOffset(0xCE38)] public CreditItemInfo itemInfos__arr507;
        [FieldOffset(0xCEA0)] public CreditItemInfo itemInfos__arr508;
        [FieldOffset(0xCF08)] public CreditItemInfo itemInfos__arr509;
        [FieldOffset(0xCF70)] public CreditItemInfo itemInfos__arr510;
        [FieldOffset(0xCFD8)] public CreditItemInfo itemInfos__arr511;
        [FieldOffset(0xD040)] public CreditItemInfo itemInfos__arr512;
        [FieldOffset(0xD0A8)] public CreditItemInfo itemInfos__arr513;
        [FieldOffset(0xD110)] public CreditItemInfo itemInfos__arr514;
        [FieldOffset(0xD178)] public CreditItemInfo itemInfos__arr515;
        [FieldOffset(0xD1E0)] public CreditItemInfo itemInfos__arr516;
        [FieldOffset(0xD248)] public CreditItemInfo itemInfos__arr517;
        [FieldOffset(0xD2B0)] public CreditItemInfo itemInfos__arr518;
        [FieldOffset(0xD318)] public CreditItemInfo itemInfos__arr519;
        [FieldOffset(0xD380)] public CreditItemInfo itemInfos__arr520;
        [FieldOffset(0xD3E8)] public CreditItemInfo itemInfos__arr521;
        [FieldOffset(0xD450)] public CreditItemInfo itemInfos__arr522;
        [FieldOffset(0xD4B8)] public CreditItemInfo itemInfos__arr523;
        [FieldOffset(0xD520)] public CreditItemInfo itemInfos__arr524;
        [FieldOffset(0xD588)] public CreditItemInfo itemInfos__arr525;
        [FieldOffset(0xD5F0)] public CreditItemInfo itemInfos__arr526;
        [FieldOffset(0xD658)] public CreditItemInfo itemInfos__arr527;
        [FieldOffset(0xD6C0)] public CreditItemInfo itemInfos__arr528;
        [FieldOffset(0xD728)] public CreditItemInfo itemInfos__arr529;
        [FieldOffset(0xD790)] public CreditItemInfo itemInfos__arr530;
        [FieldOffset(0xD7F8)] public CreditItemInfo itemInfos__arr531;
        [FieldOffset(0xD860)] public CreditItemInfo itemInfos__arr532;
        [FieldOffset(0xD8C8)] public CreditItemInfo itemInfos__arr533;
        [FieldOffset(0xD930)] public CreditItemInfo itemInfos__arr534;
        [FieldOffset(0xD998)] public CreditItemInfo itemInfos__arr535;
        [FieldOffset(0xDA00)] public CreditItemInfo itemInfos__arr536;
        [FieldOffset(0xDA68)] public CreditItemInfo itemInfos__arr537;
        [FieldOffset(0xDAD0)] public CreditItemInfo itemInfos__arr538;
        [FieldOffset(0xDB38)] public CreditItemInfo itemInfos__arr539;
        [FieldOffset(0xDBA0)] public CreditItemInfo itemInfos__arr540;
        [FieldOffset(0xDC08)] public CreditItemInfo itemInfos__arr541;
        [FieldOffset(0xDC70)] public CreditItemInfo itemInfos__arr542;
        [FieldOffset(0xDCD8)] public CreditItemInfo itemInfos__arr543;
        [FieldOffset(0xDD40)] public CreditItemInfo itemInfos__arr544;
        [FieldOffset(0xDDA8)] public CreditItemInfo itemInfos__arr545;
        [FieldOffset(0xDE10)] public CreditItemInfo itemInfos__arr546;
        [FieldOffset(0xDE78)] public CreditItemInfo itemInfos__arr547;
        [FieldOffset(0xDEE0)] public CreditItemInfo itemInfos__arr548;
        [FieldOffset(0xDF48)] public CreditItemInfo itemInfos__arr549;
        [FieldOffset(0xDFB0)] public CreditItemInfo itemInfos__arr550;
        [FieldOffset(0xE018)] public CreditItemInfo itemInfos__arr551;
        [FieldOffset(0xE080)] public CreditItemInfo itemInfos__arr552;
        [FieldOffset(0xE0E8)] public CreditItemInfo itemInfos__arr553;
        [FieldOffset(0xE150)] public CreditItemInfo itemInfos__arr554;
        [FieldOffset(0xE1B8)] public CreditItemInfo itemInfos__arr555;
        [FieldOffset(0xE220)] public CreditItemInfo itemInfos__arr556;
        [FieldOffset(0xE288)] public CreditItemInfo itemInfos__arr557;
        [FieldOffset(0xE2F0)] public CreditItemInfo itemInfos__arr558;
        [FieldOffset(0xE358)] public CreditItemInfo itemInfos__arr559;
        [FieldOffset(0xE3C0)] public CreditItemInfo itemInfos__arr560;
        [FieldOffset(0xE428)] public CreditItemInfo itemInfos__arr561;
        [FieldOffset(0xE490)] public CreditItemInfo itemInfos__arr562;
        [FieldOffset(0xE4F8)] public CreditItemInfo itemInfos__arr563;
        [FieldOffset(0xE560)] public CreditItemInfo itemInfos__arr564;
        [FieldOffset(0xE5C8)] public CreditItemInfo itemInfos__arr565;
        [FieldOffset(0xE630)] public CreditItemInfo itemInfos__arr566;
        [FieldOffset(0xE698)] public CreditItemInfo itemInfos__arr567;
        [FieldOffset(0xE700)] public CreditItemInfo itemInfos__arr568;
        [FieldOffset(0xE768)] public CreditItemInfo itemInfos__arr569;
        [FieldOffset(0xE7D0)] public CreditItemInfo itemInfos__arr570;
        [FieldOffset(0xE838)] public CreditItemInfo itemInfos__arr571;
        [FieldOffset(0xE8A0)] public CreditItemInfo itemInfos__arr572;
        [FieldOffset(0xE908)] public CreditItemInfo itemInfos__arr573;
        [FieldOffset(0xE970)] public CreditItemInfo itemInfos__arr574;
        [FieldOffset(0xE9D8)] public CreditItemInfo itemInfos__arr575;
        [FieldOffset(0xEA40)] public CreditItemInfo itemInfos__arr576;
        [FieldOffset(0xEAA8)] public CreditItemInfo itemInfos__arr577;
        [FieldOffset(0xEB10)] public CreditItemInfo itemInfos__arr578;
        [FieldOffset(0xEB78)] public CreditItemInfo itemInfos__arr579;
        [FieldOffset(0xEBE0)] public CreditItemInfo itemInfos__arr580;
        [FieldOffset(0xEC48)] public CreditItemInfo itemInfos__arr581;
        [FieldOffset(0xECB0)] public CreditItemInfo itemInfos__arr582;
        [FieldOffset(0xED18)] public CreditItemInfo itemInfos__arr583;
        [FieldOffset(0xED80)] public CreditItemInfo itemInfos__arr584;
        [FieldOffset(0xEDE8)] public CreditItemInfo itemInfos__arr585;
        [FieldOffset(0xEE50)] public CreditItemInfo itemInfos__arr586;
        [FieldOffset(0xEEB8)] public CreditItemInfo itemInfos__arr587;
        [FieldOffset(0xEF20)] public CreditItemInfo itemInfos__arr588;
        [FieldOffset(0xEF88)] public CreditItemInfo itemInfos__arr589;
        [FieldOffset(0xEFF0)] public CreditItemInfo itemInfos__arr590;
        [FieldOffset(0xF058)] public CreditItemInfo itemInfos__arr591;
        [FieldOffset(0xF0C0)] public CreditItemInfo itemInfos__arr592;
        [FieldOffset(0xF128)] public CreditItemInfo itemInfos__arr593;
        [FieldOffset(0xF190)] public CreditItemInfo itemInfos__arr594;
        [FieldOffset(0xF1F8)] public CreditItemInfo itemInfos__arr595;
        [FieldOffset(0xF260)] public CreditItemInfo itemInfos__arr596;
        [FieldOffset(0xF2C8)] public CreditItemInfo itemInfos__arr597;
        [FieldOffset(0xF330)] public CreditItemInfo itemInfos__arr598;
        [FieldOffset(0xF398)] public CreditItemInfo itemInfos__arr599;
        [FieldOffset(0xF400)] public CreditItemInfo itemInfos__arr600;
        [FieldOffset(0xF468)] public CreditItemInfo itemInfos__arr601;
        [FieldOffset(0xF4D0)] public CreditItemInfo itemInfos__arr602;
        [FieldOffset(0xF538)] public CreditItemInfo itemInfos__arr603;
        [FieldOffset(0xF5A0)] public CreditItemInfo itemInfos__arr604;
        [FieldOffset(0xF608)] public CreditItemInfo itemInfos__arr605;
        [FieldOffset(0xF670)] public CreditItemInfo itemInfos__arr606;
        [FieldOffset(0xF6D8)] public CreditItemInfo itemInfos__arr607;
        [FieldOffset(0xF740)] public CreditItemInfo itemInfos__arr608;
        [FieldOffset(0xF7A8)] public CreditItemInfo itemInfos__arr609;
        [FieldOffset(0xF810)] public CreditItemInfo itemInfos__arr610;
        [FieldOffset(0xF878)] public CreditItemInfo itemInfos__arr611;
        [FieldOffset(0xF8E0)] public CreditItemInfo itemInfos__arr612;
        [FieldOffset(0xF948)] public CreditItemInfo itemInfos__arr613;
        [FieldOffset(0xF9B0)] public CreditItemInfo itemInfos__arr614;
        [FieldOffset(0xFA18)] public CreditItemInfo itemInfos__arr615;
        [FieldOffset(0xFA80)] public CreditItemInfo itemInfos__arr616;
        [FieldOffset(0xFAE8)] public CreditItemInfo itemInfos__arr617;
        [FieldOffset(0xFB50)] public CreditItemInfo itemInfos__arr618;
        [FieldOffset(0xFBB8)] public CreditItemInfo itemInfos__arr619;
        [FieldOffset(0xFC20)] public CreditItemInfo itemInfos__arr620;
        [FieldOffset(0xFC88)] public CreditItemInfo itemInfos__arr621;
        [FieldOffset(0xFCF0)] public CreditItemInfo itemInfos__arr622;
        [FieldOffset(0xFD58)] public CreditItemInfo itemInfos__arr623;
        [FieldOffset(0xFDC0)] public CreditItemInfo itemInfos__arr624;
        [FieldOffset(0xFE28)] public CreditItemInfo itemInfos__arr625;
        [FieldOffset(0xFE90)] public CreditItemInfo itemInfos__arr626;
        [FieldOffset(0xFEF8)] public CreditItemInfo itemInfos__arr627;
        [FieldOffset(0xFF60)] public CreditItemInfo itemInfos__arr628;
        [FieldOffset(0xFFC8)] public CreditItemInfo itemInfos__arr629;
        [FieldOffset(0x10030)] public CreditItemInfo itemInfos__arr630;
        [FieldOffset(0x10098)] public CreditItemInfo itemInfos__arr631;
        [FieldOffset(0x10100)] public CreditItemInfo itemInfos__arr632;
        [FieldOffset(0x10168)] public CreditItemInfo itemInfos__arr633;
        [FieldOffset(0x101D0)] public CreditItemInfo itemInfos__arr634;
        [FieldOffset(0x10238)] public CreditItemInfo itemInfos__arr635;
        [FieldOffset(0x102A0)] public CreditItemInfo itemInfos__arr636;
        [FieldOffset(0x10308)] public CreditItemInfo itemInfos__arr637;
        [FieldOffset(0x10370)] public CreditItemInfo itemInfos__arr638;
        [FieldOffset(0x103D8)] public CreditItemInfo itemInfos__arr639;
        [FieldOffset(0x10440)] public CreditItemInfo itemInfos__arr640;
        [FieldOffset(0x104A8)] public CreditItemInfo itemInfos__arr641;
        [FieldOffset(0x10510)] public CreditItemInfo itemInfos__arr642;
        [FieldOffset(0x10578)] public CreditItemInfo itemInfos__arr643;
        [FieldOffset(0x105E0)] public CreditItemInfo itemInfos__arr644;
        [FieldOffset(0x10648)] public CreditItemInfo itemInfos__arr645;
        [FieldOffset(0x106B0)] public CreditItemInfo itemInfos__arr646;
        [FieldOffset(0x10718)] public CreditItemInfo itemInfos__arr647;
        [FieldOffset(0x10780)] public CreditItemInfo itemInfos__arr648;
        [FieldOffset(0x107E8)] public CreditItemInfo itemInfos__arr649;
        [FieldOffset(0x10850)] public CreditItemInfo itemInfos__arr650;
        [FieldOffset(0x108B8)] public CreditItemInfo itemInfos__arr651;
        [FieldOffset(0x10920)] public CreditItemInfo itemInfos__arr652;
        [FieldOffset(0x10988)] public CreditItemInfo itemInfos__arr653;
        [FieldOffset(0x109F0)] public CreditItemInfo itemInfos__arr654;
        [FieldOffset(0x10A58)] public CreditItemInfo itemInfos__arr655;
        [FieldOffset(0x10AC0)] public CreditItemInfo itemInfos__arr656;
        [FieldOffset(0x10B28)] public CreditItemInfo itemInfos__arr657;
        [FieldOffset(0x10B90)] public CreditItemInfo itemInfos__arr658;
        [FieldOffset(0x10BF8)] public CreditItemInfo itemInfos__arr659;
        [FieldOffset(0x10C60)] public CreditItemInfo itemInfos__arr660;
        [FieldOffset(0x10CC8)] public CreditItemInfo itemInfos__arr661;
        [FieldOffset(0x10D30)] public CreditItemInfo itemInfos__arr662;
        [FieldOffset(0x10D98)] public CreditItemInfo itemInfos__arr663;
        [FieldOffset(0x10E00)] public CreditItemInfo itemInfos__arr664;
        [FieldOffset(0x10E68)] public CreditItemInfo itemInfos__arr665;
        [FieldOffset(0x10ED0)] public CreditItemInfo itemInfos__arr666;
        [FieldOffset(0x10F38)] public CreditItemInfo itemInfos__arr667;
        [FieldOffset(0x10FA0)] public CreditItemInfo itemInfos__arr668;
        [FieldOffset(0x11008)] public CreditItemInfo itemInfos__arr669;
        [FieldOffset(0x11070)] public CreditItemInfo itemInfos__arr670;
        [FieldOffset(0x110D8)] public CreditItemInfo itemInfos__arr671;
        [FieldOffset(0x11140)] public CreditItemInfo itemInfos__arr672;
        [FieldOffset(0x111A8)] public CreditItemInfo itemInfos__arr673;
        [FieldOffset(0x11210)] public CreditItemInfo itemInfos__arr674;
        [FieldOffset(0x11278)] public CreditItemInfo itemInfos__arr675;
        [FieldOffset(0x112E0)] public CreditItemInfo itemInfos__arr676;
        [FieldOffset(0x11348)] public CreditItemInfo itemInfos__arr677;
        [FieldOffset(0x113B0)] public CreditItemInfo itemInfos__arr678;
        [FieldOffset(0x11418)] public CreditItemInfo itemInfos__arr679;
        [FieldOffset(0x11480)] public CreditItemInfo itemInfos__arr680;
        [FieldOffset(0x114E8)] public CreditItemInfo itemInfos__arr681;
        [FieldOffset(0x11550)] public CreditItemInfo itemInfos__arr682;
        [FieldOffset(0x115B8)] public CreditItemInfo itemInfos__arr683;
        [FieldOffset(0x11620)] public CreditItemInfo itemInfos__arr684;
        [FieldOffset(0x11688)] public CreditItemInfo itemInfos__arr685;
        [FieldOffset(0x116F0)] public CreditItemInfo itemInfos__arr686;
        [FieldOffset(0x11758)] public CreditItemInfo itemInfos__arr687;
        [FieldOffset(0x117C0)] public CreditItemInfo itemInfos__arr688;
        [FieldOffset(0x11828)] public CreditItemInfo itemInfos__arr689;
        [FieldOffset(0x11890)] public CreditItemInfo itemInfos__arr690;
        [FieldOffset(0x118F8)] public CreditItemInfo itemInfos__arr691;
        [FieldOffset(0x11960)] public CreditItemInfo itemInfos__arr692;
        [FieldOffset(0x119C8)] public CreditItemInfo itemInfos__arr693;
        [FieldOffset(0x11A30)] public CreditItemInfo itemInfos__arr694;
        [FieldOffset(0x11A98)] public CreditItemInfo itemInfos__arr695;
        [FieldOffset(0x11B00)] public CreditItemInfo itemInfos__arr696;
        [FieldOffset(0x11B68)] public CreditItemInfo itemInfos__arr697;
        [FieldOffset(0x11BD0)] public CreditItemInfo itemInfos__arr698;
        [FieldOffset(0x11C38)] public CreditItemInfo itemInfos__arr699;
        [FieldOffset(0x11CA0)] public CreditItemInfo itemInfos__arr700;
        [FieldOffset(0x11D08)] public CreditItemInfo itemInfos__arr701;
        [FieldOffset(0x11D70)] public CreditItemInfo itemInfos__arr702;
        [FieldOffset(0x11DD8)] public CreditItemInfo itemInfos__arr703;
        [FieldOffset(0x11E40)] public CreditItemInfo itemInfos__arr704;
        [FieldOffset(0x11EA8)] public CreditItemInfo itemInfos__arr705;
        [FieldOffset(0x11F10)] public CreditItemInfo itemInfos__arr706;
        [FieldOffset(0x11F78)] public CreditItemInfo itemInfos__arr707;
        [FieldOffset(0x11FE0)] public CreditItemInfo itemInfos__arr708;
        [FieldOffset(0x12048)] public CreditItemInfo itemInfos__arr709;
        [FieldOffset(0x120B0)] public CreditItemInfo itemInfos__arr710;
        [FieldOffset(0x12118)] public CreditItemInfo itemInfos__arr711;
        [FieldOffset(0x12180)] public CreditItemInfo itemInfos__arr712;
        [FieldOffset(0x121E8)] public CreditItemInfo itemInfos__arr713;
        [FieldOffset(0x12250)] public CreditItemInfo itemInfos__arr714;
        [FieldOffset(0x122B8)] public CreditItemInfo itemInfos__arr715;
        [FieldOffset(0x12320)] public CreditItemInfo itemInfos__arr716;
        [FieldOffset(0x12388)] public CreditItemInfo itemInfos__arr717;
        [FieldOffset(0x123F0)] public CreditItemInfo itemInfos__arr718;
        [FieldOffset(0x12458)] public CreditItemInfo itemInfos__arr719;
        [FieldOffset(0x124C0)] public CreditItemInfo itemInfos__arr720;
        [FieldOffset(0x12528)] public CreditItemInfo itemInfos__arr721;
        [FieldOffset(0x12590)] public CreditItemInfo itemInfos__arr722;
        [FieldOffset(0x125F8)] public CreditItemInfo itemInfos__arr723;
        [FieldOffset(0x12660)] public CreditItemInfo itemInfos__arr724;
        [FieldOffset(0x126C8)] public CreditItemInfo itemInfos__arr725;
        [FieldOffset(0x12730)] public CreditItemInfo itemInfos__arr726;
        [FieldOffset(0x12798)] public CreditItemInfo itemInfos__arr727;
        [FieldOffset(0x12800)] public CreditItemInfo itemInfos__arr728;
        [FieldOffset(0x12868)] public CreditItemInfo itemInfos__arr729;
        [FieldOffset(0x128D0)] public CreditItemInfo itemInfos__arr730;
        [FieldOffset(0x12938)] public CreditItemInfo itemInfos__arr731;
        [FieldOffset(0x129A0)] public CreditItemInfo itemInfos__arr732;
        [FieldOffset(0x12A08)] public CreditItemInfo itemInfos__arr733;
        [FieldOffset(0x12A70)] public CreditItemInfo itemInfos__arr734;
        [FieldOffset(0x12AD8)] public CreditItemInfo itemInfos__arr735;
        [FieldOffset(0x12B40)] public CreditItemInfo itemInfos__arr736;
        [FieldOffset(0x12BA8)] public CreditItemInfo itemInfos__arr737;
        [FieldOffset(0x12C10)] public CreditItemInfo itemInfos__arr738;
        [FieldOffset(0x12C78)] public CreditItemInfo itemInfos__arr739;
        [FieldOffset(0x12CE0)] public CreditItemInfo itemInfos__arr740;
        [FieldOffset(0x12D48)] public CreditItemInfo itemInfos__arr741;
        [FieldOffset(0x12DB0)] public CreditItemInfo itemInfos__arr742;
        [FieldOffset(0x12E18)] public CreditItemInfo itemInfos__arr743;
        [FieldOffset(0x12E80)] public CreditItemInfo itemInfos__arr744;
        [FieldOffset(0x12EE8)] public CreditItemInfo itemInfos__arr745;
        [FieldOffset(0x12F50)] public CreditItemInfo itemInfos__arr746;
        [FieldOffset(0x12FB8)] public CreditItemInfo itemInfos__arr747;
        [FieldOffset(0x13020)] public CreditItemInfo itemInfos__arr748;
        [FieldOffset(0x13088)] public CreditItemInfo itemInfos__arr749;
        [FieldOffset(0x130F0)] public CreditItemInfo itemInfos__arr750;
        [FieldOffset(0x13158)] public CreditItemInfo itemInfos__arr751;
        [FieldOffset(0x131C0)] public CreditItemInfo itemInfos__arr752;
        [FieldOffset(0x13228)] public CreditItemInfo itemInfos__arr753;
        [FieldOffset(0x13290)] public CreditItemInfo itemInfos__arr754;
        [FieldOffset(0x132F8)] public CreditItemInfo itemInfos__arr755;
        [FieldOffset(0x13360)] public CreditItemInfo itemInfos__arr756;
        [FieldOffset(0x133C8)] public CreditItemInfo itemInfos__arr757;
        [FieldOffset(0x13430)] public CreditItemInfo itemInfos__arr758;
        [FieldOffset(0x13498)] public CreditItemInfo itemInfos__arr759;
        [FieldOffset(0x13500)] public CreditItemInfo itemInfos__arr760;
        [FieldOffset(0x13568)] public CreditItemInfo itemInfos__arr761;
        [FieldOffset(0x135D0)] public CreditItemInfo itemInfos__arr762;
        [FieldOffset(0x13638)] public CreditItemInfo itemInfos__arr763;
        [FieldOffset(0x136A0)] public CreditItemInfo itemInfos__arr764;
        [FieldOffset(0x13708)] public CreditItemInfo itemInfos__arr765;
        [FieldOffset(0x13770)] public CreditItemInfo itemInfos__arr766;
        [FieldOffset(0x137D8)] public CreditItemInfo itemInfos__arr767;
        [FieldOffset(0x13840)] public CreditItemInfo itemInfos__arr768;
        [FieldOffset(0x138A8)] public CreditItemInfo itemInfos__arr769;
        [FieldOffset(0x13910)] public CreditItemInfo itemInfos__arr770;
        [FieldOffset(0x13978)] public CreditItemInfo itemInfos__arr771;
        [FieldOffset(0x139E0)] public CreditItemInfo itemInfos__arr772;
        [FieldOffset(0x13A48)] public CreditItemInfo itemInfos__arr773;
        [FieldOffset(0x13AB0)] public CreditItemInfo itemInfos__arr774;
        [FieldOffset(0x13B18)] public CreditItemInfo itemInfos__arr775;
        [FieldOffset(0x13B80)] public CreditItemInfo itemInfos__arr776;
        [FieldOffset(0x13BE8)] public CreditItemInfo itemInfos__arr777;
        [FieldOffset(0x13C50)] public CreditItemInfo itemInfos__arr778;
        [FieldOffset(0x13CB8)] public CreditItemInfo itemInfos__arr779;
        [FieldOffset(0x13D20)] public CreditItemInfo itemInfos__arr780;
        [FieldOffset(0x13D88)] public CreditItemInfo itemInfos__arr781;
        [FieldOffset(0x13DF0)] public CreditItemInfo itemInfos__arr782;
        [FieldOffset(0x13E58)] public CreditItemInfo itemInfos__arr783;
        [FieldOffset(0x13EC0)] public CreditItemInfo itemInfos__arr784;
        [FieldOffset(0x13F28)] public CreditItemInfo itemInfos__arr785;
        [FieldOffset(0x13F90)] public CreditItemInfo itemInfos__arr786;
        [FieldOffset(0x13FF8)] public CreditItemInfo itemInfos__arr787;
        [FieldOffset(0x14060)] public CreditItemInfo itemInfos__arr788;
        [FieldOffset(0x140C8)] public CreditItemInfo itemInfos__arr789;
        [FieldOffset(0x14130)] public CreditItemInfo itemInfos__arr790;
        [FieldOffset(0x14198)] public CreditItemInfo itemInfos__arr791;
        [FieldOffset(0x14200)] public CreditItemInfo itemInfos__arr792;
        [FieldOffset(0x14268)] public CreditItemInfo itemInfos__arr793;
        [FieldOffset(0x142D0)] public CreditItemInfo itemInfos__arr794;
        [FieldOffset(0x14338)] public CreditItemInfo itemInfos__arr795;
        [FieldOffset(0x143A0)] public CreditItemInfo itemInfos__arr796;
        [FieldOffset(0x14408)] public CreditItemInfo itemInfos__arr797;
        [FieldOffset(0x14470)] public CreditItemInfo itemInfos__arr798;
        [FieldOffset(0x144D8)] public CreditItemInfo itemInfos__arr799;
        [FieldOffset(0x14540)] public CreditItemInfo itemInfos__arr800;
        [FieldOffset(0x145A8)] public CreditItemInfo itemInfos__arr801;
        [FieldOffset(0x14610)] public CreditItemInfo itemInfos__arr802;
        [FieldOffset(0x14678)] public CreditItemInfo itemInfos__arr803;
        [FieldOffset(0x146E0)] public CreditItemInfo itemInfos__arr804;
        [FieldOffset(0x14748)] public CreditItemInfo itemInfos__arr805;
        [FieldOffset(0x147B0)] public CreditItemInfo itemInfos__arr806;
        [FieldOffset(0x14818)] public CreditItemInfo itemInfos__arr807;
        [FieldOffset(0x14880)] public CreditItemInfo itemInfos__arr808;
        [FieldOffset(0x148E8)] public CreditItemInfo itemInfos__arr809;
        [FieldOffset(0x14950)] public CreditItemInfo itemInfos__arr810;
        [FieldOffset(0x149B8)] public CreditItemInfo itemInfos__arr811;
        [FieldOffset(0x14A20)] public CreditItemInfo itemInfos__arr812;
        [FieldOffset(0x14A88)] public CreditItemInfo itemInfos__arr813;
        [FieldOffset(0x14AF0)] public CreditItemInfo itemInfos__arr814;
        [FieldOffset(0x14B58)] public CreditItemInfo itemInfos__arr815;
        [FieldOffset(0x14BC0)] public CreditItemInfo itemInfos__arr816;
        [FieldOffset(0x14C28)] public CreditItemInfo itemInfos__arr817;
        [FieldOffset(0x14C90)] public CreditItemInfo itemInfos__arr818;
        [FieldOffset(0x14CF8)] public CreditItemInfo itemInfos__arr819;
        [FieldOffset(0x14D60)] public CreditItemInfo itemInfos__arr820;
        [FieldOffset(0x14DC8)] public CreditItemInfo itemInfos__arr821;
        [FieldOffset(0x14E30)] public CreditItemInfo itemInfos__arr822;
        [FieldOffset(0x14E98)] public CreditItemInfo itemInfos__arr823;
        [FieldOffset(0x14F00)] public CreditItemInfo itemInfos__arr824;
        [FieldOffset(0x14F68)] public CreditItemInfo itemInfos__arr825;
        [FieldOffset(0x14FD0)] public CreditItemInfo itemInfos__arr826;
        [FieldOffset(0x15038)] public CreditItemInfo itemInfos__arr827;
        [FieldOffset(0x150A0)] public CreditItemInfo itemInfos__arr828;
        [FieldOffset(0x15108)] public CreditItemInfo itemInfos__arr829;
        [FieldOffset(0x15170)] public CreditItemInfo itemInfos__arr830;
        [FieldOffset(0x151D8)] public CreditItemInfo itemInfos__arr831;
        [FieldOffset(0x15240)] public CreditItemInfo itemInfos__arr832;
        [FieldOffset(0x152A8)] public CreditItemInfo itemInfos__arr833;
        [FieldOffset(0x15310)] public CreditItemInfo itemInfos__arr834;
        [FieldOffset(0x15378)] public CreditItemInfo itemInfos__arr835;
        [FieldOffset(0x153E0)] public CreditItemInfo itemInfos__arr836;
        [FieldOffset(0x15448)] public CreditItemInfo itemInfos__arr837;
        [FieldOffset(0x154B0)] public CreditItemInfo itemInfos__arr838;
        [FieldOffset(0x15518)] public CreditItemInfo itemInfos__arr839;
        [FieldOffset(0x15580)] public CreditItemInfo itemInfos__arr840;
        [FieldOffset(0x155E8)] public CreditItemInfo itemInfos__arr841;
        [FieldOffset(0x15650)] public CreditItemInfo itemInfos__arr842;
        [FieldOffset(0x156B8)] public CreditItemInfo itemInfos__arr843;
        [FieldOffset(0x15720)] public CreditItemInfo itemInfos__arr844;
        [FieldOffset(0x15788)] public CreditItemInfo itemInfos__arr845;
        [FieldOffset(0x157F0)] public CreditItemInfo itemInfos__arr846;
        [FieldOffset(0x15858)] public CreditItemInfo itemInfos__arr847;
        [FieldOffset(0x158C0)] public CreditItemInfo itemInfos__arr848;
        [FieldOffset(0x15928)] public CreditItemInfo itemInfos__arr849;
        [FieldOffset(0x15990)] public CreditItemInfo itemInfos__arr850;
        [FieldOffset(0x159F8)] public CreditItemInfo itemInfos__arr851;
        [FieldOffset(0x15A60)] public CreditItemInfo itemInfos__arr852;
        [FieldOffset(0x15AC8)] public CreditItemInfo itemInfos__arr853;
        [FieldOffset(0x15B30)] public CreditItemInfo itemInfos__arr854;
        [FieldOffset(0x15B98)] public CreditItemInfo itemInfos__arr855;
        [FieldOffset(0x15C00)] public CreditItemInfo itemInfos__arr856;
        [FieldOffset(0x15C68)] public CreditItemInfo itemInfos__arr857;
        [FieldOffset(0x15CD0)] public CreditItemInfo itemInfos__arr858;
        [FieldOffset(0x15D38)] public CreditItemInfo itemInfos__arr859;
        [FieldOffset(0x15DA0)] public CreditItemInfo itemInfos__arr860;
        [FieldOffset(0x15E08)] public CreditItemInfo itemInfos__arr861;
        [FieldOffset(0x15E70)] public CreditItemInfo itemInfos__arr862;
        [FieldOffset(0x15ED8)] public CreditItemInfo itemInfos__arr863;
        [FieldOffset(0x15F40)] public CreditItemInfo itemInfos__arr864;
        [FieldOffset(0x15FA8)] public CreditItemInfo itemInfos__arr865;
        [FieldOffset(0x16010)] public CreditItemInfo itemInfos__arr866;
        [FieldOffset(0x16078)] public CreditItemInfo itemInfos__arr867;
        [FieldOffset(0x160E0)] public CreditItemInfo itemInfos__arr868;
        [FieldOffset(0x16148)] public CreditItemInfo itemInfos__arr869;
        [FieldOffset(0x161B0)] public CreditItemInfo itemInfos__arr870;
        [FieldOffset(0x16218)] public CreditItemInfo itemInfos__arr871;
        [FieldOffset(0x16280)] public CreditItemInfo itemInfos__arr872;
        [FieldOffset(0x162E8)] public CreditItemInfo itemInfos__arr873;
        [FieldOffset(0x16350)] public CreditItemInfo itemInfos__arr874;
        [FieldOffset(0x163B8)] public CreditItemInfo itemInfos__arr875;
        [FieldOffset(0x16420)] public CreditItemInfo itemInfos__arr876;
        [FieldOffset(0x16488)] public CreditItemInfo itemInfos__arr877;
        [FieldOffset(0x164F0)] public CreditItemInfo itemInfos__arr878;
        [FieldOffset(0x16558)] public CreditItemInfo itemInfos__arr879;
        [FieldOffset(0x165C0)] public CreditItemInfo itemInfos__arr880;
        [FieldOffset(0x16628)] public CreditItemInfo itemInfos__arr881;
        [FieldOffset(0x16690)] public CreditItemInfo itemInfos__arr882;
        [FieldOffset(0x166F8)] public CreditItemInfo itemInfos__arr883;
        [FieldOffset(0x16760)] public CreditItemInfo itemInfos__arr884;
        [FieldOffset(0x167C8)] public CreditItemInfo itemInfos__arr885;
        [FieldOffset(0x16830)] public CreditItemInfo itemInfos__arr886;
        [FieldOffset(0x16898)] public CreditItemInfo itemInfos__arr887;
        [FieldOffset(0x16900)] public CreditItemInfo itemInfos__arr888;
        [FieldOffset(0x16968)] public CreditItemInfo itemInfos__arr889;
        [FieldOffset(0x169D0)] public CreditItemInfo itemInfos__arr890;
        [FieldOffset(0x16A38)] public CreditItemInfo itemInfos__arr891;
        [FieldOffset(0x16AA0)] public CreditItemInfo itemInfos__arr892;
        [FieldOffset(0x16B08)] public CreditItemInfo itemInfos__arr893;
        [FieldOffset(0x16B70)] public CreditItemInfo itemInfos__arr894;
        [FieldOffset(0x16BD8)] public CreditItemInfo itemInfos__arr895;
        [FieldOffset(0x16C40)] public CreditItemInfo itemInfos__arr896;
        [FieldOffset(0x16CA8)] public CreditItemInfo itemInfos__arr897;
        [FieldOffset(0x16D10)] public CreditItemInfo itemInfos__arr898;
        [FieldOffset(0x16D78)] public CreditItemInfo itemInfos__arr899;
        [FieldOffset(0x16DE0)] public CreditItemInfo itemInfos__arr900;
        [FieldOffset(0x16E48)] public CreditItemInfo itemInfos__arr901;
        [FieldOffset(0x16EB0)] public CreditItemInfo itemInfos__arr902;
        [FieldOffset(0x16F18)] public CreditItemInfo itemInfos__arr903;
        [FieldOffset(0x16F80)] public CreditItemInfo itemInfos__arr904;
        [FieldOffset(0x16FE8)] public CreditItemInfo itemInfos__arr905;
        [FieldOffset(0x17050)] public CreditItemInfo itemInfos__arr906;
        [FieldOffset(0x170B8)] public CreditItemInfo itemInfos__arr907;
        [FieldOffset(0x17120)] public CreditItemInfo itemInfos__arr908;
        [FieldOffset(0x17188)] public CreditItemInfo itemInfos__arr909;
        [FieldOffset(0x171F0)] public CreditItemInfo itemInfos__arr910;
        [FieldOffset(0x17258)] public CreditItemInfo itemInfos__arr911;
        [FieldOffset(0x172C0)] public CreditItemInfo itemInfos__arr912;
        [FieldOffset(0x17328)] public CreditItemInfo itemInfos__arr913;
        [FieldOffset(0x17390)] public CreditItemInfo itemInfos__arr914;
        [FieldOffset(0x173F8)] public CreditItemInfo itemInfos__arr915;
        [FieldOffset(0x17460)] public CreditItemInfo itemInfos__arr916;
        [FieldOffset(0x174C8)] public CreditItemInfo itemInfos__arr917;
        [FieldOffset(0x17530)] public CreditItemInfo itemInfos__arr918;
        [FieldOffset(0x17598)] public CreditItemInfo itemInfos__arr919;
        [FieldOffset(0x17600)] public CreditItemInfo itemInfos__arr920;
        [FieldOffset(0x17668)] public CreditItemInfo itemInfos__arr921;
        [FieldOffset(0x176D0)] public CreditItemInfo itemInfos__arr922;
        [FieldOffset(0x17738)] public CreditItemInfo itemInfos__arr923;
        [FieldOffset(0x177A0)] public CreditItemInfo itemInfos__arr924;
        [FieldOffset(0x17808)] public CreditItemInfo itemInfos__arr925;
        [FieldOffset(0x17870)] public CreditItemInfo itemInfos__arr926;
        [FieldOffset(0x178D8)] public CreditItemInfo itemInfos__arr927;
        [FieldOffset(0x17940)] public CreditItemInfo itemInfos__arr928;
        [FieldOffset(0x179A8)] public CreditItemInfo itemInfos__arr929;
        [FieldOffset(0x17A10)] public CreditItemInfo itemInfos__arr930;
        [FieldOffset(0x17A78)] public CreditItemInfo itemInfos__arr931;
        [FieldOffset(0x17AE0)] public CreditItemInfo itemInfos__arr932;
        [FieldOffset(0x17B48)] public CreditItemInfo itemInfos__arr933;
        [FieldOffset(0x17BB0)] public CreditItemInfo itemInfos__arr934;
        [FieldOffset(0x17C18)] public CreditItemInfo itemInfos__arr935;
        [FieldOffset(0x17C80)] public CreditItemInfo itemInfos__arr936;
        [FieldOffset(0x17CE8)] public CreditItemInfo itemInfos__arr937;
        [FieldOffset(0x17D50)] public CreditItemInfo itemInfos__arr938;
        [FieldOffset(0x17DB8)] public CreditItemInfo itemInfos__arr939;
        [FieldOffset(0x17E20)] public CreditItemInfo itemInfos__arr940;
        [FieldOffset(0x17E88)] public CreditItemInfo itemInfos__arr941;
        [FieldOffset(0x17EF0)] public CreditItemInfo itemInfos__arr942;
        [FieldOffset(0x17F58)] public CreditItemInfo itemInfos__arr943;
        [FieldOffset(0x17FC0)] public CreditItemInfo itemInfos__arr944;
        [FieldOffset(0x18028)] public CreditItemInfo itemInfos__arr945;
        [FieldOffset(0x18090)] public CreditItemInfo itemInfos__arr946;
        [FieldOffset(0x180F8)] public CreditItemInfo itemInfos__arr947;
        [FieldOffset(0x18160)] public CreditItemInfo itemInfos__arr948;
        [FieldOffset(0x181C8)] public CreditItemInfo itemInfos__arr949;
        [FieldOffset(0x18230)] public CreditItemInfo itemInfos__arr950;
        [FieldOffset(0x18298)] public CreditItemInfo itemInfos__arr951;
        [FieldOffset(0x18300)] public CreditItemInfo itemInfos__arr952;
        [FieldOffset(0x18368)] public CreditItemInfo itemInfos__arr953;
        [FieldOffset(0x183D0)] public CreditItemInfo itemInfos__arr954;
        [FieldOffset(0x18438)] public CreditItemInfo itemInfos__arr955;
        [FieldOffset(0x184A0)] public CreditItemInfo itemInfos__arr956;
        [FieldOffset(0x18508)] public CreditItemInfo itemInfos__arr957;
        [FieldOffset(0x18570)] public CreditItemInfo itemInfos__arr958;
        [FieldOffset(0x185D8)] public CreditItemInfo itemInfos__arr959;
        [FieldOffset(0x18640)] public CreditItemInfo itemInfos__arr960;
        [FieldOffset(0x186A8)] public CreditItemInfo itemInfos__arr961;
        [FieldOffset(0x18710)] public CreditItemInfo itemInfos__arr962;
        [FieldOffset(0x18778)] public CreditItemInfo itemInfos__arr963;
        [FieldOffset(0x187E0)] public CreditItemInfo itemInfos__arr964;
        [FieldOffset(0x18848)] public CreditItemInfo itemInfos__arr965;
        [FieldOffset(0x188B0)] public CreditItemInfo itemInfos__arr966;
        [FieldOffset(0x18918)] public CreditItemInfo itemInfos__arr967;
        [FieldOffset(0x18980)] public CreditItemInfo itemInfos__arr968;
        [FieldOffset(0x189E8)] public CreditItemInfo itemInfos__arr969;
        [FieldOffset(0x18A50)] public CreditItemInfo itemInfos__arr970;
        [FieldOffset(0x18AB8)] public CreditItemInfo itemInfos__arr971;
        [FieldOffset(0x18B20)] public CreditItemInfo itemInfos__arr972;
        [FieldOffset(0x18B88)] public CreditItemInfo itemInfos__arr973;
        [FieldOffset(0x18BF0)] public CreditItemInfo itemInfos__arr974;
        [FieldOffset(0x18C58)] public CreditItemInfo itemInfos__arr975;
        [FieldOffset(0x18CC0)] public CreditItemInfo itemInfos__arr976;
        [FieldOffset(0x18D28)] public CreditItemInfo itemInfos__arr977;
        [FieldOffset(0x18D90)] public CreditItemInfo itemInfos__arr978;
        [FieldOffset(0x18DF8)] public CreditItemInfo itemInfos__arr979;
        [FieldOffset(0x18E60)] public CreditItemInfo itemInfos__arr980;
        [FieldOffset(0x18EC8)] public CreditItemInfo itemInfos__arr981;
        [FieldOffset(0x18F30)] public CreditItemInfo itemInfos__arr982;
        [FieldOffset(0x18F98)] public CreditItemInfo itemInfos__arr983;
        [FieldOffset(0x19000)] public CreditItemInfo itemInfos__arr984;
        [FieldOffset(0x19068)] public CreditItemInfo itemInfos__arr985;
        [FieldOffset(0x190D0)] public CreditItemInfo itemInfos__arr986;
        [FieldOffset(0x19138)] public CreditItemInfo itemInfos__arr987;
        [FieldOffset(0x191A0)] public CreditItemInfo itemInfos__arr988;
        [FieldOffset(0x19208)] public CreditItemInfo itemInfos__arr989;
        [FieldOffset(0x19270)] public CreditItemInfo itemInfos__arr990;
        [FieldOffset(0x192D8)] public CreditItemInfo itemInfos__arr991;
        [FieldOffset(0x19340)] public CreditItemInfo itemInfos__arr992;
        [FieldOffset(0x193A8)] public CreditItemInfo itemInfos__arr993;
        [FieldOffset(0x19410)] public CreditItemInfo itemInfos__arr994;
        [FieldOffset(0x19478)] public CreditItemInfo itemInfos__arr995;
        [FieldOffset(0x194E0)] public CreditItemInfo itemInfos__arr996;
        [FieldOffset(0x19548)] public CreditItemInfo itemInfos__arr997;
        [FieldOffset(0x195B0)] public CreditItemInfo itemInfos__arr998;
        [FieldOffset(0x19618)] public CreditItemInfo itemInfos__arr999;
        [FieldOffset(0x19680)] public CreditItemInfo itemInfos__arr1000;
        [FieldOffset(0x196E8)] public CreditItemInfo itemInfos__arr1001;
        [FieldOffset(0x19750)] public CreditItemInfo itemInfos__arr1002;
        [FieldOffset(0x197B8)] public CreditItemInfo itemInfos__arr1003;
        [FieldOffset(0x19820)] public CreditItemInfo itemInfos__arr1004;
        [FieldOffset(0x19888)] public CreditItemInfo itemInfos__arr1005;
        [FieldOffset(0x198F0)] public CreditItemInfo itemInfos__arr1006;
        [FieldOffset(0x19958)] public CreditItemInfo itemInfos__arr1007;
        [FieldOffset(0x199C0)] public CreditItemInfo itemInfos__arr1008;
        [FieldOffset(0x19A28)] public CreditItemInfo itemInfos__arr1009;
        [FieldOffset(0x19A90)] public CreditItemInfo itemInfos__arr1010;
        [FieldOffset(0x19AF8)] public CreditItemInfo itemInfos__arr1011;
        [FieldOffset(0x19B60)] public CreditItemInfo itemInfos__arr1012;
        [FieldOffset(0x19BC8)] public CreditItemInfo itemInfos__arr1013;
        [FieldOffset(0x19C30)] public CreditItemInfo itemInfos__arr1014;
        [FieldOffset(0x19C98)] public CreditItemInfo itemInfos__arr1015;
        [FieldOffset(0x19D00)] public CreditItemInfo itemInfos__arr1016;
        [FieldOffset(0x19D68)] public CreditItemInfo itemInfos__arr1017;
        [FieldOffset(0x19DD0)] public CreditItemInfo itemInfos__arr1018;
        [FieldOffset(0x19E38)] public CreditItemInfo itemInfos__arr1019;
        [FieldOffset(0x19EA0)] public CreditItemInfo itemInfos__arr1020;
        [FieldOffset(0x19F08)] public CreditItemInfo itemInfos__arr1021;
        [FieldOffset(0x19F70)] public CreditItemInfo itemInfos__arr1022;
        [FieldOffset(0x19FD8)] public CreditItemInfo itemInfos__arr1023;
        [FieldOffset(0x1A040)] public CreditItemInfo itemInfos__arr1024;
        [FieldOffset(0x1A0A8)] public CreditItemInfo itemInfos__arr1025;
        [FieldOffset(0x1A110)] public CreditItemInfo itemInfos__arr1026;
        [FieldOffset(0x1A178)] public CreditItemInfo itemInfos__arr1027;
        [FieldOffset(0x1A1E0)] public CreditItemInfo itemInfos__arr1028;
        [FieldOffset(0x1A248)] public CreditItemInfo itemInfos__arr1029;
        [FieldOffset(0x1A2B0)] public CreditItemInfo itemInfos__arr1030;
        [FieldOffset(0x1A318)] public CreditItemInfo itemInfos__arr1031;
        [FieldOffset(0x1A380)] public CreditItemInfo itemInfos__arr1032;
        [FieldOffset(0x1A3E8)] public CreditItemInfo itemInfos__arr1033;
        [FieldOffset(0x1A450)] public CreditItemInfo itemInfos__arr1034;
        [FieldOffset(0x1A4B8)] public CreditItemInfo itemInfos__arr1035;
        [FieldOffset(0x1A520)] public CreditItemInfo itemInfos__arr1036;
        [FieldOffset(0x1A588)] public CreditItemInfo itemInfos__arr1037;
        [FieldOffset(0x1A5F0)] public CreditItemInfo itemInfos__arr1038;
        [FieldOffset(0x1A658)] public CreditItemInfo itemInfos__arr1039;
        [FieldOffset(0x1A6C0)] public CreditItemInfo itemInfos__arr1040;
        [FieldOffset(0x1A728)] public CreditItemInfo itemInfos__arr1041;
        [FieldOffset(0x1A790)] public CreditItemInfo itemInfos__arr1042;
        [FieldOffset(0x1A7F8)] public CreditItemInfo itemInfos__arr1043;
        [FieldOffset(0x1A860)] public CreditItemInfo itemInfos__arr1044;
        [FieldOffset(0x1A8C8)] public CreditItemInfo itemInfos__arr1045;
        [FieldOffset(0x1A930)] public CreditItemInfo itemInfos__arr1046;
        [FieldOffset(0x1A998)] public CreditItemInfo itemInfos__arr1047;
        [FieldOffset(0x1AA00)] public CreditItemInfo itemInfos__arr1048;
        [FieldOffset(0x1AA68)] public CreditItemInfo itemInfos__arr1049;
        [FieldOffset(0x1AAD0)] public CreditItemInfo itemInfos__arr1050;
        [FieldOffset(0x1AB38)] public CreditItemInfo itemInfos__arr1051;
        [FieldOffset(0x1ABA0)] public CreditItemInfo itemInfos__arr1052;
        [FieldOffset(0x1AC08)] public CreditItemInfo itemInfos__arr1053;
        [FieldOffset(0x1AC70)] public CreditItemInfo itemInfos__arr1054;
        [FieldOffset(0x1ACD8)] public CreditItemInfo itemInfos__arr1055;
        [FieldOffset(0x1AD40)] public CreditItemInfo itemInfos__arr1056;
        [FieldOffset(0x1ADA8)] public CreditItemInfo itemInfos__arr1057;
        [FieldOffset(0x1AE10)] public CreditItemInfo itemInfos__arr1058;
        [FieldOffset(0x1AE78)] public CreditItemInfo itemInfos__arr1059;
        [FieldOffset(0x1AEE0)] public CreditItemInfo itemInfos__arr1060;
        [FieldOffset(0x1AF48)] public CreditItemInfo itemInfos__arr1061;
        [FieldOffset(0x1AFB0)] public CreditItemInfo itemInfos__arr1062;
        [FieldOffset(0x1B018)] public CreditItemInfo itemInfos__arr1063;
        [FieldOffset(0x1B080)] public CreditItemInfo itemInfos__arr1064;
        [FieldOffset(0x1B0E8)] public CreditItemInfo itemInfos__arr1065;
        [FieldOffset(0x1B150)] public CreditItemInfo itemInfos__arr1066;
        [FieldOffset(0x1B1B8)] public CreditItemInfo itemInfos__arr1067;
        [FieldOffset(0x1B220)] public CreditItemInfo itemInfos__arr1068;
        [FieldOffset(0x1B288)] public CreditItemInfo itemInfos__arr1069;
        [FieldOffset(0x1B2F0)] public CreditItemInfo itemInfos__arr1070;
        [FieldOffset(0x1B358)] public CreditItemInfo itemInfos__arr1071;
        [FieldOffset(0x1B3C0)] public CreditItemInfo itemInfos__arr1072;
        [FieldOffset(0x1B428)] public CreditItemInfo itemInfos__arr1073;
        [FieldOffset(0x1B490)] public CreditItemInfo itemInfos__arr1074;
        [FieldOffset(0x1B4F8)] public CreditItemInfo itemInfos__arr1075;
        [FieldOffset(0x1B560)] public CreditItemInfo itemInfos__arr1076;
        [FieldOffset(0x1B5C8)] public CreditItemInfo itemInfos__arr1077;
        [FieldOffset(0x1B630)] public CreditItemInfo itemInfos__arr1078;
        [FieldOffset(0x1B698)] public CreditItemInfo itemInfos__arr1079;
        [FieldOffset(0x1B700)] public CreditItemInfo itemInfos__arr1080;
        [FieldOffset(0x1B768)] public CreditItemInfo itemInfos__arr1081;
        [FieldOffset(0x1B7D0)] public CreditItemInfo itemInfos__arr1082;
        [FieldOffset(0x1B838)] public CreditItemInfo itemInfos__arr1083;
        [FieldOffset(0x1B8A0)] public CreditItemInfo itemInfos__arr1084;
        [FieldOffset(0x1B908)] public CreditItemInfo itemInfos__arr1085;
        [FieldOffset(0x1B970)] public CreditItemInfo itemInfos__arr1086;
        [FieldOffset(0x1B9D8)] public CreditItemInfo itemInfos__arr1087;
        [FieldOffset(0x1BA40)] public CreditItemInfo itemInfos__arr1088;
        [FieldOffset(0x1BAA8)] public CreditItemInfo itemInfos__arr1089;
        [FieldOffset(0x1BB10)] public CreditItemInfo itemInfos__arr1090;
        [FieldOffset(0x1BB78)] public CreditItemInfo itemInfos__arr1091;
        [FieldOffset(0x1BBE0)] public CreditItemInfo itemInfos__arr1092;
        [FieldOffset(0x1BC48)] public CreditItemInfo itemInfos__arr1093;
        [FieldOffset(0x1BCB0)] public CreditItemInfo itemInfos__arr1094;
        [FieldOffset(0x1BD18)] public CreditItemInfo itemInfos__arr1095;
        [FieldOffset(0x1BD80)] public CreditItemInfo itemInfos__arr1096;
        [FieldOffset(0x1BDE8)] public CreditItemInfo itemInfos__arr1097;
        [FieldOffset(0x1BE50)] public CreditItemInfo itemInfos__arr1098;
        [FieldOffset(0x1BEB8)] public CreditItemInfo itemInfos__arr1099;
        [FieldOffset(0x1BF20)] public CreditItemInfo itemInfos__arr1100;
        [FieldOffset(0x1BF88)] public CreditItemInfo itemInfos__arr1101;
        [FieldOffset(0x1BFF0)] public CreditItemInfo itemInfos__arr1102;
        [FieldOffset(0x1C058)] public CreditItemInfo itemInfos__arr1103;
        [FieldOffset(0x1C0C0)] public CreditItemInfo itemInfos__arr1104;
        [FieldOffset(0x1C128)] public CreditItemInfo itemInfos__arr1105;
        [FieldOffset(0x1C190)] public CreditItemInfo itemInfos__arr1106;
        [FieldOffset(0x1C1F8)] public CreditItemInfo itemInfos__arr1107;
        [FieldOffset(0x1C260)] public CreditItemInfo itemInfos__arr1108;
        [FieldOffset(0x1C2C8)] public CreditItemInfo itemInfos__arr1109;
        [FieldOffset(0x1C330)] public CreditItemInfo itemInfos__arr1110;
        [FieldOffset(0x1C398)] public CreditItemInfo itemInfos__arr1111;
        [FieldOffset(0x1C400)] public CreditItemInfo itemInfos__arr1112;
        [FieldOffset(0x1C468)] public CreditItemInfo itemInfos__arr1113;
        [FieldOffset(0x1C4D0)] public CreditItemInfo itemInfos__arr1114;
        [FieldOffset(0x1C538)] public CreditItemInfo itemInfos__arr1115;
        [FieldOffset(0x1C5A0)] public CreditItemInfo itemInfos__arr1116;
        [FieldOffset(0x1C608)] public CreditItemInfo itemInfos__arr1117;
        [FieldOffset(0x1C670)] public CreditItemInfo itemInfos__arr1118;
        [FieldOffset(0x1C6D8)] public CreditItemInfo itemInfos__arr1119;
        [FieldOffset(0x1C740)] public CreditItemInfo itemInfos__arr1120;
        [FieldOffset(0x1C7A8)] public CreditItemInfo itemInfos__arr1121;
        [FieldOffset(0x1C810)] public CreditItemInfo itemInfos__arr1122;
        [FieldOffset(0x1C878)] public CreditItemInfo itemInfos__arr1123;
        [FieldOffset(0x1C8E0)] public CreditItemInfo itemInfos__arr1124;
        [FieldOffset(0x1C948)] public CreditItemInfo itemInfos__arr1125;
        [FieldOffset(0x1C9B0)] public CreditItemInfo itemInfos__arr1126;
        [FieldOffset(0x1CA18)] public CreditItemInfo itemInfos__arr1127;
        [FieldOffset(0x1CA80)] public CreditItemInfo itemInfos__arr1128;
        [FieldOffset(0x1CAE8)] public CreditItemInfo itemInfos__arr1129;
        [FieldOffset(0x1CB50)] public CreditItemInfo itemInfos__arr1130;
        [FieldOffset(0x1CBB8)] public CreditItemInfo itemInfos__arr1131;
        [FieldOffset(0x1CC20)] public CreditItemInfo itemInfos__arr1132;
        [FieldOffset(0x1CC88)] public CreditItemInfo itemInfos__arr1133;
        [FieldOffset(0x1CCF0)] public CreditItemInfo itemInfos__arr1134;
        [FieldOffset(0x1CD58)] public CreditItemInfo itemInfos__arr1135;
        [FieldOffset(0x1CDC0)] public CreditItemInfo itemInfos__arr1136;
        [FieldOffset(0x1CE28)] public CreditItemInfo itemInfos__arr1137;
        [FieldOffset(0x1CE90)] public CreditItemInfo itemInfos__arr1138;
        [FieldOffset(0x1CEF8)] public CreditItemInfo itemInfos__arr1139;
        [FieldOffset(0x1CF60)] public CreditItemInfo itemInfos__arr1140;
        [FieldOffset(0x1CFC8)] public CreditItemInfo itemInfos__arr1141;
        [FieldOffset(0x1D030)] public CreditItemInfo itemInfos__arr1142;
        [FieldOffset(0x1D098)] public CreditItemInfo itemInfos__arr1143;
        [FieldOffset(0x1D100)] public CreditItemInfo itemInfos__arr1144;
        [FieldOffset(0x1D168)] public CreditItemInfo itemInfos__arr1145;
        [FieldOffset(0x1D1D0)] public CreditItemInfo itemInfos__arr1146;
        [FieldOffset(0x1D238)] public CreditItemInfo itemInfos__arr1147;
        [FieldOffset(0x1D2A0)] public CreditItemInfo itemInfos__arr1148;
        [FieldOffset(0x1D308)] public CreditItemInfo itemInfos__arr1149;
        [FieldOffset(0x1D370)] public CreditItemInfo itemInfos__arr1150;
        [FieldOffset(0x1D3D8)] public CreditItemInfo itemInfos__arr1151;
        [FieldOffset(0x1D440)] public CreditItemInfo itemInfos__arr1152;
        [FieldOffset(0x1D4A8)] public CreditItemInfo itemInfos__arr1153;
        [FieldOffset(0x1D510)] public CreditItemInfo itemInfos__arr1154;
        [FieldOffset(0x1D578)] public CreditItemInfo itemInfos__arr1155;
        [FieldOffset(0x1D5E0)] public CreditItemInfo itemInfos__arr1156;
        [FieldOffset(0x1D648)] public CreditItemInfo itemInfos__arr1157;
        [FieldOffset(0x1D6B0)] public CreditItemInfo itemInfos__arr1158;
        [FieldOffset(0x1D718)] public CreditItemInfo itemInfos__arr1159;
        [FieldOffset(0x1D780)] public CreditItemInfo itemInfos__arr1160;
        [FieldOffset(0x1D7E8)] public CreditItemInfo itemInfos__arr1161;
        [FieldOffset(0x1D850)] public CreditItemInfo itemInfos__arr1162;
        [FieldOffset(0x1D8B8)] public CreditItemInfo itemInfos__arr1163;
        [FieldOffset(0x1D920)] public CreditItemInfo itemInfos__arr1164;
        [FieldOffset(0x1D988)] public CreditItemInfo itemInfos__arr1165;
        [FieldOffset(0x1D9F0)] public CreditItemInfo itemInfos__arr1166;
        [FieldOffset(0x1DA58)] public CreditItemInfo itemInfos__arr1167;
        [FieldOffset(0x1DAC0)] public CreditItemInfo itemInfos__arr1168;
        [FieldOffset(0x1DB28)] public CreditItemInfo itemInfos__arr1169;
        [FieldOffset(0x1DB90)] public CreditItemInfo itemInfos__arr1170;
        [FieldOffset(0x1DBF8)] public CreditItemInfo itemInfos__arr1171;
        [FieldOffset(0x1DC60)] public CreditItemInfo itemInfos__arr1172;
        [FieldOffset(0x1DCC8)] public CreditItemInfo itemInfos__arr1173;
        [FieldOffset(0x1DD30)] public CreditItemInfo itemInfos__arr1174;
        [FieldOffset(0x1DD98)] public CreditItemInfo itemInfos__arr1175;
        [FieldOffset(0x1DE00)] public CreditItemInfo itemInfos__arr1176;
        [FieldOffset(0x1DE68)] public CreditItemInfo itemInfos__arr1177;
        [FieldOffset(0x1DED0)] public CreditItemInfo itemInfos__arr1178;
        [FieldOffset(0x1DF38)] public CreditItemInfo itemInfos__arr1179;
        [FieldOffset(0x1DFA0)] public CreditItemInfo itemInfos__arr1180;
        [FieldOffset(0x1E008)] public CreditItemInfo itemInfos__arr1181;
        [FieldOffset(0x1E070)] public CreditItemInfo itemInfos__arr1182;
        [FieldOffset(0x1E0D8)] public CreditItemInfo itemInfos__arr1183;
        [FieldOffset(0x1E140)] public CreditItemInfo itemInfos__arr1184;
        [FieldOffset(0x1E1A8)] public CreditItemInfo itemInfos__arr1185;
        [FieldOffset(0x1E210)] public CreditItemInfo itemInfos__arr1186;
        [FieldOffset(0x1E278)] public CreditItemInfo itemInfos__arr1187;
        [FieldOffset(0x1E2E0)] public CreditItemInfo itemInfos__arr1188;
        [FieldOffset(0x1E348)] public CreditItemInfo itemInfos__arr1189;
        [FieldOffset(0x1E3B0)] public CreditItemInfo itemInfos__arr1190;
        [FieldOffset(0x1E418)] public CreditItemInfo itemInfos__arr1191;
        [FieldOffset(0x1E480)] public CreditItemInfo itemInfos__arr1192;
        [FieldOffset(0x1E4E8)] public CreditItemInfo itemInfos__arr1193;
        [FieldOffset(0x1E550)] public CreditItemInfo itemInfos__arr1194;
        [FieldOffset(0x1E5B8)] public CreditItemInfo itemInfos__arr1195;
        [FieldOffset(0x1E620)] public CreditItemInfo itemInfos__arr1196;
        [FieldOffset(0x1E688)] public CreditItemInfo itemInfos__arr1197;
        [FieldOffset(0x1E6F0)] public CreditItemInfo itemInfos__arr1198;
        [FieldOffset(0x1E758)] public CreditItemInfo itemInfos__arr1199;
        [FieldOffset(0x1E7C0)] public CreditItemInfo itemInfos__arr1200;
        [FieldOffset(0x1E828)] public CreditItemInfo itemInfos__arr1201;
        [FieldOffset(0x1E890)] public CreditItemInfo itemInfos__arr1202;
        [FieldOffset(0x1E8F8)] public CreditItemInfo itemInfos__arr1203;
        [FieldOffset(0x1E960)] public CreditItemInfo itemInfos__arr1204;
        [FieldOffset(0x1E9C8)] public CreditItemInfo itemInfos__arr1205;
        [FieldOffset(0x1EA30)] public CreditItemInfo itemInfos__arr1206;
        [FieldOffset(0x1EA98)] public CreditItemInfo itemInfos__arr1207;
        [FieldOffset(0x1EB00)] public CreditItemInfo itemInfos__arr1208;
        [FieldOffset(0x1EB68)] public CreditItemInfo itemInfos__arr1209;
        [FieldOffset(0x1EBD0)] public CreditItemInfo itemInfos__arr1210;
        [FieldOffset(0x1EC38)] public CreditItemInfo itemInfos__arr1211;
        [FieldOffset(0x1ECA0)] public CreditItemInfo itemInfos__arr1212;
        [FieldOffset(0x1ED08)] public CreditItemInfo itemInfos__arr1213;
        [FieldOffset(0x1ED70)] public CreditItemInfo itemInfos__arr1214;
        [FieldOffset(0x1EDD8)] public CreditItemInfo itemInfos__arr1215;
        [FieldOffset(0x1EE40)] public CreditItemInfo itemInfos__arr1216;
        [FieldOffset(0x1EEA8)] public CreditItemInfo itemInfos__arr1217;
        [FieldOffset(0x1EF10)] public CreditItemInfo itemInfos__arr1218;
        [FieldOffset(0x1EF78)] public CreditItemInfo itemInfos__arr1219;
        [FieldOffset(0x1EFE0)] public CreditItemInfo itemInfos__arr1220;
        [FieldOffset(0x1F048)] public CreditItemInfo itemInfos__arr1221;
        [FieldOffset(0x1F0B0)] public CreditItemInfo itemInfos__arr1222;
        [FieldOffset(0x1F118)] public CreditItemInfo itemInfos__arr1223;
        [FieldOffset(0x1F180)] public CreditItemInfo itemInfos__arr1224;
        [FieldOffset(0x1F1E8)] public CreditItemInfo itemInfos__arr1225;
        [FieldOffset(0x1F250)] public CreditItemInfo itemInfos__arr1226;
        [FieldOffset(0x1F2B8)] public CreditItemInfo itemInfos__arr1227;
        [FieldOffset(0x1F320)] public CreditItemInfo itemInfos__arr1228;
        [FieldOffset(0x1F388)] public CreditItemInfo itemInfos__arr1229;
        [FieldOffset(0x1F3F0)] public CreditItemInfo itemInfos__arr1230;
        [FieldOffset(0x1F458)] public CreditItemInfo itemInfos__arr1231;
        [FieldOffset(0x1F4C0)] public CreditItemInfo itemInfos__arr1232;
        [FieldOffset(0x1F528)] public CreditItemInfo itemInfos__arr1233;
        [FieldOffset(0x1F590)] public CreditItemInfo itemInfos__arr1234;
        [FieldOffset(0x1F5F8)] public CreditItemInfo itemInfos__arr1235;
        [FieldOffset(0x1F660)] public CreditItemInfo itemInfos__arr1236;
        [FieldOffset(0x1F6C8)] public CreditItemInfo itemInfos__arr1237;
        [FieldOffset(0x1F730)] public CreditItemInfo itemInfos__arr1238;
        [FieldOffset(0x1F798)] public CreditItemInfo itemInfos__arr1239;
        [FieldOffset(0x1F800)] public CreditItemInfo itemInfos__arr1240;
        [FieldOffset(0x1F868)] public CreditItemInfo itemInfos__arr1241;
        [FieldOffset(0x1F8D0)] public CreditItemInfo itemInfos__arr1242;
        [FieldOffset(0x1F938)] public CreditItemInfo itemInfos__arr1243;
        [FieldOffset(0x1F9A0)] public CreditItemInfo itemInfos__arr1244;
        [FieldOffset(0x1FA08)] public CreditItemInfo itemInfos__arr1245;
        [FieldOffset(0x1FA70)] public CreditItemInfo itemInfos__arr1246;
        [FieldOffset(0x1FAD8)] public CreditItemInfo itemInfos__arr1247;
        [FieldOffset(0x1FB40)] public CreditItemInfo itemInfos__arr1248;
        [FieldOffset(0x1FBA8)] public CreditItemInfo itemInfos__arr1249;
        [FieldOffset(0x1FC10)] public CreditItemInfo itemInfos__arr1250;
        [FieldOffset(0x1FC78)] public CreditItemInfo itemInfos__arr1251;
        [FieldOffset(0x1FCE0)] public CreditItemInfo itemInfos__arr1252;
        [FieldOffset(0x1FD48)] public CreditItemInfo itemInfos__arr1253;
        [FieldOffset(0x1FDB0)] public CreditItemInfo itemInfos__arr1254;
        [FieldOffset(0x1FE18)] public CreditItemInfo itemInfos__arr1255;
        [FieldOffset(0x1FE80)] public CreditItemInfo itemInfos__arr1256;
        [FieldOffset(0x1FEE8)] public CreditItemInfo itemInfos__arr1257;
        [FieldOffset(0x1FF50)] public CreditItemInfo itemInfos__arr1258;
        [FieldOffset(0x1FFB8)] public CreditItemInfo itemInfos__arr1259;
        [FieldOffset(0x20020)] public CreditItemInfo itemInfos__arr1260;
        [FieldOffset(0x20088)] public CreditItemInfo itemInfos__arr1261;
        [FieldOffset(0x200F0)] public CreditItemInfo itemInfos__arr1262;
        [FieldOffset(0x20158)] public CreditItemInfo itemInfos__arr1263;
        [FieldOffset(0x201C0)] public CreditItemInfo itemInfos__arr1264;
        [FieldOffset(0x20228)] public CreditItemInfo itemInfos__arr1265;
        [FieldOffset(0x20290)] public CreditItemInfo itemInfos__arr1266;
        [FieldOffset(0x202F8)] public CreditItemInfo itemInfos__arr1267;
        [FieldOffset(0x20360)] public CreditItemInfo itemInfos__arr1268;
        [FieldOffset(0x203C8)] public CreditItemInfo itemInfos__arr1269;
        [FieldOffset(0x20430)] public CreditItemInfo itemInfos__arr1270;
        [FieldOffset(0x20498)] public CreditItemInfo itemInfos__arr1271;
        [FieldOffset(0x20500)] public CreditItemInfo itemInfos__arr1272;
        [FieldOffset(0x20568)] public CreditItemInfo itemInfos__arr1273;
        [FieldOffset(0x205D0)] public CreditItemInfo itemInfos__arr1274;
        [FieldOffset(0x20638)] public CreditItemInfo itemInfos__arr1275;
        [FieldOffset(0x206A0)] public CreditItemInfo itemInfos__arr1276;
        [FieldOffset(0x20708)] public CreditItemInfo itemInfos__arr1277;
        [FieldOffset(0x20770)] public CreditItemInfo itemInfos__arr1278;
        [FieldOffset(0x207D8)] public CreditItemInfo itemInfos__arr1279;
        [FieldOffset(0x20840)] public CreditItemInfo itemInfos__arr1280;
        [FieldOffset(0x208A8)] public CreditItemInfo itemInfos__arr1281;
        [FieldOffset(0x20910)] public CreditItemInfo itemInfos__arr1282;
        [FieldOffset(0x20978)] public CreditItemInfo itemInfos__arr1283;
        [FieldOffset(0x209E0)] public CreditItemInfo itemInfos__arr1284;
        [FieldOffset(0x20A48)] public CreditItemInfo itemInfos__arr1285;
        [FieldOffset(0x20AB0)] public CreditItemInfo itemInfos__arr1286;
        [FieldOffset(0x20B18)] public CreditItemInfo itemInfos__arr1287;
        [FieldOffset(0x20B80)] public CreditItemInfo itemInfos__arr1288;
        [FieldOffset(0x20BE8)] public CreditItemInfo itemInfos__arr1289;
        [FieldOffset(0x20C50)] public CreditItemInfo itemInfos__arr1290;
        [FieldOffset(0x20CB8)] public CreditItemInfo itemInfos__arr1291;
        [FieldOffset(0x20D20)] public CreditItemInfo itemInfos__arr1292;
        [FieldOffset(0x20D88)] public CreditItemInfo itemInfos__arr1293;
        [FieldOffset(0x20DF0)] public CreditItemInfo itemInfos__arr1294;
        [FieldOffset(0x20E58)] public CreditItemInfo itemInfos__arr1295;
        [FieldOffset(0x20EC0)] public CreditItemInfo itemInfos__arr1296;
        [FieldOffset(0x20F28)] public CreditItemInfo itemInfos__arr1297;
        [FieldOffset(0x20F90)] public CreditItemInfo itemInfos__arr1298;
        [FieldOffset(0x20FF8)] public CreditItemInfo itemInfos__arr1299;
        [FieldOffset(0x21060)] public CreditItemInfo itemInfos__arr1300;
        [FieldOffset(0x210C8)] public CreditItemInfo itemInfos__arr1301;
        [FieldOffset(0x21130)] public CreditItemInfo itemInfos__arr1302;
        [FieldOffset(0x21198)] public CreditItemInfo itemInfos__arr1303;
        [FieldOffset(0x21200)] public CreditItemInfo itemInfos__arr1304;
        [FieldOffset(0x21268)] public CreditItemInfo itemInfos__arr1305;
        [FieldOffset(0x212D0)] public CreditItemInfo itemInfos__arr1306;
        [FieldOffset(0x21338)] public CreditItemInfo itemInfos__arr1307;
        [FieldOffset(0x213A0)] public CreditItemInfo itemInfos__arr1308;
        [FieldOffset(0x21408)] public CreditItemInfo itemInfos__arr1309;
        [FieldOffset(0x21470)] public CreditItemInfo itemInfos__arr1310;
        [FieldOffset(0x214D8)] public CreditItemInfo itemInfos__arr1311;
        [FieldOffset(0x21540)] public CreditItemInfo itemInfos__arr1312;
        [FieldOffset(0x215A8)] public CreditItemInfo itemInfos__arr1313;
        [FieldOffset(0x21610)] public CreditItemInfo itemInfos__arr1314;
        [FieldOffset(0x21678)] public CreditItemInfo itemInfos__arr1315;
        [FieldOffset(0x216E0)] public CreditItemInfo itemInfos__arr1316;
        [FieldOffset(0x21748)] public CreditItemInfo itemInfos__arr1317;
        [FieldOffset(0x217B0)] public CreditItemInfo itemInfos__arr1318;
        [FieldOffset(0x21818)] public CreditItemInfo itemInfos__arr1319;
        [FieldOffset(0x21880)] public CreditItemInfo itemInfos__arr1320;
        [FieldOffset(0x218E8)] public CreditItemInfo itemInfos__arr1321;
        [FieldOffset(0x21950)] public CreditItemInfo itemInfos__arr1322;
        [FieldOffset(0x219B8)] public CreditItemInfo itemInfos__arr1323;
        [FieldOffset(0x21A20)] public CreditItemInfo itemInfos__arr1324;
        [FieldOffset(0x21A88)] public CreditItemInfo itemInfos__arr1325;
        [FieldOffset(0x21AF0)] public CreditItemInfo itemInfos__arr1326;
        [FieldOffset(0x21B58)] public CreditItemInfo itemInfos__arr1327;
        [FieldOffset(0x21BC0)] public CreditItemInfo itemInfos__arr1328;
        [FieldOffset(0x21C28)] public CreditItemInfo itemInfos__arr1329;
        [FieldOffset(0x21C90)] public CreditItemInfo itemInfos__arr1330;
        [FieldOffset(0x21CF8)] public CreditItemInfo itemInfos__arr1331;
        [FieldOffset(0x21D60)] public CreditItemInfo itemInfos__arr1332;
        [FieldOffset(0x21DC8)] public CreditItemInfo itemInfos__arr1333;
        [FieldOffset(0x21E30)] public CreditItemInfo itemInfos__arr1334;
        [FieldOffset(0x21E98)] public CreditItemInfo itemInfos__arr1335;
        [FieldOffset(0x21F00)] public CreditItemInfo itemInfos__arr1336;
        [FieldOffset(0x21F68)] public CreditItemInfo itemInfos__arr1337;
        [FieldOffset(0x21FD0)] public CreditItemInfo itemInfos__arr1338;
        [FieldOffset(0x22038)] public CreditItemInfo itemInfos__arr1339;
        [FieldOffset(0x220A0)] public CreditItemInfo itemInfos__arr1340;
        [FieldOffset(0x22108)] public CreditItemInfo itemInfos__arr1341;
        [FieldOffset(0x22170)] public CreditItemInfo itemInfos__arr1342;
        [FieldOffset(0x221D8)] public CreditItemInfo itemInfos__arr1343;
        [FieldOffset(0x22240)] public CreditItemInfo itemInfos__arr1344;
        [FieldOffset(0x222A8)] public CreditItemInfo itemInfos__arr1345;
        [FieldOffset(0x22310)] public CreditItemInfo itemInfos__arr1346;
        [FieldOffset(0x22378)] public CreditItemInfo itemInfos__arr1347;
        [FieldOffset(0x223E0)] public CreditItemInfo itemInfos__arr1348;
        [FieldOffset(0x22448)] public CreditItemInfo itemInfos__arr1349;
        [FieldOffset(0x224B0)] public CreditItemInfo itemInfos__arr1350;
        [FieldOffset(0x22518)] public CreditItemInfo itemInfos__arr1351;
        [FieldOffset(0x22580)] public CreditItemInfo itemInfos__arr1352;
        [FieldOffset(0x225E8)] public CreditItemInfo itemInfos__arr1353;
        [FieldOffset(0x22650)] public CreditItemInfo itemInfos__arr1354;
        [FieldOffset(0x226B8)] public CreditItemInfo itemInfos__arr1355;
        [FieldOffset(0x22720)] public CreditItemInfo itemInfos__arr1356;
        [FieldOffset(0x22788)] public CreditItemInfo itemInfos__arr1357;
        [FieldOffset(0x227F0)] public CreditItemInfo itemInfos__arr1358;
        [FieldOffset(0x22858)] public CreditItemInfo itemInfos__arr1359;
        [FieldOffset(0x228C0)] public CreditItemInfo itemInfos__arr1360;
        [FieldOffset(0x22928)] public CreditItemInfo itemInfos__arr1361;
        [FieldOffset(0x22990)] public CreditItemInfo itemInfos__arr1362;
        [FieldOffset(0x229F8)] public CreditItemInfo itemInfos__arr1363;
        [FieldOffset(0x22A60)] public CreditItemInfo itemInfos__arr1364;
        [FieldOffset(0x22AC8)] public CreditItemInfo itemInfos__arr1365;
        [FieldOffset(0x22B30)] public CreditItemInfo itemInfos__arr1366;
        [FieldOffset(0x22B98)] public CreditItemInfo itemInfos__arr1367;
        [FieldOffset(0x22C00)] public CreditItemInfo itemInfos__arr1368;
        [FieldOffset(0x22C68)] public CreditItemInfo itemInfos__arr1369;
        [FieldOffset(0x22CD0)] public CreditItemInfo itemInfos__arr1370;
        [FieldOffset(0x22D38)] public CreditItemInfo itemInfos__arr1371;
        [FieldOffset(0x22DA0)] public CreditItemInfo itemInfos__arr1372;
        [FieldOffset(0x22E08)] public CreditItemInfo itemInfos__arr1373;
        [FieldOffset(0x22E70)] public CreditItemInfo itemInfos__arr1374;
        [FieldOffset(0x22ED8)] public CreditItemInfo itemInfos__arr1375;
        [FieldOffset(0x22F40)] public CreditItemInfo itemInfos__arr1376;
        [FieldOffset(0x22FA8)] public CreditItemInfo itemInfos__arr1377;
        [FieldOffset(0x23010)] public CreditItemInfo itemInfos__arr1378;
        [FieldOffset(0x23078)] public CreditItemInfo itemInfos__arr1379;
        [FieldOffset(0x230E0)] public CreditItemInfo itemInfos__arr1380;
        [FieldOffset(0x23148)] public CreditItemInfo itemInfos__arr1381;
        [FieldOffset(0x231B0)] public CreditItemInfo itemInfos__arr1382;
        [FieldOffset(0x23218)] public CreditItemInfo itemInfos__arr1383;
        [FieldOffset(0x23280)] public CreditItemInfo itemInfos__arr1384;
        [FieldOffset(0x232E8)] public CreditItemInfo itemInfos__arr1385;
        [FieldOffset(0x23350)] public CreditItemInfo itemInfos__arr1386;
        [FieldOffset(0x233B8)] public CreditItemInfo itemInfos__arr1387;
        [FieldOffset(0x23420)] public CreditItemInfo itemInfos__arr1388;
        [FieldOffset(0x23488)] public CreditItemInfo itemInfos__arr1389;
        [FieldOffset(0x234F0)] public CreditItemInfo itemInfos__arr1390;
        [FieldOffset(0x23558)] public CreditItemInfo itemInfos__arr1391;
        [FieldOffset(0x235C0)] public CreditItemInfo itemInfos__arr1392;
        [FieldOffset(0x23628)] public CreditItemInfo itemInfos__arr1393;
        [FieldOffset(0x23690)] public CreditItemInfo itemInfos__arr1394;
        [FieldOffset(0x236F8)] public CreditItemInfo itemInfos__arr1395;
        [FieldOffset(0x23760)] public CreditItemInfo itemInfos__arr1396;
        [FieldOffset(0x237C8)] public CreditItemInfo itemInfos__arr1397;
        [FieldOffset(0x23830)] public CreditItemInfo itemInfos__arr1398;
        [FieldOffset(0x23898)] public CreditItemInfo itemInfos__arr1399;
        [FieldOffset(0x23900)] public CreditItemInfo itemInfos__arr1400;
        [FieldOffset(0x23968)] public CreditItemInfo itemInfos__arr1401;
        [FieldOffset(0x239D0)] public CreditItemInfo itemInfos__arr1402;
        [FieldOffset(0x23A38)] public CreditItemInfo itemInfos__arr1403;
        [FieldOffset(0x23AA0)] public CreditItemInfo itemInfos__arr1404;
        [FieldOffset(0x23B08)] public CreditItemInfo itemInfos__arr1405;
        [FieldOffset(0x23B70)] public CreditItemInfo itemInfos__arr1406;
        [FieldOffset(0x23BD8)] public CreditItemInfo itemInfos__arr1407;
        [FieldOffset(0x23C40)] public CreditItemInfo itemInfos__arr1408;
        [FieldOffset(0x23CA8)] public CreditItemInfo itemInfos__arr1409;
        [FieldOffset(0x23D10)] public CreditItemInfo itemInfos__arr1410;
        [FieldOffset(0x23D78)] public CreditItemInfo itemInfos__arr1411;
        [FieldOffset(0x23DE0)] public CreditItemInfo itemInfos__arr1412;
        [FieldOffset(0x23E48)] public CreditItemInfo itemInfos__arr1413;
        [FieldOffset(0x23EB0)] public CreditItemInfo itemInfos__arr1414;
        [FieldOffset(0x23F18)] public CreditItemInfo itemInfos__arr1415;
        [FieldOffset(0x23F80)] public CreditItemInfo itemInfos__arr1416;
        [FieldOffset(0x23FE8)] public CreditItemInfo itemInfos__arr1417;
        [FieldOffset(0x24050)] public CreditItemInfo itemInfos__arr1418;
        [FieldOffset(0x240B8)] public CreditItemInfo itemInfos__arr1419;
        [FieldOffset(0x24120)] public CreditItemInfo itemInfos__arr1420;
        [FieldOffset(0x24188)] public CreditItemInfo itemInfos__arr1421;
        [FieldOffset(0x241F0)] public CreditItemInfo itemInfos__arr1422;
        [FieldOffset(0x24258)] public CreditItemInfo itemInfos__arr1423;
        [FieldOffset(0x242C0)] public CreditItemInfo itemInfos__arr1424;
        [FieldOffset(0x24328)] public CreditItemInfo itemInfos__arr1425;
        [FieldOffset(0x24390)] public CreditItemInfo itemInfos__arr1426;
        [FieldOffset(0x243F8)] public CreditItemInfo itemInfos__arr1427;
        [FieldOffset(0x24460)] public CreditItemInfo itemInfos__arr1428;
        [FieldOffset(0x244C8)] public CreditItemInfo itemInfos__arr1429;
        [FieldOffset(0x24530)] public CreditItemInfo itemInfos__arr1430;
        [FieldOffset(0x24598)] public CreditItemInfo itemInfos__arr1431;
        [FieldOffset(0x24600)] public CreditItemInfo itemInfos__arr1432;
        [FieldOffset(0x24668)] public CreditItemInfo itemInfos__arr1433;
        [FieldOffset(0x246D0)] public CreditItemInfo itemInfos__arr1434;
        [FieldOffset(0x24738)] public CreditItemInfo itemInfos__arr1435;
        [FieldOffset(0x247A0)] public CreditItemInfo itemInfos__arr1436;
        [FieldOffset(0x24808)] public CreditItemInfo itemInfos__arr1437;
        [FieldOffset(0x24870)] public CreditItemInfo itemInfos__arr1438;
        [FieldOffset(0x248D8)] public CreditItemInfo itemInfos__arr1439;
        [FieldOffset(0x24940)] public CreditItemInfo itemInfos__arr1440;
        [FieldOffset(0x249A8)] public CreditItemInfo itemInfos__arr1441;
        [FieldOffset(0x24A10)] public CreditItemInfo itemInfos__arr1442;
        [FieldOffset(0x24A78)] public CreditItemInfo itemInfos__arr1443;
        [FieldOffset(0x24AE0)] public CreditItemInfo itemInfos__arr1444;
        [FieldOffset(0x24B48)] public CreditItemInfo itemInfos__arr1445;
        [FieldOffset(0x24BB0)] public CreditItemInfo itemInfos__arr1446;
        [FieldOffset(0x24C18)] public CreditItemInfo itemInfos__arr1447;
        [FieldOffset(0x24C80)] public CreditItemInfo itemInfos__arr1448;
        [FieldOffset(0x24CE8)] public CreditItemInfo itemInfos__arr1449;
        [FieldOffset(0x24D50)] public CreditItemInfo itemInfos__arr1450;
        [FieldOffset(0x24DB8)] public CreditItemInfo itemInfos__arr1451;
        [FieldOffset(0x24E20)] public CreditItemInfo itemInfos__arr1452;
        [FieldOffset(0x24E88)] public CreditItemInfo itemInfos__arr1453;
        [FieldOffset(0x24EF0)] public CreditItemInfo itemInfos__arr1454;
        [FieldOffset(0x24F58)] public CreditItemInfo itemInfos__arr1455;
        [FieldOffset(0x24FC0)] public CreditItemInfo itemInfos__arr1456;
        [FieldOffset(0x25028)] public CreditItemInfo itemInfos__arr1457;
        [FieldOffset(0x25090)] public CreditItemInfo itemInfos__arr1458;
        [FieldOffset(0x250F8)] public CreditItemInfo itemInfos__arr1459;
        [FieldOffset(0x25160)] public CreditItemInfo itemInfos__arr1460;
        [FieldOffset(0x251C8)] public CreditItemInfo itemInfos__arr1461;
        [FieldOffset(0x25230)] public CreditItemInfo itemInfos__arr1462;
        [FieldOffset(0x25298)] public CreditItemInfo itemInfos__arr1463;
        [FieldOffset(0x25300)] public CreditItemInfo itemInfos__arr1464;
        [FieldOffset(0x25368)] public CreditItemInfo itemInfos__arr1465;
        [FieldOffset(0x253D0)] public CreditItemInfo itemInfos__arr1466;
        [FieldOffset(0x25438)] public CreditItemInfo itemInfos__arr1467;
        [FieldOffset(0x254A0)] public CreditItemInfo itemInfos__arr1468;
        [FieldOffset(0x25508)] public CreditItemInfo itemInfos__arr1469;
        [FieldOffset(0x25570)] public CreditItemInfo itemInfos__arr1470;
        [FieldOffset(0x255D8)] public CreditItemInfo itemInfos__arr1471;
        [FieldOffset(0x25640)] public CreditItemInfo itemInfos__arr1472;
        [FieldOffset(0x256A8)] public CreditItemInfo itemInfos__arr1473;
        [FieldOffset(0x25710)] public CreditItemInfo itemInfos__arr1474;
        [FieldOffset(0x25778)] public CreditItemInfo itemInfos__arr1475;
        [FieldOffset(0x257E0)] public CreditItemInfo itemInfos__arr1476;
        [FieldOffset(0x25848)] public CreditItemInfo itemInfos__arr1477;
        [FieldOffset(0x258B0)] public CreditItemInfo itemInfos__arr1478;
        [FieldOffset(0x25918)] public CreditItemInfo itemInfos__arr1479;
        [FieldOffset(0x25980)] public CreditItemInfo itemInfos__arr1480;
        [FieldOffset(0x259E8)] public CreditItemInfo itemInfos__arr1481;
        [FieldOffset(0x25A50)] public CreditItemInfo itemInfos__arr1482;
        [FieldOffset(0x25AB8)] public CreditItemInfo itemInfos__arr1483;
        [FieldOffset(0x25B20)] public CreditItemInfo itemInfos__arr1484;
        [FieldOffset(0x25B88)] public CreditItemInfo itemInfos__arr1485;
        [FieldOffset(0x25BF0)] public CreditItemInfo itemInfos__arr1486;
        [FieldOffset(0x25C58)] public CreditItemInfo itemInfos__arr1487;
        [FieldOffset(0x25CC0)] public CreditItemInfo itemInfos__arr1488;
        [FieldOffset(0x25D28)] public CreditItemInfo itemInfos__arr1489;
        [FieldOffset(0x25D90)] public CreditItemInfo itemInfos__arr1490;
        [FieldOffset(0x25DF8)] public CreditItemInfo itemInfos__arr1491;
        [FieldOffset(0x25E60)] public CreditItemInfo itemInfos__arr1492;
        [FieldOffset(0x25EC8)] public CreditItemInfo itemInfos__arr1493;
        [FieldOffset(0x25F30)] public CreditItemInfo itemInfos__arr1494;
        [FieldOffset(0x25F98)] public CreditItemInfo itemInfos__arr1495;
        [FieldOffset(0x26000)] public CreditItemInfo itemInfos__arr1496;
        [FieldOffset(0x26068)] public CreditItemInfo itemInfos__arr1497;
        [FieldOffset(0x260D0)] public CreditItemInfo itemInfos__arr1498;
        [FieldOffset(0x26138)] public CreditItemInfo itemInfos__arr1499;
        [FieldOffset(0x261A0)] public CreditItemInfo itemInfos__arr1500;
        [FieldOffset(0x26208)] public CreditItemInfo itemInfos__arr1501;
        [FieldOffset(0x26270)] public CreditItemInfo itemInfos__arr1502;
        [FieldOffset(0x262D8)] public CreditItemInfo itemInfos__arr1503;
        [FieldOffset(0x26340)] public CreditItemInfo itemInfos__arr1504;
        [FieldOffset(0x263A8)] public CreditItemInfo itemInfos__arr1505;
        [FieldOffset(0x26410)] public CreditItemInfo itemInfos__arr1506;
        [FieldOffset(0x26478)] public CreditItemInfo itemInfos__arr1507;
        [FieldOffset(0x264E0)] public CreditItemInfo itemInfos__arr1508;
        [FieldOffset(0x26548)] public CreditItemInfo itemInfos__arr1509;
        [FieldOffset(0x265B0)] public CreditItemInfo itemInfos__arr1510;
        [FieldOffset(0x26618)] public CreditItemInfo itemInfos__arr1511;
        [FieldOffset(0x26680)] public CreditItemInfo itemInfos__arr1512;
        [FieldOffset(0x266E8)] public CreditItemInfo itemInfos__arr1513;
        [FieldOffset(0x26750)] public CreditItemInfo itemInfos__arr1514;
        [FieldOffset(0x267B8)] public CreditItemInfo itemInfos__arr1515;
        [FieldOffset(0x26820)] public CreditItemInfo itemInfos__arr1516;
        [FieldOffset(0x26888)] public CreditItemInfo itemInfos__arr1517;
        [FieldOffset(0x268F0)] public CreditItemInfo itemInfos__arr1518;
        [FieldOffset(0x26958)] public CreditItemInfo itemInfos__arr1519;
        [FieldOffset(0x269C0)] public CreditItemInfo itemInfos__arr1520;
        [FieldOffset(0x26A28)] public CreditItemInfo itemInfos__arr1521;
        [FieldOffset(0x26A90)] public CreditItemInfo itemInfos__arr1522;
        [FieldOffset(0x26AF8)] public CreditItemInfo itemInfos__arr1523;
        [FieldOffset(0x26B60)] public CreditItemInfo itemInfos__arr1524;
        [FieldOffset(0x26BC8)] public CreditItemInfo itemInfos__arr1525;
        [FieldOffset(0x26C30)] public CreditItemInfo itemInfos__arr1526;
        [FieldOffset(0x26C98)] public CreditItemInfo itemInfos__arr1527;
        [FieldOffset(0x26D00)] public CreditItemInfo itemInfos__arr1528;
        [FieldOffset(0x26D68)] public CreditItemInfo itemInfos__arr1529;
        [FieldOffset(0x26DD0)] public CreditItemInfo itemInfos__arr1530;
        [FieldOffset(0x26E38)] public CreditItemInfo itemInfos__arr1531;
        [FieldOffset(0x26EA0)] public CreditItemInfo itemInfos__arr1532;
        [FieldOffset(0x26F08)] public CreditItemInfo itemInfos__arr1533;
        [FieldOffset(0x26F70)] public CreditItemInfo itemInfos__arr1534;
        [FieldOffset(0x26FD8)] public CreditItemInfo itemInfos__arr1535;
        [FieldOffset(0x27040)] public CreditItemInfo itemInfos__arr1536;
        [FieldOffset(0x270A8)] public CreditItemInfo itemInfos__arr1537;
        [FieldOffset(0x27110)] public CreditItemInfo itemInfos__arr1538;
        [FieldOffset(0x27178)] public CreditItemInfo itemInfos__arr1539;
        [FieldOffset(0x271E0)] public CreditItemInfo itemInfos__arr1540;
        [FieldOffset(0x27248)] public CreditItemInfo itemInfos__arr1541;
        [FieldOffset(0x272B0)] public CreditItemInfo itemInfos__arr1542;
        [FieldOffset(0x27318)] public CreditItemInfo itemInfos__arr1543;
        [FieldOffset(0x27380)] public CreditItemInfo itemInfos__arr1544;
        [FieldOffset(0x273E8)] public CreditItemInfo itemInfos__arr1545;
        [FieldOffset(0x27450)] public CreditItemInfo itemInfos__arr1546;
        [FieldOffset(0x274B8)] public CreditItemInfo itemInfos__arr1547;
        [FieldOffset(0x27520)] public CreditItemInfo itemInfos__arr1548;
        [FieldOffset(0x27588)] public CreditItemInfo itemInfos__arr1549;
        [FieldOffset(0x275F0)] public CreditItemInfo itemInfos__arr1550;
        [FieldOffset(0x27658)] public CreditItemInfo itemInfos__arr1551;
        [FieldOffset(0x276C0)] public CreditItemInfo itemInfos__arr1552;
        [FieldOffset(0x27728)] public CreditItemInfo itemInfos__arr1553;
        [FieldOffset(0x27790)] public CreditItemInfo itemInfos__arr1554;
        [FieldOffset(0x277F8)] public CreditItemInfo itemInfos__arr1555;
        [FieldOffset(0x27860)] public CreditItemInfo itemInfos__arr1556;
        [FieldOffset(0x278C8)] public CreditItemInfo itemInfos__arr1557;
        [FieldOffset(0x27930)] public CreditItemInfo itemInfos__arr1558;
        [FieldOffset(0x27998)] public CreditItemInfo itemInfos__arr1559;
        [FieldOffset(0x27A00)] public CreditItemInfo itemInfos__arr1560;
        [FieldOffset(0x27A68)] public CreditItemInfo itemInfos__arr1561;
        [FieldOffset(0x27AD0)] public CreditItemInfo itemInfos__arr1562;
        [FieldOffset(0x27B38)] public CreditItemInfo itemInfos__arr1563;
        [FieldOffset(0x27BA0)] public CreditItemInfo itemInfos__arr1564;
        [FieldOffset(0x27C08)] public CreditItemInfo itemInfos__arr1565;
        [FieldOffset(0x27C70)] public CreditItemInfo itemInfos__arr1566;
        [FieldOffset(0x27CD8)] public CreditItemInfo itemInfos__arr1567;
        [FieldOffset(0x27D40)] public CreditItemInfo itemInfos__arr1568;
        [FieldOffset(0x27DA8)] public CreditItemInfo itemInfos__arr1569;
        [FieldOffset(0x27E10)] public CreditItemInfo itemInfos__arr1570;
        [FieldOffset(0x27E78)] public CreditItemInfo itemInfos__arr1571;
        [FieldOffset(0x27EE0)] public CreditItemInfo itemInfos__arr1572;
        [FieldOffset(0x27F48)] public CreditItemInfo itemInfos__arr1573;
        [FieldOffset(0x27FB0)] public CreditItemInfo itemInfos__arr1574;
        [FieldOffset(0x28018)] public CreditItemInfo itemInfos__arr1575;
        [FieldOffset(0x28080)] public CreditItemInfo itemInfos__arr1576;
        [FieldOffset(0x280E8)] public CreditItemInfo itemInfos__arr1577;
        [FieldOffset(0x28150)] public CreditItemInfo itemInfos__arr1578;
        [FieldOffset(0x281B8)] public CreditItemInfo itemInfos__arr1579;
        [FieldOffset(0x28220)] public CreditItemInfo itemInfos__arr1580;
        [FieldOffset(0x28288)] public CreditItemInfo itemInfos__arr1581;
        [FieldOffset(0x282F0)] public CreditItemInfo itemInfos__arr1582;
        [FieldOffset(0x28358)] public CreditItemInfo itemInfos__arr1583;
        [FieldOffset(0x283C0)] public CreditItemInfo itemInfos__arr1584;
        [FieldOffset(0x28428)] public CreditItemInfo itemInfos__arr1585;
        [FieldOffset(0x28490)] public CreditItemInfo itemInfos__arr1586;
        [FieldOffset(0x284F8)] public CreditItemInfo itemInfos__arr1587;
        [FieldOffset(0x28560)] public CreditItemInfo itemInfos__arr1588;
        [FieldOffset(0x285C8)] public CreditItemInfo itemInfos__arr1589;
        [FieldOffset(0x28630)] public CreditItemInfo itemInfos__arr1590;
        [FieldOffset(0x28698)] public CreditItemInfo itemInfos__arr1591;
        [FieldOffset(0x28700)] public CreditItemInfo itemInfos__arr1592;
        [FieldOffset(0x28768)] public CreditItemInfo itemInfos__arr1593;
        [FieldOffset(0x287D0)] public CreditItemInfo itemInfos__arr1594;
        [FieldOffset(0x28838)] public CreditItemInfo itemInfos__arr1595;
        [FieldOffset(0x288A0)] public CreditItemInfo itemInfos__arr1596;
        [FieldOffset(0x28908)] public CreditItemInfo itemInfos__arr1597;
        [FieldOffset(0x28970)] public CreditItemInfo itemInfos__arr1598;
        [FieldOffset(0x289D8)] public CreditItemInfo itemInfos__arr1599;
        [FieldOffset(0x28A40)] public CreditItemInfo itemInfos__arr1600;
        [FieldOffset(0x28AA8)] public CreditItemInfo itemInfos__arr1601;
        [FieldOffset(0x28B10)] public CreditItemInfo itemInfos__arr1602;
        [FieldOffset(0x28B78)] public CreditItemInfo itemInfos__arr1603;
        [FieldOffset(0x28BE0)] public CreditItemInfo itemInfos__arr1604;
        [FieldOffset(0x28C48)] public CreditItemInfo itemInfos__arr1605;
        [FieldOffset(0x28CB0)] public CreditItemInfo itemInfos__arr1606;
        [FieldOffset(0x28D18)] public CreditItemInfo itemInfos__arr1607;
        [FieldOffset(0x28D80)] public CreditItemInfo itemInfos__arr1608;
        [FieldOffset(0x28DE8)] public CreditItemInfo itemInfos__arr1609;
        [FieldOffset(0x28E50)] public CreditItemInfo itemInfos__arr1610;
        [FieldOffset(0x28EB8)] public CreditItemInfo itemInfos__arr1611;
        [FieldOffset(0x28F20)] public CreditItemInfo itemInfos__arr1612;
        [FieldOffset(0x28F88)] public CreditItemInfo itemInfos__arr1613;
        [FieldOffset(0x28FF0)] public CreditItemInfo itemInfos__arr1614;
        [FieldOffset(0x29058)] public CreditItemInfo itemInfos__arr1615;
        [FieldOffset(0x290C0)] public CreditItemInfo itemInfos__arr1616;
        [FieldOffset(0x29128)] public CreditItemInfo itemInfos__arr1617;
        [FieldOffset(0x29190)] public CreditItemInfo itemInfos__arr1618;
        [FieldOffset(0x291F8)] public CreditItemInfo itemInfos__arr1619;
        [FieldOffset(0x29260)] public CreditItemInfo itemInfos__arr1620;
        [FieldOffset(0x292C8)] public CreditItemInfo itemInfos__arr1621;
        [FieldOffset(0x29330)] public CreditItemInfo itemInfos__arr1622;
        [FieldOffset(0x29398)] public CreditItemInfo itemInfos__arr1623;
        [FieldOffset(0x29400)] public CreditItemInfo itemInfos__arr1624;
        [FieldOffset(0x29468)] public CreditItemInfo itemInfos__arr1625;
        [FieldOffset(0x294D0)] public CreditItemInfo itemInfos__arr1626;
        [FieldOffset(0x29538)] public CreditItemInfo itemInfos__arr1627;
        [FieldOffset(0x295A0)] public CreditItemInfo itemInfos__arr1628;
        [FieldOffset(0x29608)] public CreditItemInfo itemInfos__arr1629;
        [FieldOffset(0x29670)] public CreditItemInfo itemInfos__arr1630;
        [FieldOffset(0x296D8)] public CreditItemInfo itemInfos__arr1631;
        [FieldOffset(0x29740)] public CreditItemInfo itemInfos__arr1632;
        [FieldOffset(0x297A8)] public CreditItemInfo itemInfos__arr1633;
        [FieldOffset(0x29810)] public CreditItemInfo itemInfos__arr1634;
        [FieldOffset(0x29878)] public CreditItemInfo itemInfos__arr1635;
        [FieldOffset(0x298E0)] public CreditItemInfo itemInfos__arr1636;
        [FieldOffset(0x29948)] public CreditItemInfo itemInfos__arr1637;
        [FieldOffset(0x299B0)] public CreditItemInfo itemInfos__arr1638;
        [FieldOffset(0x29A18)] public CreditItemInfo itemInfos__arr1639;
        [FieldOffset(0x29A80)] public CreditItemInfo itemInfos__arr1640;
        [FieldOffset(0x29AE8)] public CreditItemInfo itemInfos__arr1641;
        [FieldOffset(0x29B50)] public CreditItemInfo itemInfos__arr1642;
        [FieldOffset(0x29BB8)] public CreditItemInfo itemInfos__arr1643;
        [FieldOffset(0x29C20)] public CreditItemInfo itemInfos__arr1644;
        [FieldOffset(0x29C88)] public CreditItemInfo itemInfos__arr1645;
        [FieldOffset(0x29CF0)] public CreditItemInfo itemInfos__arr1646;
        [FieldOffset(0x29D58)] public CreditItemInfo itemInfos__arr1647;
        [FieldOffset(0x29DC0)] public CreditItemInfo itemInfos__arr1648;
        [FieldOffset(0x29E28)] public CreditItemInfo itemInfos__arr1649;
        [FieldOffset(0x29E90)] public CreditItemInfo itemInfos__arr1650;
        [FieldOffset(0x29EF8)] public CreditItemInfo itemInfos__arr1651;
        [FieldOffset(0x29F60)] public CreditItemInfo itemInfos__arr1652;
        [FieldOffset(0x29FC8)] public CreditItemInfo itemInfos__arr1653;
        [FieldOffset(0x2A030)] public CreditItemInfo itemInfos__arr1654;
        [FieldOffset(0x2A098)] public CreditItemInfo itemInfos__arr1655;
        [FieldOffset(0x2A100)] public CreditItemInfo itemInfos__arr1656;
        [FieldOffset(0x2A168)] public CreditItemInfo itemInfos__arr1657;
        [FieldOffset(0x2A1D0)] public CreditItemInfo itemInfos__arr1658;
        [FieldOffset(0x2A238)] public CreditItemInfo itemInfos__arr1659;
        [FieldOffset(0x2A2A0)] public CreditItemInfo itemInfos__arr1660;
        [FieldOffset(0x2A308)] public CreditItemInfo itemInfos__arr1661;
        [FieldOffset(0x2A370)] public CreditItemInfo itemInfos__arr1662;
        [FieldOffset(0x2A3D8)] public CreditItemInfo itemInfos__arr1663;
        [FieldOffset(0x2A440)] public CreditItemInfo itemInfos__arr1664;
        [FieldOffset(0x2A4A8)] public CreditItemInfo itemInfos__arr1665;
        [FieldOffset(0x2A510)] public CreditItemInfo itemInfos__arr1666;
        [FieldOffset(0x2A578)] public CreditItemInfo itemInfos__arr1667;
        [FieldOffset(0x2A5E0)] public CreditItemInfo itemInfos__arr1668;
        [FieldOffset(0x2A648)] public CreditItemInfo itemInfos__arr1669;
        [FieldOffset(0x2A6B0)] public CreditItemInfo itemInfos__arr1670;
        [FieldOffset(0x2A718)] public CreditItemInfo itemInfos__arr1671;
        [FieldOffset(0x2A780)] public CreditItemInfo itemInfos__arr1672;
        [FieldOffset(0x2A7E8)] public CreditItemInfo itemInfos__arr1673;
        [FieldOffset(0x2A850)] public CreditItemInfo itemInfos__arr1674;
        [FieldOffset(0x2A8B8)] public CreditItemInfo itemInfos__arr1675;
        [FieldOffset(0x2A920)] public CreditItemInfo itemInfos__arr1676;
        [FieldOffset(0x2A988)] public CreditItemInfo itemInfos__arr1677;
        [FieldOffset(0x2A9F0)] public CreditItemInfo itemInfos__arr1678;
        [FieldOffset(0x2AA58)] public CreditItemInfo itemInfos__arr1679;
        [FieldOffset(0x2AAC0)] public CreditItemInfo itemInfos__arr1680;
        [FieldOffset(0x2AB28)] public CreditItemInfo itemInfos__arr1681;
        [FieldOffset(0x2AB90)] public CreditItemInfo itemInfos__arr1682;
        [FieldOffset(0x2ABF8)] public CreditItemInfo itemInfos__arr1683;
        [FieldOffset(0x2AC60)] public CreditItemInfo itemInfos__arr1684;
        [FieldOffset(0x2ACC8)] public CreditItemInfo itemInfos__arr1685;
        [FieldOffset(0x2AD30)] public CreditItemInfo itemInfos__arr1686;
        [FieldOffset(0x2AD98)] public CreditItemInfo itemInfos__arr1687;
        [FieldOffset(0x2AE00)] public CreditItemInfo itemInfos__arr1688;
        [FieldOffset(0x2AE68)] public CreditItemInfo itemInfos__arr1689;
        [FieldOffset(0x2AED0)] public CreditItemInfo itemInfos__arr1690;
        [FieldOffset(0x2AF38)] public CreditItemInfo itemInfos__arr1691;
        [FieldOffset(0x2AFA0)] public CreditItemInfo itemInfos__arr1692;
        [FieldOffset(0x2B008)] public CreditItemInfo itemInfos__arr1693;
        [FieldOffset(0x2B070)] public CreditItemInfo itemInfos__arr1694;
        [FieldOffset(0x2B0D8)] public CreditItemInfo itemInfos__arr1695;
        [FieldOffset(0x2B140)] public CreditItemInfo itemInfos__arr1696;
        [FieldOffset(0x2B1A8)] public CreditItemInfo itemInfos__arr1697;
        [FieldOffset(0x2B210)] public CreditItemInfo itemInfos__arr1698;
        [FieldOffset(0x2B278)] public CreditItemInfo itemInfos__arr1699;
        [FieldOffset(0x2B2E0)] public CreditItemInfo itemInfos__arr1700;
        [FieldOffset(0x2B348)] public CreditItemInfo itemInfos__arr1701;
        [FieldOffset(0x2B3B0)] public CreditItemInfo itemInfos__arr1702;
        [FieldOffset(0x2B418)] public CreditItemInfo itemInfos__arr1703;
        [FieldOffset(0x2B480)] public CreditItemInfo itemInfos__arr1704;
        [FieldOffset(0x2B4E8)] public CreditItemInfo itemInfos__arr1705;
        [FieldOffset(0x2B550)] public CreditItemInfo itemInfos__arr1706;
        [FieldOffset(0x2B5B8)] public CreditItemInfo itemInfos__arr1707;
        [FieldOffset(0x2B620)] public CreditItemInfo itemInfos__arr1708;
        [FieldOffset(0x2B688)] public CreditItemInfo itemInfos__arr1709;
        [FieldOffset(0x2B6F0)] public CreditItemInfo itemInfos__arr1710;
        [FieldOffset(0x2B758)] public CreditItemInfo itemInfos__arr1711;
        [FieldOffset(0x2B7C0)] public CreditItemInfo itemInfos__arr1712;
        [FieldOffset(0x2B828)] public CreditItemInfo itemInfos__arr1713;
        [FieldOffset(0x2B890)] public CreditItemInfo itemInfos__arr1714;
        [FieldOffset(0x2B8F8)] public CreditItemInfo itemInfos__arr1715;
        [FieldOffset(0x2B960)] public CreditItemInfo itemInfos__arr1716;
        [FieldOffset(0x2B9C8)] public CreditItemInfo itemInfos__arr1717;
        [FieldOffset(0x2BA30)] public CreditItemInfo itemInfos__arr1718;
        [FieldOffset(0x2BA98)] public CreditItemInfo itemInfos__arr1719;
        [FieldOffset(0x2BB00)] public CreditItemInfo itemInfos__arr1720;
        [FieldOffset(0x2BB68)] public CreditItemInfo itemInfos__arr1721;
        [FieldOffset(0x2BBD0)] public CreditItemInfo itemInfos__arr1722;
        [FieldOffset(0x2BC38)] public CreditItemInfo itemInfos__arr1723;
        [FieldOffset(0x2BCA0)] public CreditItemInfo itemInfos__arr1724;
        [FieldOffset(0x2BD08)] public CreditItemInfo itemInfos__arr1725;
        [FieldOffset(0x2BD70)] public CreditItemInfo itemInfos__arr1726;
        [FieldOffset(0x2BDD8)] public CreditItemInfo itemInfos__arr1727;
        [FieldOffset(0x2BE40)] public CreditItemInfo itemInfos__arr1728;
        [FieldOffset(0x2BEA8)] public CreditItemInfo itemInfos__arr1729;
        [FieldOffset(0x2BF10)] public CreditItemInfo itemInfos__arr1730;
        [FieldOffset(0x2BF78)] public CreditItemInfo itemInfos__arr1731;
        [FieldOffset(0x2BFE0)] public CreditItemInfo itemInfos__arr1732;
        [FieldOffset(0x2C048)] public CreditItemInfo itemInfos__arr1733;
        [FieldOffset(0x2C0B0)] public CreditItemInfo itemInfos__arr1734;
        [FieldOffset(0x2C118)] public CreditItemInfo itemInfos__arr1735;
        [FieldOffset(0x2C180)] public CreditItemInfo itemInfos__arr1736;
        [FieldOffset(0x2C1E8)] public CreditItemInfo itemInfos__arr1737;
        [FieldOffset(0x2C250)] public CreditItemInfo itemInfos__arr1738;
        [FieldOffset(0x2C2B8)] public CreditItemInfo itemInfos__arr1739;
        [FieldOffset(0x2C320)] public CreditItemInfo itemInfos__arr1740;
        [FieldOffset(0x2C388)] public CreditItemInfo itemInfos__arr1741;
        [FieldOffset(0x2C3F0)] public CreditItemInfo itemInfos__arr1742;
        [FieldOffset(0x2C458)] public CreditItemInfo itemInfos__arr1743;
        [FieldOffset(0x2C4C0)] public CreditItemInfo itemInfos__arr1744;
        [FieldOffset(0x2C528)] public CreditItemInfo itemInfos__arr1745;
        [FieldOffset(0x2C590)] public CreditItemInfo itemInfos__arr1746;
        [FieldOffset(0x2C5F8)] public CreditItemInfo itemInfos__arr1747;
        [FieldOffset(0x2C660)] public CreditItemInfo itemInfos__arr1748;
        [FieldOffset(0x2C6C8)] public CreditItemInfo itemInfos__arr1749;
        [FieldOffset(0x2C730)] public CreditItemInfo itemInfos__arr1750;
        [FieldOffset(0x2C798)] public CreditItemInfo itemInfos__arr1751;
        [FieldOffset(0x2C800)] public CreditItemInfo itemInfos__arr1752;
        [FieldOffset(0x2C868)] public CreditItemInfo itemInfos__arr1753;
        [FieldOffset(0x2C8D0)] public CreditItemInfo itemInfos__arr1754;
        [FieldOffset(0x2C938)] public CreditItemInfo itemInfos__arr1755;
        [FieldOffset(0x2C9A0)] public CreditItemInfo itemInfos__arr1756;
        [FieldOffset(0x2CA08)] public CreditItemInfo itemInfos__arr1757;
        [FieldOffset(0x2CA70)] public CreditItemInfo itemInfos__arr1758;
        [FieldOffset(0x2CAD8)] public CreditItemInfo itemInfos__arr1759;
        [FieldOffset(0x2CB40)] public CreditItemInfo itemInfos__arr1760;
        [FieldOffset(0x2CBA8)] public CreditItemInfo itemInfos__arr1761;
        [FieldOffset(0x2CC10)] public CreditItemInfo itemInfos__arr1762;
        [FieldOffset(0x2CC78)] public CreditItemInfo itemInfos__arr1763;
        [FieldOffset(0x2CCE0)] public CreditItemInfo itemInfos__arr1764;
        [FieldOffset(0x2CD48)] public CreditItemInfo itemInfos__arr1765;
        [FieldOffset(0x2CDB0)] public CreditItemInfo itemInfos__arr1766;
        [FieldOffset(0x2CE18)] public CreditItemInfo itemInfos__arr1767;
        [FieldOffset(0x2CE80)] public CreditItemInfo itemInfos__arr1768;
        [FieldOffset(0x2CEE8)] public CreditItemInfo itemInfos__arr1769;
        [FieldOffset(0x2CF50)] public CreditItemInfo itemInfos__arr1770;
        [FieldOffset(0x2CFB8)] public CreditItemInfo itemInfos__arr1771;
        [FieldOffset(0x2D020)] public CreditItemInfo itemInfos__arr1772;
        [FieldOffset(0x2D088)] public CreditItemInfo itemInfos__arr1773;
        [FieldOffset(0x2D0F0)] public CreditItemInfo itemInfos__arr1774;
        [FieldOffset(0x2D158)] public CreditItemInfo itemInfos__arr1775;
        [FieldOffset(0x2D1C0)] public CreditItemInfo itemInfos__arr1776;
        [FieldOffset(0x2D228)] public CreditItemInfo itemInfos__arr1777;
        [FieldOffset(0x2D290)] public CreditItemInfo itemInfos__arr1778;
        [FieldOffset(0x2D2F8)] public CreditItemInfo itemInfos__arr1779;
        [FieldOffset(0x2D360)] public CreditItemInfo itemInfos__arr1780;
        [FieldOffset(0x2D3C8)] public CreditItemInfo itemInfos__arr1781;
        [FieldOffset(0x2D430)] public CreditItemInfo itemInfos__arr1782;
        [FieldOffset(0x2D498)] public CreditItemInfo itemInfos__arr1783;
        [FieldOffset(0x2D500)] public CreditItemInfo itemInfos__arr1784;
        [FieldOffset(0x2D568)] public CreditItemInfo itemInfos__arr1785;
        [FieldOffset(0x2D5D0)] public CreditItemInfo itemInfos__arr1786;
        [FieldOffset(0x2D638)] public CreditItemInfo itemInfos__arr1787;
        [FieldOffset(0x2D6A0)] public CreditItemInfo itemInfos__arr1788;
        [FieldOffset(0x2D708)] public CreditItemInfo itemInfos__arr1789;
        [FieldOffset(0x2D770)] public CreditItemInfo itemInfos__arr1790;
        [FieldOffset(0x2D7D8)] public CreditItemInfo itemInfos__arr1791;
        [FieldOffset(0x2D840)] public CreditItemInfo itemInfos__arr1792;
        [FieldOffset(0x2D8A8)] public CreditItemInfo itemInfos__arr1793;
        [FieldOffset(0x2D910)] public CreditItemInfo itemInfos__arr1794;
        [FieldOffset(0x2D978)] public CreditItemInfo itemInfos__arr1795;
        [FieldOffset(0x2D9E0)] public CreditItemInfo itemInfos__arr1796;
        [FieldOffset(0x2DA48)] public CreditItemInfo itemInfos__arr1797;
        [FieldOffset(0x2DAB0)] public CreditItemInfo itemInfos__arr1798;
        [FieldOffset(0x2DB18)] public CreditItemInfo itemInfos__arr1799;
        [FieldOffset(0x2DB80)] public CreditItemInfo itemInfos__arr1800;
        [FieldOffset(0x2DBE8)] public CreditItemInfo itemInfos__arr1801;
        [FieldOffset(0x2DC50)] public CreditItemInfo itemInfos__arr1802;
        [FieldOffset(0x2DCB8)] public CreditItemInfo itemInfos__arr1803;
        [FieldOffset(0x2DD20)] public CreditItemInfo itemInfos__arr1804;
        [FieldOffset(0x2DD88)] public CreditItemInfo itemInfos__arr1805;
        [FieldOffset(0x2DDF0)] public CreditItemInfo itemInfos__arr1806;
        [FieldOffset(0x2DE58)] public CreditItemInfo itemInfos__arr1807;
        [FieldOffset(0x2DEC0)] public CreditItemInfo itemInfos__arr1808;
        [FieldOffset(0x2DF28)] public CreditItemInfo itemInfos__arr1809;
        [FieldOffset(0x2DF90)] public CreditItemInfo itemInfos__arr1810;
        [FieldOffset(0x2DFF8)] public CreditItemInfo itemInfos__arr1811;
        [FieldOffset(0x2E060)] public CreditItemInfo itemInfos__arr1812;
        [FieldOffset(0x2E0C8)] public CreditItemInfo itemInfos__arr1813;
        [FieldOffset(0x2E130)] public CreditItemInfo itemInfos__arr1814;
        [FieldOffset(0x2E198)] public CreditItemInfo itemInfos__arr1815;
        [FieldOffset(0x2E200)] public CreditItemInfo itemInfos__arr1816;
        [FieldOffset(0x2E268)] public CreditItemInfo itemInfos__arr1817;
        [FieldOffset(0x2E2D0)] public CreditItemInfo itemInfos__arr1818;
        [FieldOffset(0x2E338)] public CreditItemInfo itemInfos__arr1819;
        [FieldOffset(0x2E3A0)] public CreditItemInfo itemInfos__arr1820;
        [FieldOffset(0x2E408)] public CreditItemInfo itemInfos__arr1821;
        [FieldOffset(0x2E470)] public CreditItemInfo itemInfos__arr1822;
        [FieldOffset(0x2E4D8)] public CreditItemInfo itemInfos__arr1823;
        [FieldOffset(0x2E540)] public CreditItemInfo itemInfos__arr1824;
        [FieldOffset(0x2E5A8)] public CreditItemInfo itemInfos__arr1825;
        [FieldOffset(0x2E610)] public CreditItemInfo itemInfos__arr1826;
        [FieldOffset(0x2E678)] public CreditItemInfo itemInfos__arr1827;
        [FieldOffset(0x2E6E0)] public CreditItemInfo itemInfos__arr1828;
        [FieldOffset(0x2E748)] public CreditItemInfo itemInfos__arr1829;
        [FieldOffset(0x2E7B0)] public CreditItemInfo itemInfos__arr1830;
        [FieldOffset(0x2E818)] public CreditItemInfo itemInfos__arr1831;
        [FieldOffset(0x2E880)] public CreditItemInfo itemInfos__arr1832;
        [FieldOffset(0x2E8E8)] public CreditItemInfo itemInfos__arr1833;
        [FieldOffset(0x2E950)] public CreditItemInfo itemInfos__arr1834;
        [FieldOffset(0x2E9B8)] public CreditItemInfo itemInfos__arr1835;
        [FieldOffset(0x2EA20)] public CreditItemInfo itemInfos__arr1836;
        [FieldOffset(0x2EA88)] public CreditItemInfo itemInfos__arr1837;
        [FieldOffset(0x2EAF0)] public CreditItemInfo itemInfos__arr1838;
        [FieldOffset(0x2EB58)] public CreditItemInfo itemInfos__arr1839;
        [FieldOffset(0x2EBC0)] public CreditItemInfo itemInfos__arr1840;
        [FieldOffset(0x2EC28)] public CreditItemInfo itemInfos__arr1841;
        [FieldOffset(0x2EC90)] public CreditItemInfo itemInfos__arr1842;
        [FieldOffset(0x2ECF8)] public CreditItemInfo itemInfos__arr1843;
        [FieldOffset(0x2ED60)] public CreditItemInfo itemInfos__arr1844;
        [FieldOffset(0x2EDC8)] public CreditItemInfo itemInfos__arr1845;
        [FieldOffset(0x2EE30)] public CreditItemInfo itemInfos__arr1846;
        [FieldOffset(0x2EE98)] public CreditItemInfo itemInfos__arr1847;
        [FieldOffset(0x2EF00)] public CreditItemInfo itemInfos__arr1848;
        [FieldOffset(0x2EF68)] public CreditItemInfo itemInfos__arr1849;
        [FieldOffset(0x2EFD0)] public CreditItemInfo itemInfos__arr1850;
        [FieldOffset(0x2F038)] public CreditItemInfo itemInfos__arr1851;
        [FieldOffset(0x2F0A0)] public CreditItemInfo itemInfos__arr1852;
        [FieldOffset(0x2F108)] public CreditItemInfo itemInfos__arr1853;
        [FieldOffset(0x2F170)] public CreditItemInfo itemInfos__arr1854;
        [FieldOffset(0x2F1D8)] public CreditItemInfo itemInfos__arr1855;
        [FieldOffset(0x2F240)] public CreditItemInfo itemInfos__arr1856;
        [FieldOffset(0x2F2A8)] public CreditItemInfo itemInfos__arr1857;
        [FieldOffset(0x2F310)] public CreditItemInfo itemInfos__arr1858;
        [FieldOffset(0x2F378)] public CreditItemInfo itemInfos__arr1859;
        [FieldOffset(0x2F3E0)] public CreditItemInfo itemInfos__arr1860;
        [FieldOffset(0x2F448)] public CreditItemInfo itemInfos__arr1861;
        [FieldOffset(0x2F4B0)] public CreditItemInfo itemInfos__arr1862;
        [FieldOffset(0x2F518)] public CreditItemInfo itemInfos__arr1863;
        [FieldOffset(0x2F580)] public CreditItemInfo itemInfos__arr1864;
        [FieldOffset(0x2F5E8)] public CreditItemInfo itemInfos__arr1865;
        [FieldOffset(0x2F650)] public CreditItemInfo itemInfos__arr1866;
        [FieldOffset(0x2F6B8)] public CreditItemInfo itemInfos__arr1867;
        [FieldOffset(0x2F720)] public CreditItemInfo itemInfos__arr1868;
        [FieldOffset(0x2F788)] public CreditItemInfo itemInfos__arr1869;
        [FieldOffset(0x2F7F0)] public CreditItemInfo itemInfos__arr1870;
        [FieldOffset(0x2F858)] public CreditItemInfo itemInfos__arr1871;
        [FieldOffset(0x2F8C0)] public CreditItemInfo itemInfos__arr1872;
        [FieldOffset(0x2F928)] public CreditItemInfo itemInfos__arr1873;
        [FieldOffset(0x2F990)] public CreditItemInfo itemInfos__arr1874;
        [FieldOffset(0x2F9F8)] public CreditItemInfo itemInfos__arr1875;
        [FieldOffset(0x2FA60)] public CreditItemInfo itemInfos__arr1876;
        [FieldOffset(0x2FAC8)] public CreditItemInfo itemInfos__arr1877;
        [FieldOffset(0x2FB30)] public CreditItemInfo itemInfos__arr1878;
        [FieldOffset(0x2FB98)] public CreditItemInfo itemInfos__arr1879;
        [FieldOffset(0x2FC00)] public CreditItemInfo itemInfos__arr1880;
        [FieldOffset(0x2FC68)] public CreditItemInfo itemInfos__arr1881;
        [FieldOffset(0x2FCD0)] public CreditItemInfo itemInfos__arr1882;
        [FieldOffset(0x2FD38)] public CreditItemInfo itemInfos__arr1883;
        [FieldOffset(0x2FDA0)] public CreditItemInfo itemInfos__arr1884;
        [FieldOffset(0x2FE08)] public CreditItemInfo itemInfos__arr1885;
        [FieldOffset(0x2FE70)] public CreditItemInfo itemInfos__arr1886;
        [FieldOffset(0x2FED8)] public CreditItemInfo itemInfos__arr1887;
        [FieldOffset(0x2FF40)] public CreditItemInfo itemInfos__arr1888;
        [FieldOffset(0x2FFA8)] public CreditItemInfo itemInfos__arr1889;
        [FieldOffset(0x30010)] public CreditItemInfo itemInfos__arr1890;
        [FieldOffset(0x30078)] public CreditItemInfo itemInfos__arr1891;
        [FieldOffset(0x300E0)] public CreditItemInfo itemInfos__arr1892;
        [FieldOffset(0x30148)] public CreditItemInfo itemInfos__arr1893;
        [FieldOffset(0x301B0)] public CreditItemInfo itemInfos__arr1894;
        [FieldOffset(0x30218)] public CreditItemInfo itemInfos__arr1895;
        [FieldOffset(0x30280)] public CreditItemInfo itemInfos__arr1896;
        [FieldOffset(0x302E8)] public CreditItemInfo itemInfos__arr1897;
        [FieldOffset(0x30350)] public CreditItemInfo itemInfos__arr1898;
        [FieldOffset(0x303B8)] public CreditItemInfo itemInfos__arr1899;
        [FieldOffset(0x30420)] public CreditItemInfo itemInfos__arr1900;
        [FieldOffset(0x30488)] public CreditItemInfo itemInfos__arr1901;
        [FieldOffset(0x304F0)] public CreditItemInfo itemInfos__arr1902;
        [FieldOffset(0x30558)] public CreditItemInfo itemInfos__arr1903;
        [FieldOffset(0x305C0)] public CreditItemInfo itemInfos__arr1904;
        [FieldOffset(0x30628)] public CreditItemInfo itemInfos__arr1905;
        [FieldOffset(0x30690)] public CreditItemInfo itemInfos__arr1906;
        [FieldOffset(0x306F8)] public CreditItemInfo itemInfos__arr1907;
        [FieldOffset(0x30760)] public CreditItemInfo itemInfos__arr1908;
        [FieldOffset(0x307C8)] public CreditItemInfo itemInfos__arr1909;
        [FieldOffset(0x30830)] public CreditItemInfo itemInfos__arr1910;
        [FieldOffset(0x30898)] public CreditItemInfo itemInfos__arr1911;
        [FieldOffset(0x30900)] public CreditItemInfo itemInfos__arr1912;
        [FieldOffset(0x30968)] public CreditItemInfo itemInfos__arr1913;
        [FieldOffset(0x309D0)] public CreditItemInfo itemInfos__arr1914;
        [FieldOffset(0x30A38)] public CreditItemInfo itemInfos__arr1915;
        [FieldOffset(0x30AA0)] public CreditItemInfo itemInfos__arr1916;
        [FieldOffset(0x30B08)] public CreditItemInfo itemInfos__arr1917;
        [FieldOffset(0x30B70)] public CreditItemInfo itemInfos__arr1918;
        [FieldOffset(0x30BD8)] public CreditItemInfo itemInfos__arr1919;
        [FieldOffset(0x30C40)] public CreditItemInfo itemInfos__arr1920;
        [FieldOffset(0x30CA8)] public CreditItemInfo itemInfos__arr1921;
        [FieldOffset(0x30D10)] public CreditItemInfo itemInfos__arr1922;
        [FieldOffset(0x30D78)] public CreditItemInfo itemInfos__arr1923;
        [FieldOffset(0x30DE0)] public CreditItemInfo itemInfos__arr1924;
        [FieldOffset(0x30E48)] public CreditItemInfo itemInfos__arr1925;
        [FieldOffset(0x30EB0)] public CreditItemInfo itemInfos__arr1926;
        [FieldOffset(0x30F18)] public CreditItemInfo itemInfos__arr1927;
        [FieldOffset(0x30F80)] public CreditItemInfo itemInfos__arr1928;
        [FieldOffset(0x30FE8)] public CreditItemInfo itemInfos__arr1929;
        [FieldOffset(0x31050)] public CreditItemInfo itemInfos__arr1930;
        [FieldOffset(0x310B8)] public CreditItemInfo itemInfos__arr1931;
        [FieldOffset(0x31120)] public CreditItemInfo itemInfos__arr1932;
        [FieldOffset(0x31188)] public CreditItemInfo itemInfos__arr1933;
        [FieldOffset(0x311F0)] public CreditItemInfo itemInfos__arr1934;
        [FieldOffset(0x31258)] public CreditItemInfo itemInfos__arr1935;
        [FieldOffset(0x312C0)] public CreditItemInfo itemInfos__arr1936;
        [FieldOffset(0x31328)] public CreditItemInfo itemInfos__arr1937;
        [FieldOffset(0x31390)] public CreditItemInfo itemInfos__arr1938;
        [FieldOffset(0x313F8)] public CreditItemInfo itemInfos__arr1939;
        [FieldOffset(0x31460)] public CreditItemInfo itemInfos__arr1940;
        [FieldOffset(0x314C8)] public CreditItemInfo itemInfos__arr1941;
        [FieldOffset(0x31530)] public CreditItemInfo itemInfos__arr1942;
        [FieldOffset(0x31598)] public CreditItemInfo itemInfos__arr1943;
        [FieldOffset(0x31600)] public CreditItemInfo itemInfos__arr1944;
        [FieldOffset(0x31668)] public CreditItemInfo itemInfos__arr1945;
        [FieldOffset(0x316D0)] public CreditItemInfo itemInfos__arr1946;
        [FieldOffset(0x31738)] public CreditItemInfo itemInfos__arr1947;
        [FieldOffset(0x317A0)] public CreditItemInfo itemInfos__arr1948;
        [FieldOffset(0x31808)] public CreditItemInfo itemInfos__arr1949;
        [FieldOffset(0x31870)] public CreditItemInfo itemInfos__arr1950;
        [FieldOffset(0x318D8)] public CreditItemInfo itemInfos__arr1951;
        [FieldOffset(0x31940)] public CreditItemInfo itemInfos__arr1952;
        [FieldOffset(0x319A8)] public CreditItemInfo itemInfos__arr1953;
        [FieldOffset(0x31A10)] public CreditItemInfo itemInfos__arr1954;
        [FieldOffset(0x31A78)] public CreditItemInfo itemInfos__arr1955;
        [FieldOffset(0x31AE0)] public CreditItemInfo itemInfos__arr1956;
        [FieldOffset(0x31B48)] public CreditItemInfo itemInfos__arr1957;
        [FieldOffset(0x31BB0)] public CreditItemInfo itemInfos__arr1958;
        [FieldOffset(0x31C18)] public CreditItemInfo itemInfos__arr1959;
        [FieldOffset(0x31C80)] public CreditItemInfo itemInfos__arr1960;
        [FieldOffset(0x31CE8)] public CreditItemInfo itemInfos__arr1961;
        [FieldOffset(0x31D50)] public CreditItemInfo itemInfos__arr1962;
        [FieldOffset(0x31DB8)] public CreditItemInfo itemInfos__arr1963;
        [FieldOffset(0x31E20)] public CreditItemInfo itemInfos__arr1964;
        [FieldOffset(0x31E88)] public CreditItemInfo itemInfos__arr1965;
        [FieldOffset(0x31EF0)] public CreditItemInfo itemInfos__arr1966;
        [FieldOffset(0x31F58)] public CreditItemInfo itemInfos__arr1967;
        [FieldOffset(0x31FC0)] public CreditItemInfo itemInfos__arr1968;
        [FieldOffset(0x32028)] public CreditItemInfo itemInfos__arr1969;
        [FieldOffset(0x32090)] public CreditItemInfo itemInfos__arr1970;
        [FieldOffset(0x320F8)] public CreditItemInfo itemInfos__arr1971;
        [FieldOffset(0x32160)] public CreditItemInfo itemInfos__arr1972;
        [FieldOffset(0x321C8)] public CreditItemInfo itemInfos__arr1973;
        [FieldOffset(0x32230)] public CreditItemInfo itemInfos__arr1974;
        [FieldOffset(0x32298)] public CreditItemInfo itemInfos__arr1975;
        [FieldOffset(0x32300)] public CreditItemInfo itemInfos__arr1976;
        [FieldOffset(0x32368)] public CreditItemInfo itemInfos__arr1977;
        [FieldOffset(0x323D0)] public CreditItemInfo itemInfos__arr1978;
        [FieldOffset(0x32438)] public CreditItemInfo itemInfos__arr1979;
        [FieldOffset(0x324A0)] public CreditItemInfo itemInfos__arr1980;
        [FieldOffset(0x32508)] public CreditItemInfo itemInfos__arr1981;
        [FieldOffset(0x32570)] public CreditItemInfo itemInfos__arr1982;
        [FieldOffset(0x325D8)] public CreditItemInfo itemInfos__arr1983;
        [FieldOffset(0x32640)] public CreditItemInfo itemInfos__arr1984;
        [FieldOffset(0x326A8)] public CreditItemInfo itemInfos__arr1985;
        [FieldOffset(0x32710)] public CreditItemInfo itemInfos__arr1986;
        [FieldOffset(0x32778)] public CreditItemInfo itemInfos__arr1987;
        [FieldOffset(0x327E0)] public CreditItemInfo itemInfos__arr1988;
        [FieldOffset(0x32848)] public CreditItemInfo itemInfos__arr1989;
        [FieldOffset(0x328B0)] public CreditItemInfo itemInfos__arr1990;
        [FieldOffset(0x32918)] public CreditItemInfo itemInfos__arr1991;
        [FieldOffset(0x32980)] public CreditItemInfo itemInfos__arr1992;
        [FieldOffset(0x329E8)] public CreditItemInfo itemInfos__arr1993;
        [FieldOffset(0x32A50)] public CreditItemInfo itemInfos__arr1994;
        [FieldOffset(0x32AB8)] public CreditItemInfo itemInfos__arr1995;
        [FieldOffset(0x32B20)] public CreditItemInfo itemInfos__arr1996;
        [FieldOffset(0x32B88)] public CreditItemInfo itemInfos__arr1997;
        [FieldOffset(0x32BF0)] public CreditItemInfo itemInfos__arr1998;
        [FieldOffset(0x32C58)] public CreditItemInfo itemInfos__arr1999;
        [FieldOffset(0x32CC0)] public CreditItemInfo itemInfos__arr2000;
        [FieldOffset(0x32D28)] public CreditItemInfo itemInfos__arr2001;
        [FieldOffset(0x32D90)] public CreditItemInfo itemInfos__arr2002;
        [FieldOffset(0x32DF8)] public CreditItemInfo itemInfos__arr2003;
        [FieldOffset(0x32E60)] public CreditItemInfo itemInfos__arr2004;
        [FieldOffset(0x32EC8)] public CreditItemInfo itemInfos__arr2005;
        [FieldOffset(0x32F30)] public CreditItemInfo itemInfos__arr2006;
        [FieldOffset(0x32F98)] public CreditItemInfo itemInfos__arr2007;
        [FieldOffset(0x33000)] public CreditItemInfo itemInfos__arr2008;
        [FieldOffset(0x33068)] public CreditItemInfo itemInfos__arr2009;
        [FieldOffset(0x330D0)] public CreditItemInfo itemInfos__arr2010;
        [FieldOffset(0x33138)] public CreditItemInfo itemInfos__arr2011;
        [FieldOffset(0x331A0)] public CreditItemInfo itemInfos__arr2012;
        [FieldOffset(0x33208)] public CreditItemInfo itemInfos__arr2013;
        [FieldOffset(0x33270)] public CreditItemInfo itemInfos__arr2014;
        [FieldOffset(0x332D8)] public CreditItemInfo itemInfos__arr2015;
        [FieldOffset(0x33340)] public CreditItemInfo itemInfos__arr2016;
        [FieldOffset(0x333A8)] public CreditItemInfo itemInfos__arr2017;
        [FieldOffset(0x33410)] public CreditItemInfo itemInfos__arr2018;
        [FieldOffset(0x33478)] public CreditItemInfo itemInfos__arr2019;
        [FieldOffset(0x334E0)] public CreditItemInfo itemInfos__arr2020;
        [FieldOffset(0x33548)] public CreditItemInfo itemInfos__arr2021;
        [FieldOffset(0x335B0)] public CreditItemInfo itemInfos__arr2022;
        [FieldOffset(0x33618)] public CreditItemInfo itemInfos__arr2023;
        [FieldOffset(0x33680)] public CreditItemInfo itemInfos__arr2024;
        [FieldOffset(0x336E8)] public CreditItemInfo itemInfos__arr2025;
        [FieldOffset(0x33750)] public CreditItemInfo itemInfos__arr2026;
        [FieldOffset(0x337B8)] public CreditItemInfo itemInfos__arr2027;
        [FieldOffset(0x33820)] public CreditItemInfo itemInfos__arr2028;
        [FieldOffset(0x33888)] public CreditItemInfo itemInfos__arr2029;
        [FieldOffset(0x338F0)] public CreditItemInfo itemInfos__arr2030;
        [FieldOffset(0x33958)] public CreditItemInfo itemInfos__arr2031;
        [FieldOffset(0x339C0)] public CreditItemInfo itemInfos__arr2032;
        [FieldOffset(0x33A28)] public CreditItemInfo itemInfos__arr2033;
        [FieldOffset(0x33A90)] public CreditItemInfo itemInfos__arr2034;
        [FieldOffset(0x33AF8)] public CreditItemInfo itemInfos__arr2035;
        [FieldOffset(0x33B60)] public CreditItemInfo itemInfos__arr2036;
        [FieldOffset(0x33BC8)] public CreditItemInfo itemInfos__arr2037;
        [FieldOffset(0x33C30)] public CreditItemInfo itemInfos__arr2038;
        [FieldOffset(0x33C98)] public CreditItemInfo itemInfos__arr2039;
        [FieldOffset(0x33D00)] public CreditItemInfo itemInfos__arr2040;
        [FieldOffset(0x33D68)] public CreditItemInfo itemInfos__arr2041;
        [FieldOffset(0x33DD0)] public CreditItemInfo itemInfos__arr2042;
        [FieldOffset(0x33E38)] public CreditItemInfo itemInfos__arr2043;
        [FieldOffset(0x33EA0)] public CreditItemInfo itemInfos__arr2044;
        [FieldOffset(0x33F08)] public CreditItemInfo itemInfos__arr2045;
        [FieldOffset(0x33F70)] public CreditItemInfo itemInfos__arr2046;
        [FieldOffset(0x33FD8)] public CreditItemInfo itemInfos__arr2047;
        [FieldOffset(0x34040)] public CreditBGInfo bgInfos__arr0;
        [FieldOffset(0x34058)] public CreditBGInfo bgInfos__arr1;
        [FieldOffset(0x34070)] public CreditBGInfo bgInfos__arr2;
        [FieldOffset(0x34088)] public CreditBGInfo bgInfos__arr3;
        [FieldOffset(0x340A0)] public CreditBGInfo bgInfos__arr4;
        [FieldOffset(0x340B8)] public CreditBGInfo bgInfos__arr5;
        [FieldOffset(0x340D0)] public CreditBGInfo bgInfos__arr6;
        [FieldOffset(0x340E8)] public CreditBGInfo bgInfos__arr7;
        [FieldOffset(0x34100)] public CreditBGInfo bgInfos__arr8;
        [FieldOffset(0x34118)] public CreditBGInfo bgInfos__arr9;
    }

}