Library "GameData"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    public enum Status : sbyte
    {
        STATUS_ZERO_FILL = 0,
        STATUS_INITIALIZED = 1
    }

    public enum Sequence : sbyte
    {
        NewGame = 0,
        DSpearTutorialAfter = 1,
        FinalBossBefore = 2,
        FinalBossAfter = 3
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct HeaderData
    {
        [FieldOffset(0x00)] public uint signature;
        [FieldOffset(0x04)] public byte version;
        [FieldOffset(0x05)] public Status status;
        [FieldOffset(0x06)] public byte config;
        [FieldOffset(0x07)] public Sequence sequence;
        [FieldOffset(0x08)] public uint playTime;
        [FieldOffset(0x0C)] public byte reserved0;
        [FieldOffset(0x0E)] public ushort reserved1;
        [FieldOffset(0x10)] public long saveDate;
        [FieldOffset(0x18)] public byte index;
        [FieldOffset(0x1C)] public uint reserved__arr0;
        [FieldOffset(0x20)] public uint reserved__arr1;
        [FieldOffset(0x24)] public uint reserved__arr2;
        [FieldOffset(0x28)] public uint reserved__arr3;
    }

    public enum GamePlayData_Status : sbyte
    {
        STATUS_NEWGAME = 0,
        STATUS_CONTINUE = 1
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct GamePlayData
    {
        [FieldOffset(0x00)] public GamePlayData_Status status;
        [FieldOffset(0x01)] public sbyte lastPlayedStageNo;
        [FieldOffset(0x02)] public byte flags;
        [FieldOffset(0x10)] public Vector3 position;
        [FieldOffset(0x20)] public Quaternion rotation;
        [FieldOffset(0x30)] public uint day;
        [FieldOffset(0x34)] public uint hour;
        [FieldOffset(0x38)] public uint minute;
        [FieldOffset(0x3C)] public float second;
        [FieldOffset(0x40)] public uint reserved__arr0;
        [FieldOffset(0x44)] public uint reserved__arr1;
        [FieldOffset(0x48)] public uint reserved__arr2;
        [FieldOffset(0x4C)] public uint reserved__arr3;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x28)]
    public struct CharacterData
    {
        [FieldOffset(0x00)] public ushort numRings;
        [FieldOffset(0x02)] public byte numBossGateKey__arr0;
        [FieldOffset(0x03)] public byte numBossGateKey__arr1;
        [FieldOffset(0x04)] public byte numBossGateKey__arr2;
        [FieldOffset(0x05)] public byte numBossGateKey__arr3;
        [FieldOffset(0x06)] public byte numBossGateKey__arr4;
        [FieldOffset(0x07)] public byte numRocketParts;
        [FieldOffset(0x08)] public byte numDgear__arr0;
        [FieldOffset(0x09)] public byte numDgear__arr1;
        [FieldOffset(0x0A)] public byte numDgear__arr2;
        [FieldOffset(0x0B)] public byte numDgear__arr3;
        [FieldOffset(0x0C)] public byte numDgear__arr4;
        [FieldOffset(0x0D)] public byte numTreasureChestGear__arr0;
        [FieldOffset(0x0E)] public byte numTreasureChestGear__arr1;
        [FieldOffset(0x0F)] public byte numTreasureChestGear__arr2;
        [FieldOffset(0x10)] public byte hasDpower__arr0;
        [FieldOffset(0x11)] public byte hasDpower__arr1;
        [FieldOffset(0x12)] public byte hasDpower__arr2;
        [FieldOffset(0x13)] public byte hasDpower__arr3;
        [FieldOffset(0x14)] public byte hasDpower__arr4;
        [FieldOffset(0x18)] public uint flags;
        [FieldOffset(0x1C)] public uint reserved__arr0;
        [FieldOffset(0x20)] public uint reserved__arr1;
        [FieldOffset(0x24)] public uint reserved__arr2;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct WhitespaceStageData
    {
        [FieldOffset(0x00)] public Vector3 destination;
        [FieldOffset(0x10)] public uint flags;
        [FieldOffset(0x14)] public uint reserved__arr0;
        [FieldOffset(0x18)] public uint reserved__arr1;
        [FieldOffset(0x1C)] public uint reserved__arr2;
        [FieldOffset(0x20)] public uint reserved__arr3;
    }

    public enum RankType : byte
    {
        RANK_S = 0,
        RANK_A = 1,
        RANK_B = 2,
        RANK_C = 3,
        RANK_D = 4,
        RANK_NUM = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x44)]
    public struct StageData
    {
        [FieldOffset(0x00)] public ushort flags;
        [FieldOffset(0x04)] public uint bestScore;
        [FieldOffset(0x08)] public uint bestScoreDwing;
        [FieldOffset(0x0C)] public uint bestRing;
        [FieldOffset(0x10)] public uint bestRingDwing;
        [FieldOffset(0x14)] public uint bestTime__arr0;
        [FieldOffset(0x18)] public uint bestTime__arr1;
        [FieldOffset(0x1C)] public uint bestTime__arr2;
        [FieldOffset(0x20)] public uint bestTimeDwing__arr0;
        [FieldOffset(0x24)] public uint bestTimeDwing__arr1;
        [FieldOffset(0x28)] public uint bestTimeDwing__arr2;
        [FieldOffset(0x2C)] public RankType bestRank;
        [FieldOffset(0x2D)] public RankType bestRankDwing;
        [FieldOffset(0x2E)] public short bgmId;
        [FieldOffset(0x30)] public byte numBossGateKey;
        [FieldOffset(0x31)] public sbyte collectionGearDatas__arr0;
        [FieldOffset(0x32)] public sbyte collectionGearDatas__arr1;
        [FieldOffset(0x33)] public sbyte collectionGearDatas__arr2;
        [FieldOffset(0x34)] public uint reserved__arr0;
        [FieldOffset(0x38)] public uint reserved__arr1;
        [FieldOffset(0x3C)] public uint reserved__arr2;
        [FieldOffset(0x40)] public uint reserved__arr3;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xD48)]
    public struct StageContainerData
    {
        [FieldOffset(0x00)] public StageData stages__arr0;
        [FieldOffset(0x44)] public StageData stages__arr1;
        [FieldOffset(0x88)] public StageData stages__arr2;
        [FieldOffset(0xCC)] public StageData stages__arr3;
        [FieldOffset(0x110)] public StageData stages__arr4;
        [FieldOffset(0x154)] public StageData stages__arr5;
        [FieldOffset(0x198)] public StageData stages__arr6;
        [FieldOffset(0x1DC)] public StageData stages__arr7;
        [FieldOffset(0x220)] public StageData stages__arr8;
        [FieldOffset(0x264)] public StageData stages__arr9;
        [FieldOffset(0x2A8)] public StageData stages__arr10;
        [FieldOffset(0x2EC)] public StageData stages__arr11;
        [FieldOffset(0x330)] public StageData stages__arr12;
        [FieldOffset(0x374)] public StageData stages__arr13;
        [FieldOffset(0x3B8)] public StageData stages__arr14;
        [FieldOffset(0x3FC)] public StageData stages__arr15;
        [FieldOffset(0x440)] public StageData stages__arr16;
        [FieldOffset(0x484)] public StageData stages__arr17;
        [FieldOffset(0x4C8)] public StageData stages__arr18;
        [FieldOffset(0x50C)] public StageData stages__arr19;
        [FieldOffset(0x550)] public StageData stages__arr20;
        [FieldOffset(0x594)] public StageData stages__arr21;
        [FieldOffset(0x5D8)] public StageData stages__arr22;
        [FieldOffset(0x61C)] public StageData stages__arr23;
        [FieldOffset(0x660)] public StageData stages__arr24;
        [FieldOffset(0x6A4)] public StageData stages__arr25;
        [FieldOffset(0x6E8)] public StageData stages__arr26;
        [FieldOffset(0x72C)] public StageData stages__arr27;
        [FieldOffset(0x770)] public StageData stages__arr28;
        [FieldOffset(0x7B4)] public StageData stages__arr29;
        [FieldOffset(0x7F8)] public StageData stages__arr30;
        [FieldOffset(0x83C)] public StageData stages__arr31;
        [FieldOffset(0x880)] public StageData stages__arr32;
        [FieldOffset(0x8C4)] public StageData stages__arr33;
        [FieldOffset(0x908)] public StageData stages__arr34;
        [FieldOffset(0x94C)] public StageData stages__arr35;
        [FieldOffset(0x990)] public StageData stages__arr36;
        [FieldOffset(0x9D4)] public StageData stages__arr37;
        [FieldOffset(0xA18)] public StageData stages__arr38;
        [FieldOffset(0xA5C)] public StageData stages__arr39;
        [FieldOffset(0xAA0)] public StageData stages__arr40;
        [FieldOffset(0xAE4)] public StageData stages__arr41;
        [FieldOffset(0xB28)] public StageData stages__arr42;
        [FieldOffset(0xB6C)] public StageData stages__arr43;
        [FieldOffset(0xBB0)] public StageData stages__arr44;
        [FieldOffset(0xBF4)] public StageData stages__arr45;
        [FieldOffset(0xC38)] public StageData stages__arr46;
        [FieldOffset(0xC7C)] public StageData stages__arr47;
        [FieldOffset(0xCC0)] public StageData stages__arr48;
        [FieldOffset(0xD04)] public StageData stages__arr49;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct UnlockData
    {
        [FieldOffset(0x00)] public byte flags;
        [FieldOffset(0x01)] public byte reserved__arr0;
        [FieldOffset(0x02)] public byte reserved__arr1;
        [FieldOffset(0x03)] public byte reserved__arr2;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x5A0)]
    public struct CollectionData
    {
        [FieldOffset(0x00)] public UnlockData artParam__arr0;
        [FieldOffset(0x04)] public UnlockData artParam__arr1;
        [FieldOffset(0x08)] public UnlockData artParam__arr2;
        [FieldOffset(0x0C)] public UnlockData artParam__arr3;
        [FieldOffset(0x10)] public UnlockData artParam__arr4;
        [FieldOffset(0x14)] public UnlockData artParam__arr5;
        [FieldOffset(0x18)] public UnlockData artParam__arr6;
        [FieldOffset(0x1C)] public UnlockData artParam__arr7;
        [FieldOffset(0x20)] public UnlockData artParam__arr8;
        [FieldOffset(0x24)] public UnlockData artParam__arr9;
        [FieldOffset(0x28)] public UnlockData artParam__arr10;
        [FieldOffset(0x2C)] public UnlockData artParam__arr11;
        [FieldOffset(0x30)] public UnlockData artParam__arr12;
        [FieldOffset(0x34)] public UnlockData artParam__arr13;
        [FieldOffset(0x38)] public UnlockData artParam__arr14;
        [FieldOffset(0x3C)] public UnlockData artParam__arr15;
        [FieldOffset(0x40)] public UnlockData artParam__arr16;
        [FieldOffset(0x44)] public UnlockData artParam__arr17;
        [FieldOffset(0x48)] public UnlockData artParam__arr18;
        [FieldOffset(0x4C)] public UnlockData artParam__arr19;
        [FieldOffset(0x50)] public UnlockData artParam__arr20;
        [FieldOffset(0x54)] public UnlockData artParam__arr21;
        [FieldOffset(0x58)] public UnlockData artParam__arr22;
        [FieldOffset(0x5C)] public UnlockData artParam__arr23;
        [FieldOffset(0x60)] public UnlockData artParam__arr24;
        [FieldOffset(0x64)] public UnlockData artParam__arr25;
        [FieldOffset(0x68)] public UnlockData artParam__arr26;
        [FieldOffset(0x6C)] public UnlockData artParam__arr27;
        [FieldOffset(0x70)] public UnlockData artParam__arr28;
        [FieldOffset(0x74)] public UnlockData artParam__arr29;
        [FieldOffset(0x78)] public UnlockData artParam__arr30;
        [FieldOffset(0x7C)] public UnlockData artParam__arr31;
        [FieldOffset(0x80)] public UnlockData artParam__arr32;
        [FieldOffset(0x84)] public UnlockData artParam__arr33;
        [FieldOffset(0x88)] public UnlockData artParam__arr34;
        [FieldOffset(0x8C)] public UnlockData artParam__arr35;
        [FieldOffset(0x90)] public UnlockData artParam__arr36;
        [FieldOffset(0x94)] public UnlockData artParam__arr37;
        [FieldOffset(0x98)] public UnlockData artParam__arr38;
        [FieldOffset(0x9C)] public UnlockData artParam__arr39;
        [FieldOffset(0xA0)] public UnlockData artParam__arr40;
        [FieldOffset(0xA4)] public UnlockData artParam__arr41;
        [FieldOffset(0xA8)] public UnlockData artParam__arr42;
        [FieldOffset(0xAC)] public UnlockData artParam__arr43;
        [FieldOffset(0xB0)] public UnlockData artParam__arr44;
        [FieldOffset(0xB4)] public UnlockData artParam__arr45;
        [FieldOffset(0xB8)] public UnlockData artParam__arr46;
        [FieldOffset(0xBC)] public UnlockData artParam__arr47;
        [FieldOffset(0xC0)] public UnlockData artParam__arr48;
        [FieldOffset(0xC4)] public UnlockData artParam__arr49;
        [FieldOffset(0xC8)] public UnlockData artParam__arr50;
        [FieldOffset(0xCC)] public UnlockData artParam__arr51;
        [FieldOffset(0xD0)] public UnlockData artParam__arr52;
        [FieldOffset(0xD4)] public UnlockData artParam__arr53;
        [FieldOffset(0xD8)] public UnlockData artParam__arr54;
        [FieldOffset(0xDC)] public UnlockData artParam__arr55;
        [FieldOffset(0xE0)] public UnlockData artParam__arr56;
        [FieldOffset(0xE4)] public UnlockData artParam__arr57;
        [FieldOffset(0xE8)] public UnlockData artParam__arr58;
        [FieldOffset(0xEC)] public UnlockData artParam__arr59;
        [FieldOffset(0xF0)] public UnlockData artParam__arr60;
        [FieldOffset(0xF4)] public UnlockData artParam__arr61;
        [FieldOffset(0xF8)] public UnlockData artParam__arr62;
        [FieldOffset(0xFC)] public UnlockData artParam__arr63;
        [FieldOffset(0x100)] public UnlockData artParam__arr64;
        [FieldOffset(0x104)] public UnlockData artParam__arr65;
        [FieldOffset(0x108)] public UnlockData artParam__arr66;
        [FieldOffset(0x10C)] public UnlockData artParam__arr67;
        [FieldOffset(0x110)] public UnlockData artParam__arr68;
        [FieldOffset(0x114)] public UnlockData artParam__arr69;
        [FieldOffset(0x118)] public UnlockData artParam__arr70;
        [FieldOffset(0x11C)] public UnlockData artParam__arr71;
        [FieldOffset(0x120)] public UnlockData artParam__arr72;
        [FieldOffset(0x124)] public UnlockData artParam__arr73;
        [FieldOffset(0x128)] public UnlockData artParam__arr74;
        [FieldOffset(0x12C)] public UnlockData artParam__arr75;
        [FieldOffset(0x130)] public UnlockData artParam__arr76;
        [FieldOffset(0x134)] public UnlockData artParam__arr77;
        [FieldOffset(0x138)] public UnlockData artParam__arr78;
        [FieldOffset(0x13C)] public UnlockData artParam__arr79;
        [FieldOffset(0x140)] public UnlockData artParam__arr80;
        [FieldOffset(0x144)] public UnlockData artParam__arr81;
        [FieldOffset(0x148)] public UnlockData artParam__arr82;
        [FieldOffset(0x14C)] public UnlockData artParam__arr83;
        [FieldOffset(0x150)] public UnlockData artParam__arr84;
        [FieldOffset(0x154)] public UnlockData artParam__arr85;
        [FieldOffset(0x158)] public UnlockData artParam__arr86;
        [FieldOffset(0x15C)] public UnlockData artParam__arr87;
        [FieldOffset(0x160)] public UnlockData artParam__arr88;
        [FieldOffset(0x164)] public UnlockData artParam__arr89;
        [FieldOffset(0x168)] public UnlockData artParam__arr90;
        [FieldOffset(0x16C)] public UnlockData artParam__arr91;
        [FieldOffset(0x170)] public UnlockData artParam__arr92;
        [FieldOffset(0x174)] public UnlockData artParam__arr93;
        [FieldOffset(0x178)] public UnlockData artParam__arr94;
        [FieldOffset(0x17C)] public UnlockData artParam__arr95;
        [FieldOffset(0x180)] public UnlockData artParam__arr96;
        [FieldOffset(0x184)] public UnlockData artParam__arr97;
        [FieldOffset(0x188)] public UnlockData artParam__arr98;
        [FieldOffset(0x18C)] public UnlockData artParam__arr99;
        [FieldOffset(0x190)] public UnlockData artParam__arr100;
        [FieldOffset(0x194)] public UnlockData artParam__arr101;
        [FieldOffset(0x198)] public UnlockData artParam__arr102;
        [FieldOffset(0x19C)] public UnlockData artParam__arr103;
        [FieldOffset(0x1A0)] public UnlockData artParam__arr104;
        [FieldOffset(0x1A4)] public UnlockData artParam__arr105;
        [FieldOffset(0x1A8)] public UnlockData artParam__arr106;
        [FieldOffset(0x1AC)] public UnlockData artParam__arr107;
        [FieldOffset(0x1B0)] public UnlockData artParam__arr108;
        [FieldOffset(0x1B4)] public UnlockData artParam__arr109;
        [FieldOffset(0x1B8)] public UnlockData artParam__arr110;
        [FieldOffset(0x1BC)] public UnlockData artParam__arr111;
        [FieldOffset(0x1C0)] public UnlockData artParam__arr112;
        [FieldOffset(0x1C4)] public UnlockData artParam__arr113;
        [FieldOffset(0x1C8)] public UnlockData artParam__arr114;
        [FieldOffset(0x1CC)] public UnlockData artParam__arr115;
        [FieldOffset(0x1D0)] public UnlockData artParam__arr116;
        [FieldOffset(0x1D4)] public UnlockData artParam__arr117;
        [FieldOffset(0x1D8)] public UnlockData artParam__arr118;
        [FieldOffset(0x1DC)] public UnlockData artParam__arr119;
        [FieldOffset(0x1E0)] public UnlockData artParam__arr120;
        [FieldOffset(0x1E4)] public UnlockData artParam__arr121;
        [FieldOffset(0x1E8)] public UnlockData artParam__arr122;
        [FieldOffset(0x1EC)] public UnlockData artParam__arr123;
        [FieldOffset(0x1F0)] public UnlockData artParam__arr124;
        [FieldOffset(0x1F4)] public UnlockData artParam__arr125;
        [FieldOffset(0x1F8)] public UnlockData artParam__arr126;
        [FieldOffset(0x1FC)] public UnlockData artParam__arr127;
        [FieldOffset(0x200)] public UnlockData artParam__arr128;
        [FieldOffset(0x204)] public UnlockData artParam__arr129;
        [FieldOffset(0x208)] public UnlockData artParam__arr130;
        [FieldOffset(0x20C)] public UnlockData artParam__arr131;
        [FieldOffset(0x210)] public UnlockData artParam__arr132;
        [FieldOffset(0x214)] public UnlockData artParam__arr133;
        [FieldOffset(0x218)] public UnlockData artParam__arr134;
        [FieldOffset(0x21C)] public UnlockData artParam__arr135;
        [FieldOffset(0x220)] public UnlockData artParam__arr136;
        [FieldOffset(0x224)] public UnlockData artParam__arr137;
        [FieldOffset(0x228)] public UnlockData artParam__arr138;
        [FieldOffset(0x22C)] public UnlockData artParam__arr139;
        [FieldOffset(0x230)] public UnlockData movieParam__arr0;
        [FieldOffset(0x234)] public UnlockData movieParam__arr1;
        [FieldOffset(0x238)] public UnlockData movieParam__arr2;
        [FieldOffset(0x23C)] public UnlockData movieParam__arr3;
        [FieldOffset(0x240)] public UnlockData movieParam__arr4;
        [FieldOffset(0x244)] public UnlockData movieParam__arr5;
        [FieldOffset(0x248)] public UnlockData movieParam__arr6;
        [FieldOffset(0x24C)] public UnlockData movieParam__arr7;
        [FieldOffset(0x250)] public UnlockData movieParam__arr8;
        [FieldOffset(0x254)] public UnlockData movieParam__arr9;
        [FieldOffset(0x258)] public UnlockData movieParam__arr10;
        [FieldOffset(0x25C)] public UnlockData movieParam__arr11;
        [FieldOffset(0x260)] public UnlockData movieParam__arr12;
        [FieldOffset(0x264)] public UnlockData movieParam__arr13;
        [FieldOffset(0x268)] public UnlockData movieParam__arr14;
        [FieldOffset(0x26C)] public UnlockData movieParam__arr15;
        [FieldOffset(0x270)] public UnlockData movieParam__arr16;
        [FieldOffset(0x274)] public UnlockData movieParam__arr17;
        [FieldOffset(0x278)] public UnlockData movieParam__arr18;
        [FieldOffset(0x27C)] public UnlockData movieParam__arr19;
        [FieldOffset(0x280)] public UnlockData movieParam__arr20;
        [FieldOffset(0x284)] public UnlockData movieParam__arr21;
        [FieldOffset(0x288)] public UnlockData movieParam__arr22;
        [FieldOffset(0x28C)] public UnlockData movieParam__arr23;
        [FieldOffset(0x290)] public UnlockData movieParam__arr24;
        [FieldOffset(0x294)] public UnlockData movieParam__arr25;
        [FieldOffset(0x298)] public UnlockData movieParam__arr26;
        [FieldOffset(0x29C)] public UnlockData movieParam__arr27;
        [FieldOffset(0x2A0)] public UnlockData movieParam__arr28;
        [FieldOffset(0x2A4)] public UnlockData movieParam__arr29;
        [FieldOffset(0x2A8)] public UnlockData movieParam__arr30;
        [FieldOffset(0x2AC)] public UnlockData movieParam__arr31;
        [FieldOffset(0x2B0)] public UnlockData movieParam__arr32;
        [FieldOffset(0x2B4)] public UnlockData movieParam__arr33;
        [FieldOffset(0x2B8)] public UnlockData movieParam__arr34;
        [FieldOffset(0x2BC)] public UnlockData soundParam__arr0;
        [FieldOffset(0x2C0)] public UnlockData soundParam__arr1;
        [FieldOffset(0x2C4)] public UnlockData soundParam__arr2;
        [FieldOffset(0x2C8)] public UnlockData soundParam__arr3;
        [FieldOffset(0x2CC)] public UnlockData soundParam__arr4;
        [FieldOffset(0x2D0)] public UnlockData soundParam__arr5;
        [FieldOffset(0x2D4)] public UnlockData soundParam__arr6;
        [FieldOffset(0x2D8)] public UnlockData soundParam__arr7;
        [FieldOffset(0x2DC)] public UnlockData soundParam__arr8;
        [FieldOffset(0x2E0)] public UnlockData soundParam__arr9;
        [FieldOffset(0x2E4)] public UnlockData soundParam__arr10;
        [FieldOffset(0x2E8)] public UnlockData soundParam__arr11;
        [FieldOffset(0x2EC)] public UnlockData soundParam__arr12;
        [FieldOffset(0x2F0)] public UnlockData soundParam__arr13;
        [FieldOffset(0x2F4)] public UnlockData soundParam__arr14;
        [FieldOffset(0x2F8)] public UnlockData soundParam__arr15;
        [FieldOffset(0x2FC)] public UnlockData soundParam__arr16;
        [FieldOffset(0x300)] public UnlockData soundParam__arr17;
        [FieldOffset(0x304)] public UnlockData soundParam__arr18;
        [FieldOffset(0x308)] public UnlockData soundParam__arr19;
        [FieldOffset(0x30C)] public UnlockData soundParam__arr20;
        [FieldOffset(0x310)] public UnlockData soundParam__arr21;
        [FieldOffset(0x314)] public UnlockData soundParam__arr22;
        [FieldOffset(0x318)] public UnlockData soundParam__arr23;
        [FieldOffset(0x31C)] public UnlockData soundParam__arr24;
        [FieldOffset(0x320)] public UnlockData soundParam__arr25;
        [FieldOffset(0x324)] public UnlockData soundParam__arr26;
        [FieldOffset(0x328)] public UnlockData soundParam__arr27;
        [FieldOffset(0x32C)] public UnlockData soundParam__arr28;
        [FieldOffset(0x330)] public UnlockData soundParam__arr29;
        [FieldOffset(0x334)] public UnlockData soundParam__arr30;
        [FieldOffset(0x338)] public UnlockData soundParam__arr31;
        [FieldOffset(0x33C)] public UnlockData soundParam__arr32;
        [FieldOffset(0x340)] public UnlockData soundParam__arr33;
        [FieldOffset(0x344)] public UnlockData soundParam__arr34;
        [FieldOffset(0x348)] public UnlockData soundParam__arr35;
        [FieldOffset(0x34C)] public UnlockData soundParam__arr36;
        [FieldOffset(0x350)] public UnlockData soundParam__arr37;
        [FieldOffset(0x354)] public UnlockData soundParam__arr38;
        [FieldOffset(0x358)] public UnlockData soundParam__arr39;
        [FieldOffset(0x35C)] public UnlockData soundParam__arr40;
        [FieldOffset(0x360)] public UnlockData soundParam__arr41;
        [FieldOffset(0x364)] public UnlockData soundParam__arr42;
        [FieldOffset(0x368)] public UnlockData soundParam__arr43;
        [FieldOffset(0x36C)] public UnlockData soundParam__arr44;
        [FieldOffset(0x370)] public UnlockData soundParam__arr45;
        [FieldOffset(0x374)] public UnlockData soundParam__arr46;
        [FieldOffset(0x378)] public UnlockData soundParam__arr47;
        [FieldOffset(0x37C)] public UnlockData soundParam__arr48;
        [FieldOffset(0x380)] public UnlockData soundParam__arr49;
        [FieldOffset(0x384)] public UnlockData soundParam__arr50;
        [FieldOffset(0x388)] public UnlockData soundParam__arr51;
        [FieldOffset(0x38C)] public UnlockData soundParam__arr52;
        [FieldOffset(0x390)] public UnlockData soundParam__arr53;
        [FieldOffset(0x394)] public UnlockData soundParam__arr54;
        [FieldOffset(0x398)] public UnlockData soundParam__arr55;
        [FieldOffset(0x39C)] public UnlockData soundParam__arr56;
        [FieldOffset(0x3A0)] public UnlockData soundParam__arr57;
        [FieldOffset(0x3A4)] public UnlockData soundParam__arr58;
        [FieldOffset(0x3A8)] public UnlockData soundParam__arr59;
        [FieldOffset(0x3AC)] public UnlockData soundParam__arr60;
        [FieldOffset(0x3B0)] public UnlockData soundParam__arr61;
        [FieldOffset(0x3B4)] public UnlockData soundParam__arr62;
        [FieldOffset(0x3B8)] public UnlockData soundParam__arr63;
        [FieldOffset(0x3BC)] public UnlockData soundParam__arr64;
        [FieldOffset(0x3C0)] public UnlockData soundParam__arr65;
        [FieldOffset(0x3C4)] public UnlockData soundParam__arr66;
        [FieldOffset(0x3C8)] public UnlockData soundParam__arr67;
        [FieldOffset(0x3CC)] public UnlockData soundParam__arr68;
        [FieldOffset(0x3D0)] public UnlockData soundParam__arr69;
        [FieldOffset(0x3D4)] public UnlockData soundParam__arr70;
        [FieldOffset(0x3D8)] public UnlockData soundParam__arr71;
        [FieldOffset(0x3DC)] public UnlockData soundParam__arr72;
        [FieldOffset(0x3E0)] public UnlockData soundParam__arr73;
        [FieldOffset(0x3E4)] public UnlockData soundParam__arr74;
        [FieldOffset(0x3E8)] public UnlockData soundParam__arr75;
        [FieldOffset(0x3EC)] public UnlockData soundParam__arr76;
        [FieldOffset(0x3F0)] public UnlockData soundParam__arr77;
        [FieldOffset(0x3F4)] public UnlockData soundParam__arr78;
        [FieldOffset(0x3F8)] public UnlockData soundParam__arr79;
        [FieldOffset(0x3FC)] public UnlockData soundParam__arr80;
        [FieldOffset(0x400)] public UnlockData soundParam__arr81;
        [FieldOffset(0x404)] public UnlockData soundParam__arr82;
        [FieldOffset(0x408)] public UnlockData soundParam__arr83;
        [FieldOffset(0x40C)] public UnlockData soundParam__arr84;
        [FieldOffset(0x410)] public UnlockData soundParam__arr85;
        [FieldOffset(0x414)] public UnlockData soundParam__arr86;
        [FieldOffset(0x418)] public UnlockData soundParam__arr87;
        [FieldOffset(0x41C)] public UnlockData soundParam__arr88;
        [FieldOffset(0x420)] public UnlockData soundParam__arr89;
        [FieldOffset(0x424)] public UnlockData soundParam__arr90;
        [FieldOffset(0x428)] public UnlockData soundParam__arr91;
        [FieldOffset(0x42C)] public UnlockData soundParam__arr92;
        [FieldOffset(0x430)] public UnlockData soundParam__arr93;
        [FieldOffset(0x434)] public UnlockData soundParam__arr94;
        [FieldOffset(0x438)] public UnlockData soundParam__arr95;
        [FieldOffset(0x43C)] public UnlockData soundParam__arr96;
        [FieldOffset(0x440)] public UnlockData soundParam__arr97;
        [FieldOffset(0x444)] public UnlockData soundParam__arr98;
        [FieldOffset(0x448)] public UnlockData soundParam__arr99;
        [FieldOffset(0x44C)] public UnlockData soundParam__arr100;
        [FieldOffset(0x450)] public UnlockData soundParam__arr101;
        [FieldOffset(0x454)] public UnlockData soundParam__arr102;
        [FieldOffset(0x458)] public UnlockData soundParam__arr103;
        [FieldOffset(0x45C)] public UnlockData soundParam__arr104;
        [FieldOffset(0x460)] public UnlockData soundParam__arr105;
        [FieldOffset(0x464)] public UnlockData soundParam__arr106;
        [FieldOffset(0x468)] public UnlockData soundParam__arr107;
        [FieldOffset(0x46C)] public UnlockData soundParam__arr108;
        [FieldOffset(0x470)] public UnlockData soundParam__arr109;
        [FieldOffset(0x474)] public UnlockData soundParam__arr110;
        [FieldOffset(0x478)] public UnlockData soundParam__arr111;
        [FieldOffset(0x47C)] public UnlockData soundParam__arr112;
        [FieldOffset(0x480)] public UnlockData soundParam__arr113;
        [FieldOffset(0x484)] public UnlockData soundParam__arr114;
        [FieldOffset(0x488)] public UnlockData soundParam__arr115;
        [FieldOffset(0x48C)] public UnlockData soundParam__arr116;
        [FieldOffset(0x490)] public UnlockData soundParam__arr117;
        [FieldOffset(0x494)] public UnlockData soundParam__arr118;
        [FieldOffset(0x498)] public UnlockData soundParam__arr119;
        [FieldOffset(0x49C)] public UnlockData characterParam__arr0;
        [FieldOffset(0x4A0)] public UnlockData characterParam__arr1;
        [FieldOffset(0x4A4)] public UnlockData characterParam__arr2;
        [FieldOffset(0x4A8)] public UnlockData characterParam__arr3;
        [FieldOffset(0x4AC)] public UnlockData characterParam__arr4;
        [FieldOffset(0x4B0)] public UnlockData characterParam__arr5;
        [FieldOffset(0x4B4)] public UnlockData characterParam__arr6;
        [FieldOffset(0x4B8)] public UnlockData characterParam__arr7;
        [FieldOffset(0x4BC)] public UnlockData characterParam__arr8;
        [FieldOffset(0x4C0)] public UnlockData characterParam__arr9;
        [FieldOffset(0x4C4)] public UnlockData characterParam__arr10;
        [FieldOffset(0x4C8)] public UnlockData characterParam__arr11;
        [FieldOffset(0x4CC)] public UnlockData characterParam__arr12;
        [FieldOffset(0x4D0)] public UnlockData characterParam__arr13;
        [FieldOffset(0x4D4)] public UnlockData characterParam__arr14;
        [FieldOffset(0x4D8)] public UnlockData characterParam__arr15;
        [FieldOffset(0x4DC)] public UnlockData characterParam__arr16;
        [FieldOffset(0x4E0)] public UnlockData characterParam__arr17;
        [FieldOffset(0x4E4)] public UnlockData characterParam__arr18;
        [FieldOffset(0x4E8)] public UnlockData characterParam__arr19;
        [FieldOffset(0x4EC)] public UnlockData historyParam__arr0;
        [FieldOffset(0x4F0)] public UnlockData historyParam__arr1;
        [FieldOffset(0x4F4)] public UnlockData historyParam__arr2;
        [FieldOffset(0x4F8)] public UnlockData historyParam__arr3;
        [FieldOffset(0x4FC)] public UnlockData historyParam__arr4;
        [FieldOffset(0x500)] public UnlockData historyParam__arr5;
        [FieldOffset(0x504)] public UnlockData historyParam__arr6;
        [FieldOffset(0x508)] public UnlockData historyParam__arr7;
        [FieldOffset(0x50C)] public UnlockData historyParam__arr8;
        [FieldOffset(0x510)] public UnlockData historyParam__arr9;
        [FieldOffset(0x514)] public UnlockData historyParam__arr10;
        [FieldOffset(0x518)] public UnlockData historyParam__arr11;
        [FieldOffset(0x51C)] public UnlockData historyParam__arr12;
        [FieldOffset(0x520)] public UnlockData historyParam__arr13;
        [FieldOffset(0x524)] public UnlockData historyParam__arr14;
        [FieldOffset(0x528)] public UnlockData noteParam__arr0;
        [FieldOffset(0x52C)] public UnlockData noteParam__arr1;
        [FieldOffset(0x530)] public UnlockData noteParam__arr2;
        [FieldOffset(0x534)] public UnlockData noteParam__arr3;
        [FieldOffset(0x538)] public UnlockData noteParam__arr4;
        [FieldOffset(0x53C)] public UnlockData noteParam__arr5;
        [FieldOffset(0x540)] public UnlockData noteParam__arr6;
        [FieldOffset(0x544)] public UnlockData noteParam__arr7;
        [FieldOffset(0x548)] public UnlockData noteParam__arr8;
        [FieldOffset(0x54C)] public UnlockData noteParam__arr9;
        [FieldOffset(0x550)] public UnlockData noteParam__arr10;
        [FieldOffset(0x554)] public UnlockData noteParam__arr11;
        [FieldOffset(0x558)] public UnlockData noteParam__arr12;
        [FieldOffset(0x55C)] public UnlockData noteParam__arr13;
        [FieldOffset(0x560)] public UnlockData noteParam__arr14;
        [FieldOffset(0x564)] public UnlockData noteParam__arr15;
        [FieldOffset(0x568)] public UnlockData noteParam__arr16;
        [FieldOffset(0x56C)] public UnlockData noteParam__arr17;
        [FieldOffset(0x570)] public UnlockData noteParam__arr18;
        [FieldOffset(0x574)] public UnlockData noteParam__arr19;
        [FieldOffset(0x578)] public UnlockData noteParam__arr20;
        [FieldOffset(0x57C)] public UnlockData noteParam__arr21;
        [FieldOffset(0x580)] public UnlockData noteParam__arr22;
        [FieldOffset(0x584)] public UnlockData noteParam__arr23;
        [FieldOffset(0x588)] public UnlockData noteParam__arr24;
        [FieldOffset(0x58C)] public UnlockData noteParam__arr25;
        [FieldOffset(0x590)] public UnlockData noteParam__arr26;
        [FieldOffset(0x594)] public UnlockData noteParam__arr27;
        [FieldOffset(0x598)] public UnlockData noteParam__arr28;
        [FieldOffset(0x59C)] public UnlockData noteParam__arr29;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct UnlockQAData
    {
        [FieldOffset(0x00)] public bool unlocked;
        [FieldOffset(0x01)] public bool displayed;
        [FieldOffset(0x02)] public byte reserved__arr0;
        [FieldOffset(0x03)] public byte reserved__arr1;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xC8)]
    public struct QAData
    {
        [FieldOffset(0x00)] public UnlockQAData qaParam__arr0;
        [FieldOffset(0x04)] public UnlockQAData qaParam__arr1;
        [FieldOffset(0x08)] public UnlockQAData qaParam__arr2;
        [FieldOffset(0x0C)] public UnlockQAData qaParam__arr3;
        [FieldOffset(0x10)] public UnlockQAData qaParam__arr4;
        [FieldOffset(0x14)] public UnlockQAData qaParam__arr5;
        [FieldOffset(0x18)] public UnlockQAData qaParam__arr6;
        [FieldOffset(0x1C)] public UnlockQAData qaParam__arr7;
        [FieldOffset(0x20)] public UnlockQAData qaParam__arr8;
        [FieldOffset(0x24)] public UnlockQAData qaParam__arr9;
        [FieldOffset(0x28)] public UnlockQAData qaParam__arr10;
        [FieldOffset(0x2C)] public UnlockQAData qaParam__arr11;
        [FieldOffset(0x30)] public UnlockQAData qaParam__arr12;
        [FieldOffset(0x34)] public UnlockQAData qaParam__arr13;
        [FieldOffset(0x38)] public UnlockQAData qaParam__arr14;
        [FieldOffset(0x3C)] public UnlockQAData qaParam__arr15;
        [FieldOffset(0x40)] public UnlockQAData qaParam__arr16;
        [FieldOffset(0x44)] public UnlockQAData qaParam__arr17;
        [FieldOffset(0x48)] public UnlockQAData qaParam__arr18;
        [FieldOffset(0x4C)] public UnlockQAData qaParam__arr19;
        [FieldOffset(0x50)] public UnlockQAData qaParam__arr20;
        [FieldOffset(0x54)] public UnlockQAData qaParam__arr21;
        [FieldOffset(0x58)] public UnlockQAData qaParam__arr22;
        [FieldOffset(0x5C)] public UnlockQAData qaParam__arr23;
        [FieldOffset(0x60)] public UnlockQAData qaParam__arr24;
        [FieldOffset(0x64)] public UnlockQAData qaParam__arr25;
        [FieldOffset(0x68)] public UnlockQAData qaParam__arr26;
        [FieldOffset(0x6C)] public UnlockQAData qaParam__arr27;
        [FieldOffset(0x70)] public UnlockQAData qaParam__arr28;
        [FieldOffset(0x74)] public UnlockQAData qaParam__arr29;
        [FieldOffset(0x78)] public UnlockQAData qaParam__arr30;
        [FieldOffset(0x7C)] public UnlockQAData qaParam__arr31;
        [FieldOffset(0x80)] public UnlockQAData qaParam__arr32;
        [FieldOffset(0x84)] public UnlockQAData qaParam__arr33;
        [FieldOffset(0x88)] public UnlockQAData qaParam__arr34;
        [FieldOffset(0x8C)] public UnlockQAData qaParam__arr35;
        [FieldOffset(0x90)] public UnlockQAData qaParam__arr36;
        [FieldOffset(0x94)] public UnlockQAData qaParam__arr37;
        [FieldOffset(0x98)] public UnlockQAData qaParam__arr38;
        [FieldOffset(0x9C)] public UnlockQAData qaParam__arr39;
        [FieldOffset(0xA0)] public UnlockQAData qaParam__arr40;
        [FieldOffset(0xA4)] public UnlockQAData qaParam__arr41;
        [FieldOffset(0xA8)] public UnlockQAData qaParam__arr42;
        [FieldOffset(0xAC)] public UnlockQAData qaParam__arr43;
        [FieldOffset(0xB0)] public UnlockQAData qaParam__arr44;
        [FieldOffset(0xB4)] public UnlockQAData qaParam__arr45;
        [FieldOffset(0xB8)] public UnlockQAData qaParam__arr46;
        [FieldOffset(0xBC)] public UnlockQAData qaParam__arr47;
        [FieldOffset(0xC0)] public UnlockQAData qaParam__arr48;
        [FieldOffset(0xC4)] public UnlockQAData qaParam__arr49;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x120)]
    public struct FlagContainerData
    {
        [FieldOffset(0x00)] public uint bitFlags__arr0;
        [FieldOffset(0x04)] public uint bitFlags__arr1;
        [FieldOffset(0x08)] public uint bitFlags__arr2;
        [FieldOffset(0x0C)] public uint bitFlags__arr3;
        [FieldOffset(0x10)] public uint bitFlags__arr4;
        [FieldOffset(0x14)] public uint bitFlags__arr5;
        [FieldOffset(0x18)] public uint bitFlags__arr6;
        [FieldOffset(0x1C)] public uint bitFlags__arr7;
        [FieldOffset(0x20)] public uint bitFlags__arr8;
        [FieldOffset(0x24)] public uint bitFlags__arr9;
        [FieldOffset(0x28)] public uint bitFlags__arr10;
        [FieldOffset(0x2C)] public uint bitFlags__arr11;
        [FieldOffset(0x30)] public uint bitFlags__arr12;
        [FieldOffset(0x34)] public uint bitFlags__arr13;
        [FieldOffset(0x38)] public uint bitFlags__arr14;
        [FieldOffset(0x3C)] public uint bitFlags__arr15;
        [FieldOffset(0x40)] public uint bitFlags__arr16;
        [FieldOffset(0x44)] public uint bitFlags__arr17;
        [FieldOffset(0x48)] public uint bitFlags__arr18;
        [FieldOffset(0x4C)] public uint bitFlags__arr19;
        [FieldOffset(0x50)] public uint bitFlags__arr20;
        [FieldOffset(0x54)] public uint bitFlags__arr21;
        [FieldOffset(0x58)] public uint bitFlags__arr22;
        [FieldOffset(0x5C)] public uint bitFlags__arr23;
        [FieldOffset(0x60)] public sbyte byteFlags__arr0;
        [FieldOffset(0x61)] public sbyte byteFlags__arr1;
        [FieldOffset(0x62)] public sbyte byteFlags__arr2;
        [FieldOffset(0x63)] public sbyte byteFlags__arr3;
        [FieldOffset(0x64)] public sbyte byteFlags__arr4;
        [FieldOffset(0x65)] public sbyte byteFlags__arr5;
        [FieldOffset(0x66)] public sbyte byteFlags__arr6;
        [FieldOffset(0x67)] public sbyte byteFlags__arr7;
        [FieldOffset(0x68)] public sbyte byteFlags__arr8;
        [FieldOffset(0x69)] public sbyte byteFlags__arr9;
        [FieldOffset(0x6A)] public sbyte byteFlags__arr10;
        [FieldOffset(0x6B)] public sbyte byteFlags__arr11;
        [FieldOffset(0x6C)] public sbyte byteFlags__arr12;
        [FieldOffset(0x6D)] public sbyte byteFlags__arr13;
        [FieldOffset(0x6E)] public sbyte byteFlags__arr14;
        [FieldOffset(0x6F)] public sbyte byteFlags__arr15;
        [FieldOffset(0x70)] public sbyte byteFlags__arr16;
        [FieldOffset(0x71)] public sbyte byteFlags__arr17;
        [FieldOffset(0x72)] public sbyte byteFlags__arr18;
        [FieldOffset(0x73)] public sbyte byteFlags__arr19;
        [FieldOffset(0x74)] public sbyte byteFlags__arr20;
        [FieldOffset(0x75)] public sbyte byteFlags__arr21;
        [FieldOffset(0x76)] public sbyte byteFlags__arr22;
        [FieldOffset(0x77)] public sbyte byteFlags__arr23;
        [FieldOffset(0x78)] public sbyte byteFlags__arr24;
        [FieldOffset(0x79)] public sbyte byteFlags__arr25;
        [FieldOffset(0x7A)] public sbyte byteFlags__arr26;
        [FieldOffset(0x7B)] public sbyte byteFlags__arr27;
        [FieldOffset(0x7C)] public sbyte byteFlags__arr28;
        [FieldOffset(0x7D)] public sbyte byteFlags__arr29;
        [FieldOffset(0x7E)] public sbyte byteFlags__arr30;
        [FieldOffset(0x7F)] public sbyte byteFlags__arr31;
        [FieldOffset(0x80)] public sbyte byteFlags__arr32;
        [FieldOffset(0x81)] public sbyte byteFlags__arr33;
        [FieldOffset(0x82)] public sbyte byteFlags__arr34;
        [FieldOffset(0x83)] public sbyte byteFlags__arr35;
        [FieldOffset(0x84)] public sbyte byteFlags__arr36;
        [FieldOffset(0x85)] public sbyte byteFlags__arr37;
        [FieldOffset(0x86)] public sbyte byteFlags__arr38;
        [FieldOffset(0x87)] public sbyte byteFlags__arr39;
        [FieldOffset(0x88)] public sbyte byteFlags__arr40;
        [FieldOffset(0x89)] public sbyte byteFlags__arr41;
        [FieldOffset(0x8A)] public sbyte byteFlags__arr42;
        [FieldOffset(0x8B)] public sbyte byteFlags__arr43;
        [FieldOffset(0x8C)] public sbyte byteFlags__arr44;
        [FieldOffset(0x8D)] public sbyte byteFlags__arr45;
        [FieldOffset(0x8E)] public sbyte byteFlags__arr46;
        [FieldOffset(0x8F)] public sbyte byteFlags__arr47;
        [FieldOffset(0x90)] public sbyte byteFlags__arr48;
        [FieldOffset(0x91)] public sbyte byteFlags__arr49;
        [FieldOffset(0x92)] public sbyte byteFlags__arr50;
        [FieldOffset(0x93)] public sbyte byteFlags__arr51;
        [FieldOffset(0x94)] public sbyte byteFlags__arr52;
        [FieldOffset(0x95)] public sbyte byteFlags__arr53;
        [FieldOffset(0x96)] public sbyte byteFlags__arr54;
        [FieldOffset(0x97)] public sbyte byteFlags__arr55;
        [FieldOffset(0x98)] public sbyte byteFlags__arr56;
        [FieldOffset(0x99)] public sbyte byteFlags__arr57;
        [FieldOffset(0x9A)] public sbyte byteFlags__arr58;
        [FieldOffset(0x9B)] public sbyte byteFlags__arr59;
        [FieldOffset(0x9C)] public sbyte byteFlags__arr60;
        [FieldOffset(0x9D)] public sbyte byteFlags__arr61;
        [FieldOffset(0x9E)] public sbyte byteFlags__arr62;
        [FieldOffset(0x9F)] public sbyte byteFlags__arr63;
        [FieldOffset(0xA0)] public sbyte byteFlags__arr64;
        [FieldOffset(0xA1)] public sbyte byteFlags__arr65;
        [FieldOffset(0xA2)] public sbyte byteFlags__arr66;
        [FieldOffset(0xA3)] public sbyte byteFlags__arr67;
        [FieldOffset(0xA4)] public sbyte byteFlags__arr68;
        [FieldOffset(0xA5)] public sbyte byteFlags__arr69;
        [FieldOffset(0xA6)] public sbyte byteFlags__arr70;
        [FieldOffset(0xA7)] public sbyte byteFlags__arr71;
        [FieldOffset(0xA8)] public sbyte byteFlags__arr72;
        [FieldOffset(0xA9)] public sbyte byteFlags__arr73;
        [FieldOffset(0xAA)] public sbyte byteFlags__arr74;
        [FieldOffset(0xAB)] public sbyte byteFlags__arr75;
        [FieldOffset(0xAC)] public sbyte byteFlags__arr76;
        [FieldOffset(0xAD)] public sbyte byteFlags__arr77;
        [FieldOffset(0xAE)] public sbyte byteFlags__arr78;
        [FieldOffset(0xAF)] public sbyte byteFlags__arr79;
        [FieldOffset(0xB0)] public sbyte byteFlags__arr80;
        [FieldOffset(0xB1)] public sbyte byteFlags__arr81;
        [FieldOffset(0xB2)] public sbyte byteFlags__arr82;
        [FieldOffset(0xB3)] public sbyte byteFlags__arr83;
        [FieldOffset(0xB4)] public sbyte byteFlags__arr84;
        [FieldOffset(0xB5)] public sbyte byteFlags__arr85;
        [FieldOffset(0xB6)] public sbyte byteFlags__arr86;
        [FieldOffset(0xB7)] public sbyte byteFlags__arr87;
        [FieldOffset(0xB8)] public sbyte byteFlags__arr88;
        [FieldOffset(0xB9)] public sbyte byteFlags__arr89;
        [FieldOffset(0xBA)] public sbyte byteFlags__arr90;
        [FieldOffset(0xBB)] public sbyte byteFlags__arr91;
        [FieldOffset(0xBC)] public sbyte byteFlags__arr92;
        [FieldOffset(0xBD)] public sbyte byteFlags__arr93;
        [FieldOffset(0xBE)] public sbyte byteFlags__arr94;
        [FieldOffset(0xBF)] public sbyte byteFlags__arr95;
        [FieldOffset(0xC0)] public sbyte byteFlags__arr96;
        [FieldOffset(0xC1)] public sbyte byteFlags__arr97;
        [FieldOffset(0xC2)] public sbyte byteFlags__arr98;
        [FieldOffset(0xC3)] public sbyte byteFlags__arr99;
        [FieldOffset(0xC4)] public sbyte byteFlags__arr100;
        [FieldOffset(0xC5)] public sbyte byteFlags__arr101;
        [FieldOffset(0xC6)] public sbyte byteFlags__arr102;
        [FieldOffset(0xC7)] public sbyte byteFlags__arr103;
        [FieldOffset(0xC8)] public sbyte byteFlags__arr104;
        [FieldOffset(0xC9)] public sbyte byteFlags__arr105;
        [FieldOffset(0xCA)] public sbyte byteFlags__arr106;
        [FieldOffset(0xCB)] public sbyte byteFlags__arr107;
        [FieldOffset(0xCC)] public sbyte byteFlags__arr108;
        [FieldOffset(0xCD)] public sbyte byteFlags__arr109;
        [FieldOffset(0xCE)] public sbyte byteFlags__arr110;
        [FieldOffset(0xCF)] public sbyte byteFlags__arr111;
        [FieldOffset(0xD0)] public sbyte byteFlags__arr112;
        [FieldOffset(0xD1)] public sbyte byteFlags__arr113;
        [FieldOffset(0xD2)] public sbyte byteFlags__arr114;
        [FieldOffset(0xD3)] public sbyte byteFlags__arr115;
        [FieldOffset(0xD4)] public sbyte byteFlags__arr116;
        [FieldOffset(0xD5)] public sbyte byteFlags__arr117;
        [FieldOffset(0xD6)] public sbyte byteFlags__arr118;
        [FieldOffset(0xD7)] public sbyte byteFlags__arr119;
        [FieldOffset(0xD8)] public sbyte byteFlags__arr120;
        [FieldOffset(0xD9)] public sbyte byteFlags__arr121;
        [FieldOffset(0xDA)] public sbyte byteFlags__arr122;
        [FieldOffset(0xDB)] public sbyte byteFlags__arr123;
        [FieldOffset(0xDC)] public sbyte byteFlags__arr124;
        [FieldOffset(0xDD)] public sbyte byteFlags__arr125;
        [FieldOffset(0xDE)] public sbyte byteFlags__arr126;
        [FieldOffset(0xDF)] public sbyte byteFlags__arr127;
        [FieldOffset(0xE0)] public uint intDatas__arr0;
        [FieldOffset(0xE4)] public uint intDatas__arr1;
        [FieldOffset(0xE8)] public uint intDatas__arr2;
        [FieldOffset(0xEC)] public uint intDatas__arr3;
        [FieldOffset(0xF0)] public uint intDatas__arr4;
        [FieldOffset(0xF4)] public uint intDatas__arr5;
        [FieldOffset(0xF8)] public uint intDatas__arr6;
        [FieldOffset(0xFC)] public uint intDatas__arr7;
        [FieldOffset(0x100)] public uint intDatas__arr8;
        [FieldOffset(0x104)] public uint intDatas__arr9;
        [FieldOffset(0x108)] public uint intDatas__arr10;
        [FieldOffset(0x10C)] public uint intDatas__arr11;
        [FieldOffset(0x110)] public uint intDatas__arr12;
        [FieldOffset(0x114)] public uint intDatas__arr13;
        [FieldOffset(0x118)] public uint intDatas__arr14;
        [FieldOffset(0x11C)] public uint intDatas__arr15;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1C00)]
    public struct WorldFlagData
    {
        [FieldOffset(0x00)] public uint bitFlags__arr0;
        [FieldOffset(0x04)] public uint bitFlags__arr1;
        [FieldOffset(0x08)] public uint bitFlags__arr2;
        [FieldOffset(0x0C)] public uint bitFlags__arr3;
        [FieldOffset(0x10)] public uint bitFlags__arr4;
        [FieldOffset(0x14)] public uint bitFlags__arr5;
        [FieldOffset(0x18)] public uint bitFlags__arr6;
        [FieldOffset(0x1C)] public uint bitFlags__arr7;
        [FieldOffset(0x20)] public uint bitFlags__arr8;
        [FieldOffset(0x24)] public uint bitFlags__arr9;
        [FieldOffset(0x28)] public uint bitFlags__arr10;
        [FieldOffset(0x2C)] public uint bitFlags__arr11;
        [FieldOffset(0x30)] public uint bitFlags__arr12;
        [FieldOffset(0x34)] public uint bitFlags__arr13;
        [FieldOffset(0x38)] public uint bitFlags__arr14;
        [FieldOffset(0x3C)] public uint bitFlags__arr15;
        [FieldOffset(0x40)] public uint bitFlags__arr16;
        [FieldOffset(0x44)] public uint bitFlags__arr17;
        [FieldOffset(0x48)] public uint bitFlags__arr18;
        [FieldOffset(0x4C)] public uint bitFlags__arr19;
        [FieldOffset(0x50)] public uint bitFlags__arr20;
        [FieldOffset(0x54)] public uint bitFlags__arr21;
        [FieldOffset(0x58)] public uint bitFlags__arr22;
        [FieldOffset(0x5C)] public uint bitFlags__arr23;
        [FieldOffset(0x60)] public uint bitFlags__arr24;
        [FieldOffset(0x64)] public uint bitFlags__arr25;
        [FieldOffset(0x68)] public uint bitFlags__arr26;
        [FieldOffset(0x6C)] public uint bitFlags__arr27;
        [FieldOffset(0x70)] public uint bitFlags__arr28;
        [FieldOffset(0x74)] public uint bitFlags__arr29;
        [FieldOffset(0x78)] public uint bitFlags__arr30;
        [FieldOffset(0x7C)] public uint bitFlags__arr31;
        [FieldOffset(0x80)] public uint bitFlags__arr32;
        [FieldOffset(0x84)] public uint bitFlags__arr33;
        [FieldOffset(0x88)] public uint bitFlags__arr34;
        [FieldOffset(0x8C)] public uint bitFlags__arr35;
        [FieldOffset(0x90)] public uint bitFlags__arr36;
        [FieldOffset(0x94)] public uint bitFlags__arr37;
        [FieldOffset(0x98)] public uint bitFlags__arr38;
        [FieldOffset(0x9C)] public uint bitFlags__arr39;
        [FieldOffset(0xA0)] public uint bitFlags__arr40;
        [FieldOffset(0xA4)] public uint bitFlags__arr41;
        [FieldOffset(0xA8)] public uint bitFlags__arr42;
        [FieldOffset(0xAC)] public uint bitFlags__arr43;
        [FieldOffset(0xB0)] public uint bitFlags__arr44;
        [FieldOffset(0xB4)] public uint bitFlags__arr45;
        [FieldOffset(0xB8)] public uint bitFlags__arr46;
        [FieldOffset(0xBC)] public uint bitFlags__arr47;
        [FieldOffset(0xC0)] public uint bitFlags__arr48;
        [FieldOffset(0xC4)] public uint bitFlags__arr49;
        [FieldOffset(0xC8)] public uint bitFlags__arr50;
        [FieldOffset(0xCC)] public uint bitFlags__arr51;
        [FieldOffset(0xD0)] public uint bitFlags__arr52;
        [FieldOffset(0xD4)] public uint bitFlags__arr53;
        [FieldOffset(0xD8)] public uint bitFlags__arr54;
        [FieldOffset(0xDC)] public uint bitFlags__arr55;
        [FieldOffset(0xE0)] public uint bitFlags__arr56;
        [FieldOffset(0xE4)] public uint bitFlags__arr57;
        [FieldOffset(0xE8)] public uint bitFlags__arr58;
        [FieldOffset(0xEC)] public uint bitFlags__arr59;
        [FieldOffset(0xF0)] public uint bitFlags__arr60;
        [FieldOffset(0xF4)] public uint bitFlags__arr61;
        [FieldOffset(0xF8)] public uint bitFlags__arr62;
        [FieldOffset(0xFC)] public uint bitFlags__arr63;
        [FieldOffset(0x100)] public uint bitFlags__arr64;
        [FieldOffset(0x104)] public uint bitFlags__arr65;
        [FieldOffset(0x108)] public uint bitFlags__arr66;
        [FieldOffset(0x10C)] public uint bitFlags__arr67;
        [FieldOffset(0x110)] public uint bitFlags__arr68;
        [FieldOffset(0x114)] public uint bitFlags__arr69;
        [FieldOffset(0x118)] public uint bitFlags__arr70;
        [FieldOffset(0x11C)] public uint bitFlags__arr71;
        [FieldOffset(0x120)] public uint bitFlags__arr72;
        [FieldOffset(0x124)] public uint bitFlags__arr73;
        [FieldOffset(0x128)] public uint bitFlags__arr74;
        [FieldOffset(0x12C)] public uint bitFlags__arr75;
        [FieldOffset(0x130)] public uint bitFlags__arr76;
        [FieldOffset(0x134)] public uint bitFlags__arr77;
        [FieldOffset(0x138)] public uint bitFlags__arr78;
        [FieldOffset(0x13C)] public uint bitFlags__arr79;
        [FieldOffset(0x140)] public uint bitFlags__arr80;
        [FieldOffset(0x144)] public uint bitFlags__arr81;
        [FieldOffset(0x148)] public uint bitFlags__arr82;
        [FieldOffset(0x14C)] public uint bitFlags__arr83;
        [FieldOffset(0x150)] public uint bitFlags__arr84;
        [FieldOffset(0x154)] public uint bitFlags__arr85;
        [FieldOffset(0x158)] public uint bitFlags__arr86;
        [FieldOffset(0x15C)] public uint bitFlags__arr87;
        [FieldOffset(0x160)] public uint bitFlags__arr88;
        [FieldOffset(0x164)] public uint bitFlags__arr89;
        [FieldOffset(0x168)] public uint bitFlags__arr90;
        [FieldOffset(0x16C)] public uint bitFlags__arr91;
        [FieldOffset(0x170)] public uint bitFlags__arr92;
        [FieldOffset(0x174)] public uint bitFlags__arr93;
        [FieldOffset(0x178)] public uint bitFlags__arr94;
        [FieldOffset(0x17C)] public uint bitFlags__arr95;
        [FieldOffset(0x180)] public uint bitFlags__arr96;
        [FieldOffset(0x184)] public uint bitFlags__arr97;
        [FieldOffset(0x188)] public uint bitFlags__arr98;
        [FieldOffset(0x18C)] public uint bitFlags__arr99;
        [FieldOffset(0x190)] public uint bitFlags__arr100;
        [FieldOffset(0x194)] public uint bitFlags__arr101;
        [FieldOffset(0x198)] public uint bitFlags__arr102;
        [FieldOffset(0x19C)] public uint bitFlags__arr103;
        [FieldOffset(0x1A0)] public uint bitFlags__arr104;
        [FieldOffset(0x1A4)] public uint bitFlags__arr105;
        [FieldOffset(0x1A8)] public uint bitFlags__arr106;
        [FieldOffset(0x1AC)] public uint bitFlags__arr107;
        [FieldOffset(0x1B0)] public uint bitFlags__arr108;
        [FieldOffset(0x1B4)] public uint bitFlags__arr109;
        [FieldOffset(0x1B8)] public uint bitFlags__arr110;
        [FieldOffset(0x1BC)] public uint bitFlags__arr111;
        [FieldOffset(0x1C0)] public uint bitFlags__arr112;
        [FieldOffset(0x1C4)] public uint bitFlags__arr113;
        [FieldOffset(0x1C8)] public uint bitFlags__arr114;
        [FieldOffset(0x1CC)] public uint bitFlags__arr115;
        [FieldOffset(0x1D0)] public uint bitFlags__arr116;
        [FieldOffset(0x1D4)] public uint bitFlags__arr117;
        [FieldOffset(0x1D8)] public uint bitFlags__arr118;
        [FieldOffset(0x1DC)] public uint bitFlags__arr119;
        [FieldOffset(0x1E0)] public uint bitFlags__arr120;
        [FieldOffset(0x1E4)] public uint bitFlags__arr121;
        [FieldOffset(0x1E8)] public uint bitFlags__arr122;
        [FieldOffset(0x1EC)] public uint bitFlags__arr123;
        [FieldOffset(0x1F0)] public uint bitFlags__arr124;
        [FieldOffset(0x1F4)] public uint bitFlags__arr125;
        [FieldOffset(0x1F8)] public uint bitFlags__arr126;
        [FieldOffset(0x1FC)] public uint bitFlags__arr127;
        [FieldOffset(0x200)] public uint bitFlags__arr128;
        [FieldOffset(0x204)] public uint bitFlags__arr129;
        [FieldOffset(0x208)] public uint bitFlags__arr130;
        [FieldOffset(0x20C)] public uint bitFlags__arr131;
        [FieldOffset(0x210)] public uint bitFlags__arr132;
        [FieldOffset(0x214)] public uint bitFlags__arr133;
        [FieldOffset(0x218)] public uint bitFlags__arr134;
        [FieldOffset(0x21C)] public uint bitFlags__arr135;
        [FieldOffset(0x220)] public uint bitFlags__arr136;
        [FieldOffset(0x224)] public uint bitFlags__arr137;
        [FieldOffset(0x228)] public uint bitFlags__arr138;
        [FieldOffset(0x22C)] public uint bitFlags__arr139;
        [FieldOffset(0x230)] public uint bitFlags__arr140;
        [FieldOffset(0x234)] public uint bitFlags__arr141;
        [FieldOffset(0x238)] public uint bitFlags__arr142;
        [FieldOffset(0x23C)] public uint bitFlags__arr143;
        [FieldOffset(0x240)] public uint bitFlags__arr144;
        [FieldOffset(0x244)] public uint bitFlags__arr145;
        [FieldOffset(0x248)] public uint bitFlags__arr146;
        [FieldOffset(0x24C)] public uint bitFlags__arr147;
        [FieldOffset(0x250)] public uint bitFlags__arr148;
        [FieldOffset(0x254)] public uint bitFlags__arr149;
        [FieldOffset(0x258)] public uint bitFlags__arr150;
        [FieldOffset(0x25C)] public uint bitFlags__arr151;
        [FieldOffset(0x260)] public uint bitFlags__arr152;
        [FieldOffset(0x264)] public uint bitFlags__arr153;
        [FieldOffset(0x268)] public uint bitFlags__arr154;
        [FieldOffset(0x26C)] public uint bitFlags__arr155;
        [FieldOffset(0x270)] public uint bitFlags__arr156;
        [FieldOffset(0x274)] public uint bitFlags__arr157;
        [FieldOffset(0x278)] public uint bitFlags__arr158;
        [FieldOffset(0x27C)] public uint bitFlags__arr159;
        [FieldOffset(0x280)] public uint bitFlags__arr160;
        [FieldOffset(0x284)] public uint bitFlags__arr161;
        [FieldOffset(0x288)] public uint bitFlags__arr162;
        [FieldOffset(0x28C)] public uint bitFlags__arr163;
        [FieldOffset(0x290)] public uint bitFlags__arr164;
        [FieldOffset(0x294)] public uint bitFlags__arr165;
        [FieldOffset(0x298)] public uint bitFlags__arr166;
        [FieldOffset(0x29C)] public uint bitFlags__arr167;
        [FieldOffset(0x2A0)] public uint bitFlags__arr168;
        [FieldOffset(0x2A4)] public uint bitFlags__arr169;
        [FieldOffset(0x2A8)] public uint bitFlags__arr170;
        [FieldOffset(0x2AC)] public uint bitFlags__arr171;
        [FieldOffset(0x2B0)] public uint bitFlags__arr172;
        [FieldOffset(0x2B4)] public uint bitFlags__arr173;
        [FieldOffset(0x2B8)] public uint bitFlags__arr174;
        [FieldOffset(0x2BC)] public uint bitFlags__arr175;
        [FieldOffset(0x2C0)] public uint bitFlags__arr176;
        [FieldOffset(0x2C4)] public uint bitFlags__arr177;
        [FieldOffset(0x2C8)] public uint bitFlags__arr178;
        [FieldOffset(0x2CC)] public uint bitFlags__arr179;
        [FieldOffset(0x2D0)] public uint bitFlags__arr180;
        [FieldOffset(0x2D4)] public uint bitFlags__arr181;
        [FieldOffset(0x2D8)] public uint bitFlags__arr182;
        [FieldOffset(0x2DC)] public uint bitFlags__arr183;
        [FieldOffset(0x2E0)] public uint bitFlags__arr184;
        [FieldOffset(0x2E4)] public uint bitFlags__arr185;
        [FieldOffset(0x2E8)] public uint bitFlags__arr186;
        [FieldOffset(0x2EC)] public uint bitFlags__arr187;
        [FieldOffset(0x2F0)] public uint bitFlags__arr188;
        [FieldOffset(0x2F4)] public uint bitFlags__arr189;
        [FieldOffset(0x2F8)] public uint bitFlags__arr190;
        [FieldOffset(0x2FC)] public uint bitFlags__arr191;
        [FieldOffset(0x300)] public uint bitFlags__arr192;
        [FieldOffset(0x304)] public uint bitFlags__arr193;
        [FieldOffset(0x308)] public uint bitFlags__arr194;
        [FieldOffset(0x30C)] public uint bitFlags__arr195;
        [FieldOffset(0x310)] public uint bitFlags__arr196;
        [FieldOffset(0x314)] public uint bitFlags__arr197;
        [FieldOffset(0x318)] public uint bitFlags__arr198;
        [FieldOffset(0x31C)] public uint bitFlags__arr199;
        [FieldOffset(0x320)] public uint bitFlags__arr200;
        [FieldOffset(0x324)] public uint bitFlags__arr201;
        [FieldOffset(0x328)] public uint bitFlags__arr202;
        [FieldOffset(0x32C)] public uint bitFlags__arr203;
        [FieldOffset(0x330)] public uint bitFlags__arr204;
        [FieldOffset(0x334)] public uint bitFlags__arr205;
        [FieldOffset(0x338)] public uint bitFlags__arr206;
        [FieldOffset(0x33C)] public uint bitFlags__arr207;
        [FieldOffset(0x340)] public uint bitFlags__arr208;
        [FieldOffset(0x344)] public uint bitFlags__arr209;
        [FieldOffset(0x348)] public uint bitFlags__arr210;
        [FieldOffset(0x34C)] public uint bitFlags__arr211;
        [FieldOffset(0x350)] public uint bitFlags__arr212;
        [FieldOffset(0x354)] public uint bitFlags__arr213;
        [FieldOffset(0x358)] public uint bitFlags__arr214;
        [FieldOffset(0x35C)] public uint bitFlags__arr215;
        [FieldOffset(0x360)] public uint bitFlags__arr216;
        [FieldOffset(0x364)] public uint bitFlags__arr217;
        [FieldOffset(0x368)] public uint bitFlags__arr218;
        [FieldOffset(0x36C)] public uint bitFlags__arr219;
        [FieldOffset(0x370)] public uint bitFlags__arr220;
        [FieldOffset(0x374)] public uint bitFlags__arr221;
        [FieldOffset(0x378)] public uint bitFlags__arr222;
        [FieldOffset(0x37C)] public uint bitFlags__arr223;
        [FieldOffset(0x380)] public uint bitFlags__arr224;
        [FieldOffset(0x384)] public uint bitFlags__arr225;
        [FieldOffset(0x388)] public uint bitFlags__arr226;
        [FieldOffset(0x38C)] public uint bitFlags__arr227;
        [FieldOffset(0x390)] public uint bitFlags__arr228;
        [FieldOffset(0x394)] public uint bitFlags__arr229;
        [FieldOffset(0x398)] public uint bitFlags__arr230;
        [FieldOffset(0x39C)] public uint bitFlags__arr231;
        [FieldOffset(0x3A0)] public uint bitFlags__arr232;
        [FieldOffset(0x3A4)] public uint bitFlags__arr233;
        [FieldOffset(0x3A8)] public uint bitFlags__arr234;
        [FieldOffset(0x3AC)] public uint bitFlags__arr235;
        [FieldOffset(0x3B0)] public uint bitFlags__arr236;
        [FieldOffset(0x3B4)] public uint bitFlags__arr237;
        [FieldOffset(0x3B8)] public uint bitFlags__arr238;
        [FieldOffset(0x3BC)] public uint bitFlags__arr239;
        [FieldOffset(0x3C0)] public uint bitFlags__arr240;
        [FieldOffset(0x3C4)] public uint bitFlags__arr241;
        [FieldOffset(0x3C8)] public uint bitFlags__arr242;
        [FieldOffset(0x3CC)] public uint bitFlags__arr243;
        [FieldOffset(0x3D0)] public uint bitFlags__arr244;
        [FieldOffset(0x3D4)] public uint bitFlags__arr245;
        [FieldOffset(0x3D8)] public uint bitFlags__arr246;
        [FieldOffset(0x3DC)] public uint bitFlags__arr247;
        [FieldOffset(0x3E0)] public uint bitFlags__arr248;
        [FieldOffset(0x3E4)] public uint bitFlags__arr249;
        [FieldOffset(0x3E8)] public uint bitFlags__arr250;
        [FieldOffset(0x3EC)] public uint bitFlags__arr251;
        [FieldOffset(0x3F0)] public uint bitFlags__arr252;
        [FieldOffset(0x3F4)] public uint bitFlags__arr253;
        [FieldOffset(0x3F8)] public uint bitFlags__arr254;
        [FieldOffset(0x3FC)] public uint bitFlags__arr255;
        [FieldOffset(0x400)] public uint bitFlags__arr256;
        [FieldOffset(0x404)] public uint bitFlags__arr257;
        [FieldOffset(0x408)] public uint bitFlags__arr258;
        [FieldOffset(0x40C)] public uint bitFlags__arr259;
        [FieldOffset(0x410)] public uint bitFlags__arr260;
        [FieldOffset(0x414)] public uint bitFlags__arr261;
        [FieldOffset(0x418)] public uint bitFlags__arr262;
        [FieldOffset(0x41C)] public uint bitFlags__arr263;
        [FieldOffset(0x420)] public uint bitFlags__arr264;
        [FieldOffset(0x424)] public uint bitFlags__arr265;
        [FieldOffset(0x428)] public uint bitFlags__arr266;
        [FieldOffset(0x42C)] public uint bitFlags__arr267;
        [FieldOffset(0x430)] public uint bitFlags__arr268;
        [FieldOffset(0x434)] public uint bitFlags__arr269;
        [FieldOffset(0x438)] public uint bitFlags__arr270;
        [FieldOffset(0x43C)] public uint bitFlags__arr271;
        [FieldOffset(0x440)] public uint bitFlags__arr272;
        [FieldOffset(0x444)] public uint bitFlags__arr273;
        [FieldOffset(0x448)] public uint bitFlags__arr274;
        [FieldOffset(0x44C)] public uint bitFlags__arr275;
        [FieldOffset(0x450)] public uint bitFlags__arr276;
        [FieldOffset(0x454)] public uint bitFlags__arr277;
        [FieldOffset(0x458)] public uint bitFlags__arr278;
        [FieldOffset(0x45C)] public uint bitFlags__arr279;
        [FieldOffset(0x460)] public uint bitFlags__arr280;
        [FieldOffset(0x464)] public uint bitFlags__arr281;
        [FieldOffset(0x468)] public uint bitFlags__arr282;
        [FieldOffset(0x46C)] public uint bitFlags__arr283;
        [FieldOffset(0x470)] public uint bitFlags__arr284;
        [FieldOffset(0x474)] public uint bitFlags__arr285;
        [FieldOffset(0x478)] public uint bitFlags__arr286;
        [FieldOffset(0x47C)] public uint bitFlags__arr287;
        [FieldOffset(0x480)] public uint bitFlags__arr288;
        [FieldOffset(0x484)] public uint bitFlags__arr289;
        [FieldOffset(0x488)] public uint bitFlags__arr290;
        [FieldOffset(0x48C)] public uint bitFlags__arr291;
        [FieldOffset(0x490)] public uint bitFlags__arr292;
        [FieldOffset(0x494)] public uint bitFlags__arr293;
        [FieldOffset(0x498)] public uint bitFlags__arr294;
        [FieldOffset(0x49C)] public uint bitFlags__arr295;
        [FieldOffset(0x4A0)] public uint bitFlags__arr296;
        [FieldOffset(0x4A4)] public uint bitFlags__arr297;
        [FieldOffset(0x4A8)] public uint bitFlags__arr298;
        [FieldOffset(0x4AC)] public uint bitFlags__arr299;
        [FieldOffset(0x4B0)] public uint bitFlags__arr300;
        [FieldOffset(0x4B4)] public uint bitFlags__arr301;
        [FieldOffset(0x4B8)] public uint bitFlags__arr302;
        [FieldOffset(0x4BC)] public uint bitFlags__arr303;
        [FieldOffset(0x4C0)] public uint bitFlags__arr304;
        [FieldOffset(0x4C4)] public uint bitFlags__arr305;
        [FieldOffset(0x4C8)] public uint bitFlags__arr306;
        [FieldOffset(0x4CC)] public uint bitFlags__arr307;
        [FieldOffset(0x4D0)] public uint bitFlags__arr308;
        [FieldOffset(0x4D4)] public uint bitFlags__arr309;
        [FieldOffset(0x4D8)] public uint bitFlags__arr310;
        [FieldOffset(0x4DC)] public uint bitFlags__arr311;
        [FieldOffset(0x4E0)] public uint bitFlags__arr312;
        [FieldOffset(0x4E4)] public uint bitFlags__arr313;
        [FieldOffset(0x4E8)] public uint bitFlags__arr314;
        [FieldOffset(0x4EC)] public uint bitFlags__arr315;
        [FieldOffset(0x4F0)] public uint bitFlags__arr316;
        [FieldOffset(0x4F4)] public uint bitFlags__arr317;
        [FieldOffset(0x4F8)] public uint bitFlags__arr318;
        [FieldOffset(0x4FC)] public uint bitFlags__arr319;
        [FieldOffset(0x500)] public uint bitFlags__arr320;
        [FieldOffset(0x504)] public uint bitFlags__arr321;
        [FieldOffset(0x508)] public uint bitFlags__arr322;
        [FieldOffset(0x50C)] public uint bitFlags__arr323;
        [FieldOffset(0x510)] public uint bitFlags__arr324;
        [FieldOffset(0x514)] public uint bitFlags__arr325;
        [FieldOffset(0x518)] public uint bitFlags__arr326;
        [FieldOffset(0x51C)] public uint bitFlags__arr327;
        [FieldOffset(0x520)] public uint bitFlags__arr328;
        [FieldOffset(0x524)] public uint bitFlags__arr329;
        [FieldOffset(0x528)] public uint bitFlags__arr330;
        [FieldOffset(0x52C)] public uint bitFlags__arr331;
        [FieldOffset(0x530)] public uint bitFlags__arr332;
        [FieldOffset(0x534)] public uint bitFlags__arr333;
        [FieldOffset(0x538)] public uint bitFlags__arr334;
        [FieldOffset(0x53C)] public uint bitFlags__arr335;
        [FieldOffset(0x540)] public uint bitFlags__arr336;
        [FieldOffset(0x544)] public uint bitFlags__arr337;
        [FieldOffset(0x548)] public uint bitFlags__arr338;
        [FieldOffset(0x54C)] public uint bitFlags__arr339;
        [FieldOffset(0x550)] public uint bitFlags__arr340;
        [FieldOffset(0x554)] public uint bitFlags__arr341;
        [FieldOffset(0x558)] public uint bitFlags__arr342;
        [FieldOffset(0x55C)] public uint bitFlags__arr343;
        [FieldOffset(0x560)] public uint bitFlags__arr344;
        [FieldOffset(0x564)] public uint bitFlags__arr345;
        [FieldOffset(0x568)] public uint bitFlags__arr346;
        [FieldOffset(0x56C)] public uint bitFlags__arr347;
        [FieldOffset(0x570)] public uint bitFlags__arr348;
        [FieldOffset(0x574)] public uint bitFlags__arr349;
        [FieldOffset(0x578)] public uint bitFlags__arr350;
        [FieldOffset(0x57C)] public uint bitFlags__arr351;
        [FieldOffset(0x580)] public uint bitFlags__arr352;
        [FieldOffset(0x584)] public uint bitFlags__arr353;
        [FieldOffset(0x588)] public uint bitFlags__arr354;
        [FieldOffset(0x58C)] public uint bitFlags__arr355;
        [FieldOffset(0x590)] public uint bitFlags__arr356;
        [FieldOffset(0x594)] public uint bitFlags__arr357;
        [FieldOffset(0x598)] public uint bitFlags__arr358;
        [FieldOffset(0x59C)] public uint bitFlags__arr359;
        [FieldOffset(0x5A0)] public uint bitFlags__arr360;
        [FieldOffset(0x5A4)] public uint bitFlags__arr361;
        [FieldOffset(0x5A8)] public uint bitFlags__arr362;
        [FieldOffset(0x5AC)] public uint bitFlags__arr363;
        [FieldOffset(0x5B0)] public uint bitFlags__arr364;
        [FieldOffset(0x5B4)] public uint bitFlags__arr365;
        [FieldOffset(0x5B8)] public uint bitFlags__arr366;
        [FieldOffset(0x5BC)] public uint bitFlags__arr367;
        [FieldOffset(0x5C0)] public uint bitFlags__arr368;
        [FieldOffset(0x5C4)] public uint bitFlags__arr369;
        [FieldOffset(0x5C8)] public uint bitFlags__arr370;
        [FieldOffset(0x5CC)] public uint bitFlags__arr371;
        [FieldOffset(0x5D0)] public uint bitFlags__arr372;
        [FieldOffset(0x5D4)] public uint bitFlags__arr373;
        [FieldOffset(0x5D8)] public uint bitFlags__arr374;
        [FieldOffset(0x5DC)] public uint bitFlags__arr375;
        [FieldOffset(0x5E0)] public uint bitFlags__arr376;
        [FieldOffset(0x5E4)] public uint bitFlags__arr377;
        [FieldOffset(0x5E8)] public uint bitFlags__arr378;
        [FieldOffset(0x5EC)] public uint bitFlags__arr379;
        [FieldOffset(0x5F0)] public uint bitFlags__arr380;
        [FieldOffset(0x5F4)] public uint bitFlags__arr381;
        [FieldOffset(0x5F8)] public uint bitFlags__arr382;
        [FieldOffset(0x5FC)] public uint bitFlags__arr383;
        [FieldOffset(0x600)] public uint bitFlags__arr384;
        [FieldOffset(0x604)] public uint bitFlags__arr385;
        [FieldOffset(0x608)] public uint bitFlags__arr386;
        [FieldOffset(0x60C)] public uint bitFlags__arr387;
        [FieldOffset(0x610)] public uint bitFlags__arr388;
        [FieldOffset(0x614)] public uint bitFlags__arr389;
        [FieldOffset(0x618)] public uint bitFlags__arr390;
        [FieldOffset(0x61C)] public uint bitFlags__arr391;
        [FieldOffset(0x620)] public uint bitFlags__arr392;
        [FieldOffset(0x624)] public uint bitFlags__arr393;
        [FieldOffset(0x628)] public uint bitFlags__arr394;
        [FieldOffset(0x62C)] public uint bitFlags__arr395;
        [FieldOffset(0x630)] public uint bitFlags__arr396;
        [FieldOffset(0x634)] public uint bitFlags__arr397;
        [FieldOffset(0x638)] public uint bitFlags__arr398;
        [FieldOffset(0x63C)] public uint bitFlags__arr399;
        [FieldOffset(0x640)] public uint bitFlags__arr400;
        [FieldOffset(0x644)] public uint bitFlags__arr401;
        [FieldOffset(0x648)] public uint bitFlags__arr402;
        [FieldOffset(0x64C)] public uint bitFlags__arr403;
        [FieldOffset(0x650)] public uint bitFlags__arr404;
        [FieldOffset(0x654)] public uint bitFlags__arr405;
        [FieldOffset(0x658)] public uint bitFlags__arr406;
        [FieldOffset(0x65C)] public uint bitFlags__arr407;
        [FieldOffset(0x660)] public uint bitFlags__arr408;
        [FieldOffset(0x664)] public uint bitFlags__arr409;
        [FieldOffset(0x668)] public uint bitFlags__arr410;
        [FieldOffset(0x66C)] public uint bitFlags__arr411;
        [FieldOffset(0x670)] public uint bitFlags__arr412;
        [FieldOffset(0x674)] public uint bitFlags__arr413;
        [FieldOffset(0x678)] public uint bitFlags__arr414;
        [FieldOffset(0x67C)] public uint bitFlags__arr415;
        [FieldOffset(0x680)] public uint bitFlags__arr416;
        [FieldOffset(0x684)] public uint bitFlags__arr417;
        [FieldOffset(0x688)] public uint bitFlags__arr418;
        [FieldOffset(0x68C)] public uint bitFlags__arr419;
        [FieldOffset(0x690)] public uint bitFlags__arr420;
        [FieldOffset(0x694)] public uint bitFlags__arr421;
        [FieldOffset(0x698)] public uint bitFlags__arr422;
        [FieldOffset(0x69C)] public uint bitFlags__arr423;
        [FieldOffset(0x6A0)] public uint bitFlags__arr424;
        [FieldOffset(0x6A4)] public uint bitFlags__arr425;
        [FieldOffset(0x6A8)] public uint bitFlags__arr426;
        [FieldOffset(0x6AC)] public uint bitFlags__arr427;
        [FieldOffset(0x6B0)] public uint bitFlags__arr428;
        [FieldOffset(0x6B4)] public uint bitFlags__arr429;
        [FieldOffset(0x6B8)] public uint bitFlags__arr430;
        [FieldOffset(0x6BC)] public uint bitFlags__arr431;
        [FieldOffset(0x6C0)] public uint bitFlags__arr432;
        [FieldOffset(0x6C4)] public uint bitFlags__arr433;
        [FieldOffset(0x6C8)] public uint bitFlags__arr434;
        [FieldOffset(0x6CC)] public uint bitFlags__arr435;
        [FieldOffset(0x6D0)] public uint bitFlags__arr436;
        [FieldOffset(0x6D4)] public uint bitFlags__arr437;
        [FieldOffset(0x6D8)] public uint bitFlags__arr438;
        [FieldOffset(0x6DC)] public uint bitFlags__arr439;
        [FieldOffset(0x6E0)] public uint bitFlags__arr440;
        [FieldOffset(0x6E4)] public uint bitFlags__arr441;
        [FieldOffset(0x6E8)] public uint bitFlags__arr442;
        [FieldOffset(0x6EC)] public uint bitFlags__arr443;
        [FieldOffset(0x6F0)] public uint bitFlags__arr444;
        [FieldOffset(0x6F4)] public uint bitFlags__arr445;
        [FieldOffset(0x6F8)] public uint bitFlags__arr446;
        [FieldOffset(0x6FC)] public uint bitFlags__arr447;
        [FieldOffset(0x700)] public uint bitFlags__arr448;
        [FieldOffset(0x704)] public uint bitFlags__arr449;
        [FieldOffset(0x708)] public uint bitFlags__arr450;
        [FieldOffset(0x70C)] public uint bitFlags__arr451;
        [FieldOffset(0x710)] public uint bitFlags__arr452;
        [FieldOffset(0x714)] public uint bitFlags__arr453;
        [FieldOffset(0x718)] public uint bitFlags__arr454;
        [FieldOffset(0x71C)] public uint bitFlags__arr455;
        [FieldOffset(0x720)] public uint bitFlags__arr456;
        [FieldOffset(0x724)] public uint bitFlags__arr457;
        [FieldOffset(0x728)] public uint bitFlags__arr458;
        [FieldOffset(0x72C)] public uint bitFlags__arr459;
        [FieldOffset(0x730)] public uint bitFlags__arr460;
        [FieldOffset(0x734)] public uint bitFlags__arr461;
        [FieldOffset(0x738)] public uint bitFlags__arr462;
        [FieldOffset(0x73C)] public uint bitFlags__arr463;
        [FieldOffset(0x740)] public uint bitFlags__arr464;
        [FieldOffset(0x744)] public uint bitFlags__arr465;
        [FieldOffset(0x748)] public uint bitFlags__arr466;
        [FieldOffset(0x74C)] public uint bitFlags__arr467;
        [FieldOffset(0x750)] public uint bitFlags__arr468;
        [FieldOffset(0x754)] public uint bitFlags__arr469;
        [FieldOffset(0x758)] public uint bitFlags__arr470;
        [FieldOffset(0x75C)] public uint bitFlags__arr471;
        [FieldOffset(0x760)] public uint bitFlags__arr472;
        [FieldOffset(0x764)] public uint bitFlags__arr473;
        [FieldOffset(0x768)] public uint bitFlags__arr474;
        [FieldOffset(0x76C)] public uint bitFlags__arr475;
        [FieldOffset(0x770)] public uint bitFlags__arr476;
        [FieldOffset(0x774)] public uint bitFlags__arr477;
        [FieldOffset(0x778)] public uint bitFlags__arr478;
        [FieldOffset(0x77C)] public uint bitFlags__arr479;
        [FieldOffset(0x780)] public uint bitFlags__arr480;
        [FieldOffset(0x784)] public uint bitFlags__arr481;
        [FieldOffset(0x788)] public uint bitFlags__arr482;
        [FieldOffset(0x78C)] public uint bitFlags__arr483;
        [FieldOffset(0x790)] public uint bitFlags__arr484;
        [FieldOffset(0x794)] public uint bitFlags__arr485;
        [FieldOffset(0x798)] public uint bitFlags__arr486;
        [FieldOffset(0x79C)] public uint bitFlags__arr487;
        [FieldOffset(0x7A0)] public uint bitFlags__arr488;
        [FieldOffset(0x7A4)] public uint bitFlags__arr489;
        [FieldOffset(0x7A8)] public uint bitFlags__arr490;
        [FieldOffset(0x7AC)] public uint bitFlags__arr491;
        [FieldOffset(0x7B0)] public uint bitFlags__arr492;
        [FieldOffset(0x7B4)] public uint bitFlags__arr493;
        [FieldOffset(0x7B8)] public uint bitFlags__arr494;
        [FieldOffset(0x7BC)] public uint bitFlags__arr495;
        [FieldOffset(0x7C0)] public uint bitFlags__arr496;
        [FieldOffset(0x7C4)] public uint bitFlags__arr497;
        [FieldOffset(0x7C8)] public uint bitFlags__arr498;
        [FieldOffset(0x7CC)] public uint bitFlags__arr499;
        [FieldOffset(0x7D0)] public uint bitFlags__arr500;
        [FieldOffset(0x7D4)] public uint bitFlags__arr501;
        [FieldOffset(0x7D8)] public uint bitFlags__arr502;
        [FieldOffset(0x7DC)] public uint bitFlags__arr503;
        [FieldOffset(0x7E0)] public uint bitFlags__arr504;
        [FieldOffset(0x7E4)] public uint bitFlags__arr505;
        [FieldOffset(0x7E8)] public uint bitFlags__arr506;
        [FieldOffset(0x7EC)] public uint bitFlags__arr507;
        [FieldOffset(0x7F0)] public uint bitFlags__arr508;
        [FieldOffset(0x7F4)] public uint bitFlags__arr509;
        [FieldOffset(0x7F8)] public uint bitFlags__arr510;
        [FieldOffset(0x7FC)] public uint bitFlags__arr511;
        [FieldOffset(0x800)] public uint bitFlags__arr512;
        [FieldOffset(0x804)] public uint bitFlags__arr513;
        [FieldOffset(0x808)] public uint bitFlags__arr514;
        [FieldOffset(0x80C)] public uint bitFlags__arr515;
        [FieldOffset(0x810)] public uint bitFlags__arr516;
        [FieldOffset(0x814)] public uint bitFlags__arr517;
        [FieldOffset(0x818)] public uint bitFlags__arr518;
        [FieldOffset(0x81C)] public uint bitFlags__arr519;
        [FieldOffset(0x820)] public uint bitFlags__arr520;
        [FieldOffset(0x824)] public uint bitFlags__arr521;
        [FieldOffset(0x828)] public uint bitFlags__arr522;
        [FieldOffset(0x82C)] public uint bitFlags__arr523;
        [FieldOffset(0x830)] public uint bitFlags__arr524;
        [FieldOffset(0x834)] public uint bitFlags__arr525;
        [FieldOffset(0x838)] public uint bitFlags__arr526;
        [FieldOffset(0x83C)] public uint bitFlags__arr527;
        [FieldOffset(0x840)] public uint bitFlags__arr528;
        [FieldOffset(0x844)] public uint bitFlags__arr529;
        [FieldOffset(0x848)] public uint bitFlags__arr530;
        [FieldOffset(0x84C)] public uint bitFlags__arr531;
        [FieldOffset(0x850)] public uint bitFlags__arr532;
        [FieldOffset(0x854)] public uint bitFlags__arr533;
        [FieldOffset(0x858)] public uint bitFlags__arr534;
        [FieldOffset(0x85C)] public uint bitFlags__arr535;
        [FieldOffset(0x860)] public uint bitFlags__arr536;
        [FieldOffset(0x864)] public uint bitFlags__arr537;
        [FieldOffset(0x868)] public uint bitFlags__arr538;
        [FieldOffset(0x86C)] public uint bitFlags__arr539;
        [FieldOffset(0x870)] public uint bitFlags__arr540;
        [FieldOffset(0x874)] public uint bitFlags__arr541;
        [FieldOffset(0x878)] public uint bitFlags__arr542;
        [FieldOffset(0x87C)] public uint bitFlags__arr543;
        [FieldOffset(0x880)] public uint bitFlags__arr544;
        [FieldOffset(0x884)] public uint bitFlags__arr545;
        [FieldOffset(0x888)] public uint bitFlags__arr546;
        [FieldOffset(0x88C)] public uint bitFlags__arr547;
        [FieldOffset(0x890)] public uint bitFlags__arr548;
        [FieldOffset(0x894)] public uint bitFlags__arr549;
        [FieldOffset(0x898)] public uint bitFlags__arr550;
        [FieldOffset(0x89C)] public uint bitFlags__arr551;
        [FieldOffset(0x8A0)] public uint bitFlags__arr552;
        [FieldOffset(0x8A4)] public uint bitFlags__arr553;
        [FieldOffset(0x8A8)] public uint bitFlags__arr554;
        [FieldOffset(0x8AC)] public uint bitFlags__arr555;
        [FieldOffset(0x8B0)] public uint bitFlags__arr556;
        [FieldOffset(0x8B4)] public uint bitFlags__arr557;
        [FieldOffset(0x8B8)] public uint bitFlags__arr558;
        [FieldOffset(0x8BC)] public uint bitFlags__arr559;
        [FieldOffset(0x8C0)] public uint bitFlags__arr560;
        [FieldOffset(0x8C4)] public uint bitFlags__arr561;
        [FieldOffset(0x8C8)] public uint bitFlags__arr562;
        [FieldOffset(0x8CC)] public uint bitFlags__arr563;
        [FieldOffset(0x8D0)] public uint bitFlags__arr564;
        [FieldOffset(0x8D4)] public uint bitFlags__arr565;
        [FieldOffset(0x8D8)] public uint bitFlags__arr566;
        [FieldOffset(0x8DC)] public uint bitFlags__arr567;
        [FieldOffset(0x8E0)] public uint bitFlags__arr568;
        [FieldOffset(0x8E4)] public uint bitFlags__arr569;
        [FieldOffset(0x8E8)] public uint bitFlags__arr570;
        [FieldOffset(0x8EC)] public uint bitFlags__arr571;
        [FieldOffset(0x8F0)] public uint bitFlags__arr572;
        [FieldOffset(0x8F4)] public uint bitFlags__arr573;
        [FieldOffset(0x8F8)] public uint bitFlags__arr574;
        [FieldOffset(0x8FC)] public uint bitFlags__arr575;
        [FieldOffset(0x900)] public uint bitFlags__arr576;
        [FieldOffset(0x904)] public uint bitFlags__arr577;
        [FieldOffset(0x908)] public uint bitFlags__arr578;
        [FieldOffset(0x90C)] public uint bitFlags__arr579;
        [FieldOffset(0x910)] public uint bitFlags__arr580;
        [FieldOffset(0x914)] public uint bitFlags__arr581;
        [FieldOffset(0x918)] public uint bitFlags__arr582;
        [FieldOffset(0x91C)] public uint bitFlags__arr583;
        [FieldOffset(0x920)] public uint bitFlags__arr584;
        [FieldOffset(0x924)] public uint bitFlags__arr585;
        [FieldOffset(0x928)] public uint bitFlags__arr586;
        [FieldOffset(0x92C)] public uint bitFlags__arr587;
        [FieldOffset(0x930)] public uint bitFlags__arr588;
        [FieldOffset(0x934)] public uint bitFlags__arr589;
        [FieldOffset(0x938)] public uint bitFlags__arr590;
        [FieldOffset(0x93C)] public uint bitFlags__arr591;
        [FieldOffset(0x940)] public uint bitFlags__arr592;
        [FieldOffset(0x944)] public uint bitFlags__arr593;
        [FieldOffset(0x948)] public uint bitFlags__arr594;
        [FieldOffset(0x94C)] public uint bitFlags__arr595;
        [FieldOffset(0x950)] public uint bitFlags__arr596;
        [FieldOffset(0x954)] public uint bitFlags__arr597;
        [FieldOffset(0x958)] public uint bitFlags__arr598;
        [FieldOffset(0x95C)] public uint bitFlags__arr599;
        [FieldOffset(0x960)] public uint bitFlags__arr600;
        [FieldOffset(0x964)] public uint bitFlags__arr601;
        [FieldOffset(0x968)] public uint bitFlags__arr602;
        [FieldOffset(0x96C)] public uint bitFlags__arr603;
        [FieldOffset(0x970)] public uint bitFlags__arr604;
        [FieldOffset(0x974)] public uint bitFlags__arr605;
        [FieldOffset(0x978)] public uint bitFlags__arr606;
        [FieldOffset(0x97C)] public uint bitFlags__arr607;
        [FieldOffset(0x980)] public uint bitFlags__arr608;
        [FieldOffset(0x984)] public uint bitFlags__arr609;
        [FieldOffset(0x988)] public uint bitFlags__arr610;
        [FieldOffset(0x98C)] public uint bitFlags__arr611;
        [FieldOffset(0x990)] public uint bitFlags__arr612;
        [FieldOffset(0x994)] public uint bitFlags__arr613;
        [FieldOffset(0x998)] public uint bitFlags__arr614;
        [FieldOffset(0x99C)] public uint bitFlags__arr615;
        [FieldOffset(0x9A0)] public uint bitFlags__arr616;
        [FieldOffset(0x9A4)] public uint bitFlags__arr617;
        [FieldOffset(0x9A8)] public uint bitFlags__arr618;
        [FieldOffset(0x9AC)] public uint bitFlags__arr619;
        [FieldOffset(0x9B0)] public uint bitFlags__arr620;
        [FieldOffset(0x9B4)] public uint bitFlags__arr621;
        [FieldOffset(0x9B8)] public uint bitFlags__arr622;
        [FieldOffset(0x9BC)] public uint bitFlags__arr623;
        [FieldOffset(0x9C0)] public uint bitFlags__arr624;
        [FieldOffset(0x9C4)] public uint bitFlags__arr625;
        [FieldOffset(0x9C8)] public uint bitFlags__arr626;
        [FieldOffset(0x9CC)] public uint bitFlags__arr627;
        [FieldOffset(0x9D0)] public uint bitFlags__arr628;
        [FieldOffset(0x9D4)] public uint bitFlags__arr629;
        [FieldOffset(0x9D8)] public uint bitFlags__arr630;
        [FieldOffset(0x9DC)] public uint bitFlags__arr631;
        [FieldOffset(0x9E0)] public uint bitFlags__arr632;
        [FieldOffset(0x9E4)] public uint bitFlags__arr633;
        [FieldOffset(0x9E8)] public uint bitFlags__arr634;
        [FieldOffset(0x9EC)] public uint bitFlags__arr635;
        [FieldOffset(0x9F0)] public uint bitFlags__arr636;
        [FieldOffset(0x9F4)] public uint bitFlags__arr637;
        [FieldOffset(0x9F8)] public uint bitFlags__arr638;
        [FieldOffset(0x9FC)] public uint bitFlags__arr639;
        [FieldOffset(0xA00)] public uint bitFlags__arr640;
        [FieldOffset(0xA04)] public uint bitFlags__arr641;
        [FieldOffset(0xA08)] public uint bitFlags__arr642;
        [FieldOffset(0xA0C)] public uint bitFlags__arr643;
        [FieldOffset(0xA10)] public uint bitFlags__arr644;
        [FieldOffset(0xA14)] public uint bitFlags__arr645;
        [FieldOffset(0xA18)] public uint bitFlags__arr646;
        [FieldOffset(0xA1C)] public uint bitFlags__arr647;
        [FieldOffset(0xA20)] public uint bitFlags__arr648;
        [FieldOffset(0xA24)] public uint bitFlags__arr649;
        [FieldOffset(0xA28)] public uint bitFlags__arr650;
        [FieldOffset(0xA2C)] public uint bitFlags__arr651;
        [FieldOffset(0xA30)] public uint bitFlags__arr652;
        [FieldOffset(0xA34)] public uint bitFlags__arr653;
        [FieldOffset(0xA38)] public uint bitFlags__arr654;
        [FieldOffset(0xA3C)] public uint bitFlags__arr655;
        [FieldOffset(0xA40)] public uint bitFlags__arr656;
        [FieldOffset(0xA44)] public uint bitFlags__arr657;
        [FieldOffset(0xA48)] public uint bitFlags__arr658;
        [FieldOffset(0xA4C)] public uint bitFlags__arr659;
        [FieldOffset(0xA50)] public uint bitFlags__arr660;
        [FieldOffset(0xA54)] public uint bitFlags__arr661;
        [FieldOffset(0xA58)] public uint bitFlags__arr662;
        [FieldOffset(0xA5C)] public uint bitFlags__arr663;
        [FieldOffset(0xA60)] public uint bitFlags__arr664;
        [FieldOffset(0xA64)] public uint bitFlags__arr665;
        [FieldOffset(0xA68)] public uint bitFlags__arr666;
        [FieldOffset(0xA6C)] public uint bitFlags__arr667;
        [FieldOffset(0xA70)] public uint bitFlags__arr668;
        [FieldOffset(0xA74)] public uint bitFlags__arr669;
        [FieldOffset(0xA78)] public uint bitFlags__arr670;
        [FieldOffset(0xA7C)] public uint bitFlags__arr671;
        [FieldOffset(0xA80)] public uint bitFlags__arr672;
        [FieldOffset(0xA84)] public uint bitFlags__arr673;
        [FieldOffset(0xA88)] public uint bitFlags__arr674;
        [FieldOffset(0xA8C)] public uint bitFlags__arr675;
        [FieldOffset(0xA90)] public uint bitFlags__arr676;
        [FieldOffset(0xA94)] public uint bitFlags__arr677;
        [FieldOffset(0xA98)] public uint bitFlags__arr678;
        [FieldOffset(0xA9C)] public uint bitFlags__arr679;
        [FieldOffset(0xAA0)] public uint bitFlags__arr680;
        [FieldOffset(0xAA4)] public uint bitFlags__arr681;
        [FieldOffset(0xAA8)] public uint bitFlags__arr682;
        [FieldOffset(0xAAC)] public uint bitFlags__arr683;
        [FieldOffset(0xAB0)] public uint bitFlags__arr684;
        [FieldOffset(0xAB4)] public uint bitFlags__arr685;
        [FieldOffset(0xAB8)] public uint bitFlags__arr686;
        [FieldOffset(0xABC)] public uint bitFlags__arr687;
        [FieldOffset(0xAC0)] public uint bitFlags__arr688;
        [FieldOffset(0xAC4)] public uint bitFlags__arr689;
        [FieldOffset(0xAC8)] public uint bitFlags__arr690;
        [FieldOffset(0xACC)] public uint bitFlags__arr691;
        [FieldOffset(0xAD0)] public uint bitFlags__arr692;
        [FieldOffset(0xAD4)] public uint bitFlags__arr693;
        [FieldOffset(0xAD8)] public uint bitFlags__arr694;
        [FieldOffset(0xADC)] public uint bitFlags__arr695;
        [FieldOffset(0xAE0)] public uint bitFlags__arr696;
        [FieldOffset(0xAE4)] public uint bitFlags__arr697;
        [FieldOffset(0xAE8)] public uint bitFlags__arr698;
        [FieldOffset(0xAEC)] public uint bitFlags__arr699;
        [FieldOffset(0xAF0)] public uint bitFlags__arr700;
        [FieldOffset(0xAF4)] public uint bitFlags__arr701;
        [FieldOffset(0xAF8)] public uint bitFlags__arr702;
        [FieldOffset(0xAFC)] public uint bitFlags__arr703;
        [FieldOffset(0xB00)] public uint bitFlags__arr704;
        [FieldOffset(0xB04)] public uint bitFlags__arr705;
        [FieldOffset(0xB08)] public uint bitFlags__arr706;
        [FieldOffset(0xB0C)] public uint bitFlags__arr707;
        [FieldOffset(0xB10)] public uint bitFlags__arr708;
        [FieldOffset(0xB14)] public uint bitFlags__arr709;
        [FieldOffset(0xB18)] public uint bitFlags__arr710;
        [FieldOffset(0xB1C)] public uint bitFlags__arr711;
        [FieldOffset(0xB20)] public uint bitFlags__arr712;
        [FieldOffset(0xB24)] public uint bitFlags__arr713;
        [FieldOffset(0xB28)] public uint bitFlags__arr714;
        [FieldOffset(0xB2C)] public uint bitFlags__arr715;
        [FieldOffset(0xB30)] public uint bitFlags__arr716;
        [FieldOffset(0xB34)] public uint bitFlags__arr717;
        [FieldOffset(0xB38)] public uint bitFlags__arr718;
        [FieldOffset(0xB3C)] public uint bitFlags__arr719;
        [FieldOffset(0xB40)] public uint bitFlags__arr720;
        [FieldOffset(0xB44)] public uint bitFlags__arr721;
        [FieldOffset(0xB48)] public uint bitFlags__arr722;
        [FieldOffset(0xB4C)] public uint bitFlags__arr723;
        [FieldOffset(0xB50)] public uint bitFlags__arr724;
        [FieldOffset(0xB54)] public uint bitFlags__arr725;
        [FieldOffset(0xB58)] public uint bitFlags__arr726;
        [FieldOffset(0xB5C)] public uint bitFlags__arr727;
        [FieldOffset(0xB60)] public uint bitFlags__arr728;
        [FieldOffset(0xB64)] public uint bitFlags__arr729;
        [FieldOffset(0xB68)] public uint bitFlags__arr730;
        [FieldOffset(0xB6C)] public uint bitFlags__arr731;
        [FieldOffset(0xB70)] public uint bitFlags__arr732;
        [FieldOffset(0xB74)] public uint bitFlags__arr733;
        [FieldOffset(0xB78)] public uint bitFlags__arr734;
        [FieldOffset(0xB7C)] public uint bitFlags__arr735;
        [FieldOffset(0xB80)] public uint bitFlags__arr736;
        [FieldOffset(0xB84)] public uint bitFlags__arr737;
        [FieldOffset(0xB88)] public uint bitFlags__arr738;
        [FieldOffset(0xB8C)] public uint bitFlags__arr739;
        [FieldOffset(0xB90)] public uint bitFlags__arr740;
        [FieldOffset(0xB94)] public uint bitFlags__arr741;
        [FieldOffset(0xB98)] public uint bitFlags__arr742;
        [FieldOffset(0xB9C)] public uint bitFlags__arr743;
        [FieldOffset(0xBA0)] public uint bitFlags__arr744;
        [FieldOffset(0xBA4)] public uint bitFlags__arr745;
        [FieldOffset(0xBA8)] public uint bitFlags__arr746;
        [FieldOffset(0xBAC)] public uint bitFlags__arr747;
        [FieldOffset(0xBB0)] public uint bitFlags__arr748;
        [FieldOffset(0xBB4)] public uint bitFlags__arr749;
        [FieldOffset(0xBB8)] public uint bitFlags__arr750;
        [FieldOffset(0xBBC)] public uint bitFlags__arr751;
        [FieldOffset(0xBC0)] public uint bitFlags__arr752;
        [FieldOffset(0xBC4)] public uint bitFlags__arr753;
        [FieldOffset(0xBC8)] public uint bitFlags__arr754;
        [FieldOffset(0xBCC)] public uint bitFlags__arr755;
        [FieldOffset(0xBD0)] public uint bitFlags__arr756;
        [FieldOffset(0xBD4)] public uint bitFlags__arr757;
        [FieldOffset(0xBD8)] public uint bitFlags__arr758;
        [FieldOffset(0xBDC)] public uint bitFlags__arr759;
        [FieldOffset(0xBE0)] public uint bitFlags__arr760;
        [FieldOffset(0xBE4)] public uint bitFlags__arr761;
        [FieldOffset(0xBE8)] public uint bitFlags__arr762;
        [FieldOffset(0xBEC)] public uint bitFlags__arr763;
        [FieldOffset(0xBF0)] public uint bitFlags__arr764;
        [FieldOffset(0xBF4)] public uint bitFlags__arr765;
        [FieldOffset(0xBF8)] public uint bitFlags__arr766;
        [FieldOffset(0xBFC)] public uint bitFlags__arr767;
        [FieldOffset(0xC00)] public uint bitFlags__arr768;
        [FieldOffset(0xC04)] public uint bitFlags__arr769;
        [FieldOffset(0xC08)] public uint bitFlags__arr770;
        [FieldOffset(0xC0C)] public uint bitFlags__arr771;
        [FieldOffset(0xC10)] public uint bitFlags__arr772;
        [FieldOffset(0xC14)] public uint bitFlags__arr773;
        [FieldOffset(0xC18)] public uint bitFlags__arr774;
        [FieldOffset(0xC1C)] public uint bitFlags__arr775;
        [FieldOffset(0xC20)] public uint bitFlags__arr776;
        [FieldOffset(0xC24)] public uint bitFlags__arr777;
        [FieldOffset(0xC28)] public uint bitFlags__arr778;
        [FieldOffset(0xC2C)] public uint bitFlags__arr779;
        [FieldOffset(0xC30)] public uint bitFlags__arr780;
        [FieldOffset(0xC34)] public uint bitFlags__arr781;
        [FieldOffset(0xC38)] public uint bitFlags__arr782;
        [FieldOffset(0xC3C)] public uint bitFlags__arr783;
        [FieldOffset(0xC40)] public uint bitFlags__arr784;
        [FieldOffset(0xC44)] public uint bitFlags__arr785;
        [FieldOffset(0xC48)] public uint bitFlags__arr786;
        [FieldOffset(0xC4C)] public uint bitFlags__arr787;
        [FieldOffset(0xC50)] public uint bitFlags__arr788;
        [FieldOffset(0xC54)] public uint bitFlags__arr789;
        [FieldOffset(0xC58)] public uint bitFlags__arr790;
        [FieldOffset(0xC5C)] public uint bitFlags__arr791;
        [FieldOffset(0xC60)] public uint bitFlags__arr792;
        [FieldOffset(0xC64)] public uint bitFlags__arr793;
        [FieldOffset(0xC68)] public uint bitFlags__arr794;
        [FieldOffset(0xC6C)] public uint bitFlags__arr795;
        [FieldOffset(0xC70)] public uint bitFlags__arr796;
        [FieldOffset(0xC74)] public uint bitFlags__arr797;
        [FieldOffset(0xC78)] public uint bitFlags__arr798;
        [FieldOffset(0xC7C)] public uint bitFlags__arr799;
        [FieldOffset(0xC80)] public uint bitFlags__arr800;
        [FieldOffset(0xC84)] public uint bitFlags__arr801;
        [FieldOffset(0xC88)] public uint bitFlags__arr802;
        [FieldOffset(0xC8C)] public uint bitFlags__arr803;
        [FieldOffset(0xC90)] public uint bitFlags__arr804;
        [FieldOffset(0xC94)] public uint bitFlags__arr805;
        [FieldOffset(0xC98)] public uint bitFlags__arr806;
        [FieldOffset(0xC9C)] public uint bitFlags__arr807;
        [FieldOffset(0xCA0)] public uint bitFlags__arr808;
        [FieldOffset(0xCA4)] public uint bitFlags__arr809;
        [FieldOffset(0xCA8)] public uint bitFlags__arr810;
        [FieldOffset(0xCAC)] public uint bitFlags__arr811;
        [FieldOffset(0xCB0)] public uint bitFlags__arr812;
        [FieldOffset(0xCB4)] public uint bitFlags__arr813;
        [FieldOffset(0xCB8)] public uint bitFlags__arr814;
        [FieldOffset(0xCBC)] public uint bitFlags__arr815;
        [FieldOffset(0xCC0)] public uint bitFlags__arr816;
        [FieldOffset(0xCC4)] public uint bitFlags__arr817;
        [FieldOffset(0xCC8)] public uint bitFlags__arr818;
        [FieldOffset(0xCCC)] public uint bitFlags__arr819;
        [FieldOffset(0xCD0)] public uint bitFlags__arr820;
        [FieldOffset(0xCD4)] public uint bitFlags__arr821;
        [FieldOffset(0xCD8)] public uint bitFlags__arr822;
        [FieldOffset(0xCDC)] public uint bitFlags__arr823;
        [FieldOffset(0xCE0)] public uint bitFlags__arr824;
        [FieldOffset(0xCE4)] public uint bitFlags__arr825;
        [FieldOffset(0xCE8)] public uint bitFlags__arr826;
        [FieldOffset(0xCEC)] public uint bitFlags__arr827;
        [FieldOffset(0xCF0)] public uint bitFlags__arr828;
        [FieldOffset(0xCF4)] public uint bitFlags__arr829;
        [FieldOffset(0xCF8)] public uint bitFlags__arr830;
        [FieldOffset(0xCFC)] public uint bitFlags__arr831;
        [FieldOffset(0xD00)] public uint bitFlags__arr832;
        [FieldOffset(0xD04)] public uint bitFlags__arr833;
        [FieldOffset(0xD08)] public uint bitFlags__arr834;
        [FieldOffset(0xD0C)] public uint bitFlags__arr835;
        [FieldOffset(0xD10)] public uint bitFlags__arr836;
        [FieldOffset(0xD14)] public uint bitFlags__arr837;
        [FieldOffset(0xD18)] public uint bitFlags__arr838;
        [FieldOffset(0xD1C)] public uint bitFlags__arr839;
        [FieldOffset(0xD20)] public uint bitFlags__arr840;
        [FieldOffset(0xD24)] public uint bitFlags__arr841;
        [FieldOffset(0xD28)] public uint bitFlags__arr842;
        [FieldOffset(0xD2C)] public uint bitFlags__arr843;
        [FieldOffset(0xD30)] public uint bitFlags__arr844;
        [FieldOffset(0xD34)] public uint bitFlags__arr845;
        [FieldOffset(0xD38)] public uint bitFlags__arr846;
        [FieldOffset(0xD3C)] public uint bitFlags__arr847;
        [FieldOffset(0xD40)] public uint bitFlags__arr848;
        [FieldOffset(0xD44)] public uint bitFlags__arr849;
        [FieldOffset(0xD48)] public uint bitFlags__arr850;
        [FieldOffset(0xD4C)] public uint bitFlags__arr851;
        [FieldOffset(0xD50)] public uint bitFlags__arr852;
        [FieldOffset(0xD54)] public uint bitFlags__arr853;
        [FieldOffset(0xD58)] public uint bitFlags__arr854;
        [FieldOffset(0xD5C)] public uint bitFlags__arr855;
        [FieldOffset(0xD60)] public uint bitFlags__arr856;
        [FieldOffset(0xD64)] public uint bitFlags__arr857;
        [FieldOffset(0xD68)] public uint bitFlags__arr858;
        [FieldOffset(0xD6C)] public uint bitFlags__arr859;
        [FieldOffset(0xD70)] public uint bitFlags__arr860;
        [FieldOffset(0xD74)] public uint bitFlags__arr861;
        [FieldOffset(0xD78)] public uint bitFlags__arr862;
        [FieldOffset(0xD7C)] public uint bitFlags__arr863;
        [FieldOffset(0xD80)] public uint bitFlags__arr864;
        [FieldOffset(0xD84)] public uint bitFlags__arr865;
        [FieldOffset(0xD88)] public uint bitFlags__arr866;
        [FieldOffset(0xD8C)] public uint bitFlags__arr867;
        [FieldOffset(0xD90)] public uint bitFlags__arr868;
        [FieldOffset(0xD94)] public uint bitFlags__arr869;
        [FieldOffset(0xD98)] public uint bitFlags__arr870;
        [FieldOffset(0xD9C)] public uint bitFlags__arr871;
        [FieldOffset(0xDA0)] public uint bitFlags__arr872;
        [FieldOffset(0xDA4)] public uint bitFlags__arr873;
        [FieldOffset(0xDA8)] public uint bitFlags__arr874;
        [FieldOffset(0xDAC)] public uint bitFlags__arr875;
        [FieldOffset(0xDB0)] public uint bitFlags__arr876;
        [FieldOffset(0xDB4)] public uint bitFlags__arr877;
        [FieldOffset(0xDB8)] public uint bitFlags__arr878;
        [FieldOffset(0xDBC)] public uint bitFlags__arr879;
        [FieldOffset(0xDC0)] public uint bitFlags__arr880;
        [FieldOffset(0xDC4)] public uint bitFlags__arr881;
        [FieldOffset(0xDC8)] public uint bitFlags__arr882;
        [FieldOffset(0xDCC)] public uint bitFlags__arr883;
        [FieldOffset(0xDD0)] public uint bitFlags__arr884;
        [FieldOffset(0xDD4)] public uint bitFlags__arr885;
        [FieldOffset(0xDD8)] public uint bitFlags__arr886;
        [FieldOffset(0xDDC)] public uint bitFlags__arr887;
        [FieldOffset(0xDE0)] public uint bitFlags__arr888;
        [FieldOffset(0xDE4)] public uint bitFlags__arr889;
        [FieldOffset(0xDE8)] public uint bitFlags__arr890;
        [FieldOffset(0xDEC)] public uint bitFlags__arr891;
        [FieldOffset(0xDF0)] public uint bitFlags__arr892;
        [FieldOffset(0xDF4)] public uint bitFlags__arr893;
        [FieldOffset(0xDF8)] public uint bitFlags__arr894;
        [FieldOffset(0xDFC)] public uint bitFlags__arr895;
        [FieldOffset(0xE00)] public uint bitFlags__arr896;
        [FieldOffset(0xE04)] public uint bitFlags__arr897;
        [FieldOffset(0xE08)] public uint bitFlags__arr898;
        [FieldOffset(0xE0C)] public uint bitFlags__arr899;
        [FieldOffset(0xE10)] public uint bitFlags__arr900;
        [FieldOffset(0xE14)] public uint bitFlags__arr901;
        [FieldOffset(0xE18)] public uint bitFlags__arr902;
        [FieldOffset(0xE1C)] public uint bitFlags__arr903;
        [FieldOffset(0xE20)] public uint bitFlags__arr904;
        [FieldOffset(0xE24)] public uint bitFlags__arr905;
        [FieldOffset(0xE28)] public uint bitFlags__arr906;
        [FieldOffset(0xE2C)] public uint bitFlags__arr907;
        [FieldOffset(0xE30)] public uint bitFlags__arr908;
        [FieldOffset(0xE34)] public uint bitFlags__arr909;
        [FieldOffset(0xE38)] public uint bitFlags__arr910;
        [FieldOffset(0xE3C)] public uint bitFlags__arr911;
        [FieldOffset(0xE40)] public uint bitFlags__arr912;
        [FieldOffset(0xE44)] public uint bitFlags__arr913;
        [FieldOffset(0xE48)] public uint bitFlags__arr914;
        [FieldOffset(0xE4C)] public uint bitFlags__arr915;
        [FieldOffset(0xE50)] public uint bitFlags__arr916;
        [FieldOffset(0xE54)] public uint bitFlags__arr917;
        [FieldOffset(0xE58)] public uint bitFlags__arr918;
        [FieldOffset(0xE5C)] public uint bitFlags__arr919;
        [FieldOffset(0xE60)] public uint bitFlags__arr920;
        [FieldOffset(0xE64)] public uint bitFlags__arr921;
        [FieldOffset(0xE68)] public uint bitFlags__arr922;
        [FieldOffset(0xE6C)] public uint bitFlags__arr923;
        [FieldOffset(0xE70)] public uint bitFlags__arr924;
        [FieldOffset(0xE74)] public uint bitFlags__arr925;
        [FieldOffset(0xE78)] public uint bitFlags__arr926;
        [FieldOffset(0xE7C)] public uint bitFlags__arr927;
        [FieldOffset(0xE80)] public uint bitFlags__arr928;
        [FieldOffset(0xE84)] public uint bitFlags__arr929;
        [FieldOffset(0xE88)] public uint bitFlags__arr930;
        [FieldOffset(0xE8C)] public uint bitFlags__arr931;
        [FieldOffset(0xE90)] public uint bitFlags__arr932;
        [FieldOffset(0xE94)] public uint bitFlags__arr933;
        [FieldOffset(0xE98)] public uint bitFlags__arr934;
        [FieldOffset(0xE9C)] public uint bitFlags__arr935;
        [FieldOffset(0xEA0)] public uint bitFlags__arr936;
        [FieldOffset(0xEA4)] public uint bitFlags__arr937;
        [FieldOffset(0xEA8)] public uint bitFlags__arr938;
        [FieldOffset(0xEAC)] public uint bitFlags__arr939;
        [FieldOffset(0xEB0)] public uint bitFlags__arr940;
        [FieldOffset(0xEB4)] public uint bitFlags__arr941;
        [FieldOffset(0xEB8)] public uint bitFlags__arr942;
        [FieldOffset(0xEBC)] public uint bitFlags__arr943;
        [FieldOffset(0xEC0)] public uint bitFlags__arr944;
        [FieldOffset(0xEC4)] public uint bitFlags__arr945;
        [FieldOffset(0xEC8)] public uint bitFlags__arr946;
        [FieldOffset(0xECC)] public uint bitFlags__arr947;
        [FieldOffset(0xED0)] public uint bitFlags__arr948;
        [FieldOffset(0xED4)] public uint bitFlags__arr949;
        [FieldOffset(0xED8)] public uint bitFlags__arr950;
        [FieldOffset(0xEDC)] public uint bitFlags__arr951;
        [FieldOffset(0xEE0)] public uint bitFlags__arr952;
        [FieldOffset(0xEE4)] public uint bitFlags__arr953;
        [FieldOffset(0xEE8)] public uint bitFlags__arr954;
        [FieldOffset(0xEEC)] public uint bitFlags__arr955;
        [FieldOffset(0xEF0)] public uint bitFlags__arr956;
        [FieldOffset(0xEF4)] public uint bitFlags__arr957;
        [FieldOffset(0xEF8)] public uint bitFlags__arr958;
        [FieldOffset(0xEFC)] public uint bitFlags__arr959;
        [FieldOffset(0xF00)] public uint bitFlags__arr960;
        [FieldOffset(0xF04)] public uint bitFlags__arr961;
        [FieldOffset(0xF08)] public uint bitFlags__arr962;
        [FieldOffset(0xF0C)] public uint bitFlags__arr963;
        [FieldOffset(0xF10)] public uint bitFlags__arr964;
        [FieldOffset(0xF14)] public uint bitFlags__arr965;
        [FieldOffset(0xF18)] public uint bitFlags__arr966;
        [FieldOffset(0xF1C)] public uint bitFlags__arr967;
        [FieldOffset(0xF20)] public uint bitFlags__arr968;
        [FieldOffset(0xF24)] public uint bitFlags__arr969;
        [FieldOffset(0xF28)] public uint bitFlags__arr970;
        [FieldOffset(0xF2C)] public uint bitFlags__arr971;
        [FieldOffset(0xF30)] public uint bitFlags__arr972;
        [FieldOffset(0xF34)] public uint bitFlags__arr973;
        [FieldOffset(0xF38)] public uint bitFlags__arr974;
        [FieldOffset(0xF3C)] public uint bitFlags__arr975;
        [FieldOffset(0xF40)] public uint bitFlags__arr976;
        [FieldOffset(0xF44)] public uint bitFlags__arr977;
        [FieldOffset(0xF48)] public uint bitFlags__arr978;
        [FieldOffset(0xF4C)] public uint bitFlags__arr979;
        [FieldOffset(0xF50)] public uint bitFlags__arr980;
        [FieldOffset(0xF54)] public uint bitFlags__arr981;
        [FieldOffset(0xF58)] public uint bitFlags__arr982;
        [FieldOffset(0xF5C)] public uint bitFlags__arr983;
        [FieldOffset(0xF60)] public uint bitFlags__arr984;
        [FieldOffset(0xF64)] public uint bitFlags__arr985;
        [FieldOffset(0xF68)] public uint bitFlags__arr986;
        [FieldOffset(0xF6C)] public uint bitFlags__arr987;
        [FieldOffset(0xF70)] public uint bitFlags__arr988;
        [FieldOffset(0xF74)] public uint bitFlags__arr989;
        [FieldOffset(0xF78)] public uint bitFlags__arr990;
        [FieldOffset(0xF7C)] public uint bitFlags__arr991;
        [FieldOffset(0xF80)] public uint bitFlags__arr992;
        [FieldOffset(0xF84)] public uint bitFlags__arr993;
        [FieldOffset(0xF88)] public uint bitFlags__arr994;
        [FieldOffset(0xF8C)] public uint bitFlags__arr995;
        [FieldOffset(0xF90)] public uint bitFlags__arr996;
        [FieldOffset(0xF94)] public uint bitFlags__arr997;
        [FieldOffset(0xF98)] public uint bitFlags__arr998;
        [FieldOffset(0xF9C)] public uint bitFlags__arr999;
        [FieldOffset(0xFA0)] public uint bitFlags__arr1000;
        [FieldOffset(0xFA4)] public uint bitFlags__arr1001;
        [FieldOffset(0xFA8)] public uint bitFlags__arr1002;
        [FieldOffset(0xFAC)] public uint bitFlags__arr1003;
        [FieldOffset(0xFB0)] public uint bitFlags__arr1004;
        [FieldOffset(0xFB4)] public uint bitFlags__arr1005;
        [FieldOffset(0xFB8)] public uint bitFlags__arr1006;
        [FieldOffset(0xFBC)] public uint bitFlags__arr1007;
        [FieldOffset(0xFC0)] public uint bitFlags__arr1008;
        [FieldOffset(0xFC4)] public uint bitFlags__arr1009;
        [FieldOffset(0xFC8)] public uint bitFlags__arr1010;
        [FieldOffset(0xFCC)] public uint bitFlags__arr1011;
        [FieldOffset(0xFD0)] public uint bitFlags__arr1012;
        [FieldOffset(0xFD4)] public uint bitFlags__arr1013;
        [FieldOffset(0xFD8)] public uint bitFlags__arr1014;
        [FieldOffset(0xFDC)] public uint bitFlags__arr1015;
        [FieldOffset(0xFE0)] public uint bitFlags__arr1016;
        [FieldOffset(0xFE4)] public uint bitFlags__arr1017;
        [FieldOffset(0xFE8)] public uint bitFlags__arr1018;
        [FieldOffset(0xFEC)] public uint bitFlags__arr1019;
        [FieldOffset(0xFF0)] public uint bitFlags__arr1020;
        [FieldOffset(0xFF4)] public uint bitFlags__arr1021;
        [FieldOffset(0xFF8)] public uint bitFlags__arr1022;
        [FieldOffset(0xFFC)] public uint bitFlags__arr1023;
        [FieldOffset(0x1000)] public sbyte byteFlags__arr0;
        [FieldOffset(0x1001)] public sbyte byteFlags__arr1;
        [FieldOffset(0x1002)] public sbyte byteFlags__arr2;
        [FieldOffset(0x1003)] public sbyte byteFlags__arr3;
        [FieldOffset(0x1004)] public sbyte byteFlags__arr4;
        [FieldOffset(0x1005)] public sbyte byteFlags__arr5;
        [FieldOffset(0x1006)] public sbyte byteFlags__arr6;
        [FieldOffset(0x1007)] public sbyte byteFlags__arr7;
        [FieldOffset(0x1008)] public sbyte byteFlags__arr8;
        [FieldOffset(0x1009)] public sbyte byteFlags__arr9;
        [FieldOffset(0x100A)] public sbyte byteFlags__arr10;
        [FieldOffset(0x100B)] public sbyte byteFlags__arr11;
        [FieldOffset(0x100C)] public sbyte byteFlags__arr12;
        [FieldOffset(0x100D)] public sbyte byteFlags__arr13;
        [FieldOffset(0x100E)] public sbyte byteFlags__arr14;
        [FieldOffset(0x100F)] public sbyte byteFlags__arr15;
        [FieldOffset(0x1010)] public sbyte byteFlags__arr16;
        [FieldOffset(0x1011)] public sbyte byteFlags__arr17;
        [FieldOffset(0x1012)] public sbyte byteFlags__arr18;
        [FieldOffset(0x1013)] public sbyte byteFlags__arr19;
        [FieldOffset(0x1014)] public sbyte byteFlags__arr20;
        [FieldOffset(0x1015)] public sbyte byteFlags__arr21;
        [FieldOffset(0x1016)] public sbyte byteFlags__arr22;
        [FieldOffset(0x1017)] public sbyte byteFlags__arr23;
        [FieldOffset(0x1018)] public sbyte byteFlags__arr24;
        [FieldOffset(0x1019)] public sbyte byteFlags__arr25;
        [FieldOffset(0x101A)] public sbyte byteFlags__arr26;
        [FieldOffset(0x101B)] public sbyte byteFlags__arr27;
        [FieldOffset(0x101C)] public sbyte byteFlags__arr28;
        [FieldOffset(0x101D)] public sbyte byteFlags__arr29;
        [FieldOffset(0x101E)] public sbyte byteFlags__arr30;
        [FieldOffset(0x101F)] public sbyte byteFlags__arr31;
        [FieldOffset(0x1020)] public sbyte byteFlags__arr32;
        [FieldOffset(0x1021)] public sbyte byteFlags__arr33;
        [FieldOffset(0x1022)] public sbyte byteFlags__arr34;
        [FieldOffset(0x1023)] public sbyte byteFlags__arr35;
        [FieldOffset(0x1024)] public sbyte byteFlags__arr36;
        [FieldOffset(0x1025)] public sbyte byteFlags__arr37;
        [FieldOffset(0x1026)] public sbyte byteFlags__arr38;
        [FieldOffset(0x1027)] public sbyte byteFlags__arr39;
        [FieldOffset(0x1028)] public sbyte byteFlags__arr40;
        [FieldOffset(0x1029)] public sbyte byteFlags__arr41;
        [FieldOffset(0x102A)] public sbyte byteFlags__arr42;
        [FieldOffset(0x102B)] public sbyte byteFlags__arr43;
        [FieldOffset(0x102C)] public sbyte byteFlags__arr44;
        [FieldOffset(0x102D)] public sbyte byteFlags__arr45;
        [FieldOffset(0x102E)] public sbyte byteFlags__arr46;
        [FieldOffset(0x102F)] public sbyte byteFlags__arr47;
        [FieldOffset(0x1030)] public sbyte byteFlags__arr48;
        [FieldOffset(0x1031)] public sbyte byteFlags__arr49;
        [FieldOffset(0x1032)] public sbyte byteFlags__arr50;
        [FieldOffset(0x1033)] public sbyte byteFlags__arr51;
        [FieldOffset(0x1034)] public sbyte byteFlags__arr52;
        [FieldOffset(0x1035)] public sbyte byteFlags__arr53;
        [FieldOffset(0x1036)] public sbyte byteFlags__arr54;
        [FieldOffset(0x1037)] public sbyte byteFlags__arr55;
        [FieldOffset(0x1038)] public sbyte byteFlags__arr56;
        [FieldOffset(0x1039)] public sbyte byteFlags__arr57;
        [FieldOffset(0x103A)] public sbyte byteFlags__arr58;
        [FieldOffset(0x103B)] public sbyte byteFlags__arr59;
        [FieldOffset(0x103C)] public sbyte byteFlags__arr60;
        [FieldOffset(0x103D)] public sbyte byteFlags__arr61;
        [FieldOffset(0x103E)] public sbyte byteFlags__arr62;
        [FieldOffset(0x103F)] public sbyte byteFlags__arr63;
        [FieldOffset(0x1040)] public sbyte byteFlags__arr64;
        [FieldOffset(0x1041)] public sbyte byteFlags__arr65;
        [FieldOffset(0x1042)] public sbyte byteFlags__arr66;
        [FieldOffset(0x1043)] public sbyte byteFlags__arr67;
        [FieldOffset(0x1044)] public sbyte byteFlags__arr68;
        [FieldOffset(0x1045)] public sbyte byteFlags__arr69;
        [FieldOffset(0x1046)] public sbyte byteFlags__arr70;
        [FieldOffset(0x1047)] public sbyte byteFlags__arr71;
        [FieldOffset(0x1048)] public sbyte byteFlags__arr72;
        [FieldOffset(0x1049)] public sbyte byteFlags__arr73;
        [FieldOffset(0x104A)] public sbyte byteFlags__arr74;
        [FieldOffset(0x104B)] public sbyte byteFlags__arr75;
        [FieldOffset(0x104C)] public sbyte byteFlags__arr76;
        [FieldOffset(0x104D)] public sbyte byteFlags__arr77;
        [FieldOffset(0x104E)] public sbyte byteFlags__arr78;
        [FieldOffset(0x104F)] public sbyte byteFlags__arr79;
        [FieldOffset(0x1050)] public sbyte byteFlags__arr80;
        [FieldOffset(0x1051)] public sbyte byteFlags__arr81;
        [FieldOffset(0x1052)] public sbyte byteFlags__arr82;
        [FieldOffset(0x1053)] public sbyte byteFlags__arr83;
        [FieldOffset(0x1054)] public sbyte byteFlags__arr84;
        [FieldOffset(0x1055)] public sbyte byteFlags__arr85;
        [FieldOffset(0x1056)] public sbyte byteFlags__arr86;
        [FieldOffset(0x1057)] public sbyte byteFlags__arr87;
        [FieldOffset(0x1058)] public sbyte byteFlags__arr88;
        [FieldOffset(0x1059)] public sbyte byteFlags__arr89;
        [FieldOffset(0x105A)] public sbyte byteFlags__arr90;
        [FieldOffset(0x105B)] public sbyte byteFlags__arr91;
        [FieldOffset(0x105C)] public sbyte byteFlags__arr92;
        [FieldOffset(0x105D)] public sbyte byteFlags__arr93;
        [FieldOffset(0x105E)] public sbyte byteFlags__arr94;
        [FieldOffset(0x105F)] public sbyte byteFlags__arr95;
        [FieldOffset(0x1060)] public sbyte byteFlags__arr96;
        [FieldOffset(0x1061)] public sbyte byteFlags__arr97;
        [FieldOffset(0x1062)] public sbyte byteFlags__arr98;
        [FieldOffset(0x1063)] public sbyte byteFlags__arr99;
        [FieldOffset(0x1064)] public sbyte byteFlags__arr100;
        [FieldOffset(0x1065)] public sbyte byteFlags__arr101;
        [FieldOffset(0x1066)] public sbyte byteFlags__arr102;
        [FieldOffset(0x1067)] public sbyte byteFlags__arr103;
        [FieldOffset(0x1068)] public sbyte byteFlags__arr104;
        [FieldOffset(0x1069)] public sbyte byteFlags__arr105;
        [FieldOffset(0x106A)] public sbyte byteFlags__arr106;
        [FieldOffset(0x106B)] public sbyte byteFlags__arr107;
        [FieldOffset(0x106C)] public sbyte byteFlags__arr108;
        [FieldOffset(0x106D)] public sbyte byteFlags__arr109;
        [FieldOffset(0x106E)] public sbyte byteFlags__arr110;
        [FieldOffset(0x106F)] public sbyte byteFlags__arr111;
        [FieldOffset(0x1070)] public sbyte byteFlags__arr112;
        [FieldOffset(0x1071)] public sbyte byteFlags__arr113;
        [FieldOffset(0x1072)] public sbyte byteFlags__arr114;
        [FieldOffset(0x1073)] public sbyte byteFlags__arr115;
        [FieldOffset(0x1074)] public sbyte byteFlags__arr116;
        [FieldOffset(0x1075)] public sbyte byteFlags__arr117;
        [FieldOffset(0x1076)] public sbyte byteFlags__arr118;
        [FieldOffset(0x1077)] public sbyte byteFlags__arr119;
        [FieldOffset(0x1078)] public sbyte byteFlags__arr120;
        [FieldOffset(0x1079)] public sbyte byteFlags__arr121;
        [FieldOffset(0x107A)] public sbyte byteFlags__arr122;
        [FieldOffset(0x107B)] public sbyte byteFlags__arr123;
        [FieldOffset(0x107C)] public sbyte byteFlags__arr124;
        [FieldOffset(0x107D)] public sbyte byteFlags__arr125;
        [FieldOffset(0x107E)] public sbyte byteFlags__arr126;
        [FieldOffset(0x107F)] public sbyte byteFlags__arr127;
        [FieldOffset(0x1080)] public sbyte byteFlags__arr128;
        [FieldOffset(0x1081)] public sbyte byteFlags__arr129;
        [FieldOffset(0x1082)] public sbyte byteFlags__arr130;
        [FieldOffset(0x1083)] public sbyte byteFlags__arr131;
        [FieldOffset(0x1084)] public sbyte byteFlags__arr132;
        [FieldOffset(0x1085)] public sbyte byteFlags__arr133;
        [FieldOffset(0x1086)] public sbyte byteFlags__arr134;
        [FieldOffset(0x1087)] public sbyte byteFlags__arr135;
        [FieldOffset(0x1088)] public sbyte byteFlags__arr136;
        [FieldOffset(0x1089)] public sbyte byteFlags__arr137;
        [FieldOffset(0x108A)] public sbyte byteFlags__arr138;
        [FieldOffset(0x108B)] public sbyte byteFlags__arr139;
        [FieldOffset(0x108C)] public sbyte byteFlags__arr140;
        [FieldOffset(0x108D)] public sbyte byteFlags__arr141;
        [FieldOffset(0x108E)] public sbyte byteFlags__arr142;
        [FieldOffset(0x108F)] public sbyte byteFlags__arr143;
        [FieldOffset(0x1090)] public sbyte byteFlags__arr144;
        [FieldOffset(0x1091)] public sbyte byteFlags__arr145;
        [FieldOffset(0x1092)] public sbyte byteFlags__arr146;
        [FieldOffset(0x1093)] public sbyte byteFlags__arr147;
        [FieldOffset(0x1094)] public sbyte byteFlags__arr148;
        [FieldOffset(0x1095)] public sbyte byteFlags__arr149;
        [FieldOffset(0x1096)] public sbyte byteFlags__arr150;
        [FieldOffset(0x1097)] public sbyte byteFlags__arr151;
        [FieldOffset(0x1098)] public sbyte byteFlags__arr152;
        [FieldOffset(0x1099)] public sbyte byteFlags__arr153;
        [FieldOffset(0x109A)] public sbyte byteFlags__arr154;
        [FieldOffset(0x109B)] public sbyte byteFlags__arr155;
        [FieldOffset(0x109C)] public sbyte byteFlags__arr156;
        [FieldOffset(0x109D)] public sbyte byteFlags__arr157;
        [FieldOffset(0x109E)] public sbyte byteFlags__arr158;
        [FieldOffset(0x109F)] public sbyte byteFlags__arr159;
        [FieldOffset(0x10A0)] public sbyte byteFlags__arr160;
        [FieldOffset(0x10A1)] public sbyte byteFlags__arr161;
        [FieldOffset(0x10A2)] public sbyte byteFlags__arr162;
        [FieldOffset(0x10A3)] public sbyte byteFlags__arr163;
        [FieldOffset(0x10A4)] public sbyte byteFlags__arr164;
        [FieldOffset(0x10A5)] public sbyte byteFlags__arr165;
        [FieldOffset(0x10A6)] public sbyte byteFlags__arr166;
        [FieldOffset(0x10A7)] public sbyte byteFlags__arr167;
        [FieldOffset(0x10A8)] public sbyte byteFlags__arr168;
        [FieldOffset(0x10A9)] public sbyte byteFlags__arr169;
        [FieldOffset(0x10AA)] public sbyte byteFlags__arr170;
        [FieldOffset(0x10AB)] public sbyte byteFlags__arr171;
        [FieldOffset(0x10AC)] public sbyte byteFlags__arr172;
        [FieldOffset(0x10AD)] public sbyte byteFlags__arr173;
        [FieldOffset(0x10AE)] public sbyte byteFlags__arr174;
        [FieldOffset(0x10AF)] public sbyte byteFlags__arr175;
        [FieldOffset(0x10B0)] public sbyte byteFlags__arr176;
        [FieldOffset(0x10B1)] public sbyte byteFlags__arr177;
        [FieldOffset(0x10B2)] public sbyte byteFlags__arr178;
        [FieldOffset(0x10B3)] public sbyte byteFlags__arr179;
        [FieldOffset(0x10B4)] public sbyte byteFlags__arr180;
        [FieldOffset(0x10B5)] public sbyte byteFlags__arr181;
        [FieldOffset(0x10B6)] public sbyte byteFlags__arr182;
        [FieldOffset(0x10B7)] public sbyte byteFlags__arr183;
        [FieldOffset(0x10B8)] public sbyte byteFlags__arr184;
        [FieldOffset(0x10B9)] public sbyte byteFlags__arr185;
        [FieldOffset(0x10BA)] public sbyte byteFlags__arr186;
        [FieldOffset(0x10BB)] public sbyte byteFlags__arr187;
        [FieldOffset(0x10BC)] public sbyte byteFlags__arr188;
        [FieldOffset(0x10BD)] public sbyte byteFlags__arr189;
        [FieldOffset(0x10BE)] public sbyte byteFlags__arr190;
        [FieldOffset(0x10BF)] public sbyte byteFlags__arr191;
        [FieldOffset(0x10C0)] public sbyte byteFlags__arr192;
        [FieldOffset(0x10C1)] public sbyte byteFlags__arr193;
        [FieldOffset(0x10C2)] public sbyte byteFlags__arr194;
        [FieldOffset(0x10C3)] public sbyte byteFlags__arr195;
        [FieldOffset(0x10C4)] public sbyte byteFlags__arr196;
        [FieldOffset(0x10C5)] public sbyte byteFlags__arr197;
        [FieldOffset(0x10C6)] public sbyte byteFlags__arr198;
        [FieldOffset(0x10C7)] public sbyte byteFlags__arr199;
        [FieldOffset(0x10C8)] public sbyte byteFlags__arr200;
        [FieldOffset(0x10C9)] public sbyte byteFlags__arr201;
        [FieldOffset(0x10CA)] public sbyte byteFlags__arr202;
        [FieldOffset(0x10CB)] public sbyte byteFlags__arr203;
        [FieldOffset(0x10CC)] public sbyte byteFlags__arr204;
        [FieldOffset(0x10CD)] public sbyte byteFlags__arr205;
        [FieldOffset(0x10CE)] public sbyte byteFlags__arr206;
        [FieldOffset(0x10CF)] public sbyte byteFlags__arr207;
        [FieldOffset(0x10D0)] public sbyte byteFlags__arr208;
        [FieldOffset(0x10D1)] public sbyte byteFlags__arr209;
        [FieldOffset(0x10D2)] public sbyte byteFlags__arr210;
        [FieldOffset(0x10D3)] public sbyte byteFlags__arr211;
        [FieldOffset(0x10D4)] public sbyte byteFlags__arr212;
        [FieldOffset(0x10D5)] public sbyte byteFlags__arr213;
        [FieldOffset(0x10D6)] public sbyte byteFlags__arr214;
        [FieldOffset(0x10D7)] public sbyte byteFlags__arr215;
        [FieldOffset(0x10D8)] public sbyte byteFlags__arr216;
        [FieldOffset(0x10D9)] public sbyte byteFlags__arr217;
        [FieldOffset(0x10DA)] public sbyte byteFlags__arr218;
        [FieldOffset(0x10DB)] public sbyte byteFlags__arr219;
        [FieldOffset(0x10DC)] public sbyte byteFlags__arr220;
        [FieldOffset(0x10DD)] public sbyte byteFlags__arr221;
        [FieldOffset(0x10DE)] public sbyte byteFlags__arr222;
        [FieldOffset(0x10DF)] public sbyte byteFlags__arr223;
        [FieldOffset(0x10E0)] public sbyte byteFlags__arr224;
        [FieldOffset(0x10E1)] public sbyte byteFlags__arr225;
        [FieldOffset(0x10E2)] public sbyte byteFlags__arr226;
        [FieldOffset(0x10E3)] public sbyte byteFlags__arr227;
        [FieldOffset(0x10E4)] public sbyte byteFlags__arr228;
        [FieldOffset(0x10E5)] public sbyte byteFlags__arr229;
        [FieldOffset(0x10E6)] public sbyte byteFlags__arr230;
        [FieldOffset(0x10E7)] public sbyte byteFlags__arr231;
        [FieldOffset(0x10E8)] public sbyte byteFlags__arr232;
        [FieldOffset(0x10E9)] public sbyte byteFlags__arr233;
        [FieldOffset(0x10EA)] public sbyte byteFlags__arr234;
        [FieldOffset(0x10EB)] public sbyte byteFlags__arr235;
        [FieldOffset(0x10EC)] public sbyte byteFlags__arr236;
        [FieldOffset(0x10ED)] public sbyte byteFlags__arr237;
        [FieldOffset(0x10EE)] public sbyte byteFlags__arr238;
        [FieldOffset(0x10EF)] public sbyte byteFlags__arr239;
        [FieldOffset(0x10F0)] public sbyte byteFlags__arr240;
        [FieldOffset(0x10F1)] public sbyte byteFlags__arr241;
        [FieldOffset(0x10F2)] public sbyte byteFlags__arr242;
        [FieldOffset(0x10F3)] public sbyte byteFlags__arr243;
        [FieldOffset(0x10F4)] public sbyte byteFlags__arr244;
        [FieldOffset(0x10F5)] public sbyte byteFlags__arr245;
        [FieldOffset(0x10F6)] public sbyte byteFlags__arr246;
        [FieldOffset(0x10F7)] public sbyte byteFlags__arr247;
        [FieldOffset(0x10F8)] public sbyte byteFlags__arr248;
        [FieldOffset(0x10F9)] public sbyte byteFlags__arr249;
        [FieldOffset(0x10FA)] public sbyte byteFlags__arr250;
        [FieldOffset(0x10FB)] public sbyte byteFlags__arr251;
        [FieldOffset(0x10FC)] public sbyte byteFlags__arr252;
        [FieldOffset(0x10FD)] public sbyte byteFlags__arr253;
        [FieldOffset(0x10FE)] public sbyte byteFlags__arr254;
        [FieldOffset(0x10FF)] public sbyte byteFlags__arr255;
        [FieldOffset(0x1100)] public sbyte byteFlags__arr256;
        [FieldOffset(0x1101)] public sbyte byteFlags__arr257;
        [FieldOffset(0x1102)] public sbyte byteFlags__arr258;
        [FieldOffset(0x1103)] public sbyte byteFlags__arr259;
        [FieldOffset(0x1104)] public sbyte byteFlags__arr260;
        [FieldOffset(0x1105)] public sbyte byteFlags__arr261;
        [FieldOffset(0x1106)] public sbyte byteFlags__arr262;
        [FieldOffset(0x1107)] public sbyte byteFlags__arr263;
        [FieldOffset(0x1108)] public sbyte byteFlags__arr264;
        [FieldOffset(0x1109)] public sbyte byteFlags__arr265;
        [FieldOffset(0x110A)] public sbyte byteFlags__arr266;
        [FieldOffset(0x110B)] public sbyte byteFlags__arr267;
        [FieldOffset(0x110C)] public sbyte byteFlags__arr268;
        [FieldOffset(0x110D)] public sbyte byteFlags__arr269;
        [FieldOffset(0x110E)] public sbyte byteFlags__arr270;
        [FieldOffset(0x110F)] public sbyte byteFlags__arr271;
        [FieldOffset(0x1110)] public sbyte byteFlags__arr272;
        [FieldOffset(0x1111)] public sbyte byteFlags__arr273;
        [FieldOffset(0x1112)] public sbyte byteFlags__arr274;
        [FieldOffset(0x1113)] public sbyte byteFlags__arr275;
        [FieldOffset(0x1114)] public sbyte byteFlags__arr276;
        [FieldOffset(0x1115)] public sbyte byteFlags__arr277;
        [FieldOffset(0x1116)] public sbyte byteFlags__arr278;
        [FieldOffset(0x1117)] public sbyte byteFlags__arr279;
        [FieldOffset(0x1118)] public sbyte byteFlags__arr280;
        [FieldOffset(0x1119)] public sbyte byteFlags__arr281;
        [FieldOffset(0x111A)] public sbyte byteFlags__arr282;
        [FieldOffset(0x111B)] public sbyte byteFlags__arr283;
        [FieldOffset(0x111C)] public sbyte byteFlags__arr284;
        [FieldOffset(0x111D)] public sbyte byteFlags__arr285;
        [FieldOffset(0x111E)] public sbyte byteFlags__arr286;
        [FieldOffset(0x111F)] public sbyte byteFlags__arr287;
        [FieldOffset(0x1120)] public sbyte byteFlags__arr288;
        [FieldOffset(0x1121)] public sbyte byteFlags__arr289;
        [FieldOffset(0x1122)] public sbyte byteFlags__arr290;
        [FieldOffset(0x1123)] public sbyte byteFlags__arr291;
        [FieldOffset(0x1124)] public sbyte byteFlags__arr292;
        [FieldOffset(0x1125)] public sbyte byteFlags__arr293;
        [FieldOffset(0x1126)] public sbyte byteFlags__arr294;
        [FieldOffset(0x1127)] public sbyte byteFlags__arr295;
        [FieldOffset(0x1128)] public sbyte byteFlags__arr296;
        [FieldOffset(0x1129)] public sbyte byteFlags__arr297;
        [FieldOffset(0x112A)] public sbyte byteFlags__arr298;
        [FieldOffset(0x112B)] public sbyte byteFlags__arr299;
        [FieldOffset(0x112C)] public sbyte byteFlags__arr300;
        [FieldOffset(0x112D)] public sbyte byteFlags__arr301;
        [FieldOffset(0x112E)] public sbyte byteFlags__arr302;
        [FieldOffset(0x112F)] public sbyte byteFlags__arr303;
        [FieldOffset(0x1130)] public sbyte byteFlags__arr304;
        [FieldOffset(0x1131)] public sbyte byteFlags__arr305;
        [FieldOffset(0x1132)] public sbyte byteFlags__arr306;
        [FieldOffset(0x1133)] public sbyte byteFlags__arr307;
        [FieldOffset(0x1134)] public sbyte byteFlags__arr308;
        [FieldOffset(0x1135)] public sbyte byteFlags__arr309;
        [FieldOffset(0x1136)] public sbyte byteFlags__arr310;
        [FieldOffset(0x1137)] public sbyte byteFlags__arr311;
        [FieldOffset(0x1138)] public sbyte byteFlags__arr312;
        [FieldOffset(0x1139)] public sbyte byteFlags__arr313;
        [FieldOffset(0x113A)] public sbyte byteFlags__arr314;
        [FieldOffset(0x113B)] public sbyte byteFlags__arr315;
        [FieldOffset(0x113C)] public sbyte byteFlags__arr316;
        [FieldOffset(0x113D)] public sbyte byteFlags__arr317;
        [FieldOffset(0x113E)] public sbyte byteFlags__arr318;
        [FieldOffset(0x113F)] public sbyte byteFlags__arr319;
        [FieldOffset(0x1140)] public sbyte byteFlags__arr320;
        [FieldOffset(0x1141)] public sbyte byteFlags__arr321;
        [FieldOffset(0x1142)] public sbyte byteFlags__arr322;
        [FieldOffset(0x1143)] public sbyte byteFlags__arr323;
        [FieldOffset(0x1144)] public sbyte byteFlags__arr324;
        [FieldOffset(0x1145)] public sbyte byteFlags__arr325;
        [FieldOffset(0x1146)] public sbyte byteFlags__arr326;
        [FieldOffset(0x1147)] public sbyte byteFlags__arr327;
        [FieldOffset(0x1148)] public sbyte byteFlags__arr328;
        [FieldOffset(0x1149)] public sbyte byteFlags__arr329;
        [FieldOffset(0x114A)] public sbyte byteFlags__arr330;
        [FieldOffset(0x114B)] public sbyte byteFlags__arr331;
        [FieldOffset(0x114C)] public sbyte byteFlags__arr332;
        [FieldOffset(0x114D)] public sbyte byteFlags__arr333;
        [FieldOffset(0x114E)] public sbyte byteFlags__arr334;
        [FieldOffset(0x114F)] public sbyte byteFlags__arr335;
        [FieldOffset(0x1150)] public sbyte byteFlags__arr336;
        [FieldOffset(0x1151)] public sbyte byteFlags__arr337;
        [FieldOffset(0x1152)] public sbyte byteFlags__arr338;
        [FieldOffset(0x1153)] public sbyte byteFlags__arr339;
        [FieldOffset(0x1154)] public sbyte byteFlags__arr340;
        [FieldOffset(0x1155)] public sbyte byteFlags__arr341;
        [FieldOffset(0x1156)] public sbyte byteFlags__arr342;
        [FieldOffset(0x1157)] public sbyte byteFlags__arr343;
        [FieldOffset(0x1158)] public sbyte byteFlags__arr344;
        [FieldOffset(0x1159)] public sbyte byteFlags__arr345;
        [FieldOffset(0x115A)] public sbyte byteFlags__arr346;
        [FieldOffset(0x115B)] public sbyte byteFlags__arr347;
        [FieldOffset(0x115C)] public sbyte byteFlags__arr348;
        [FieldOffset(0x115D)] public sbyte byteFlags__arr349;
        [FieldOffset(0x115E)] public sbyte byteFlags__arr350;
        [FieldOffset(0x115F)] public sbyte byteFlags__arr351;
        [FieldOffset(0x1160)] public sbyte byteFlags__arr352;
        [FieldOffset(0x1161)] public sbyte byteFlags__arr353;
        [FieldOffset(0x1162)] public sbyte byteFlags__arr354;
        [FieldOffset(0x1163)] public sbyte byteFlags__arr355;
        [FieldOffset(0x1164)] public sbyte byteFlags__arr356;
        [FieldOffset(0x1165)] public sbyte byteFlags__arr357;
        [FieldOffset(0x1166)] public sbyte byteFlags__arr358;
        [FieldOffset(0x1167)] public sbyte byteFlags__arr359;
        [FieldOffset(0x1168)] public sbyte byteFlags__arr360;
        [FieldOffset(0x1169)] public sbyte byteFlags__arr361;
        [FieldOffset(0x116A)] public sbyte byteFlags__arr362;
        [FieldOffset(0x116B)] public sbyte byteFlags__arr363;
        [FieldOffset(0x116C)] public sbyte byteFlags__arr364;
        [FieldOffset(0x116D)] public sbyte byteFlags__arr365;
        [FieldOffset(0x116E)] public sbyte byteFlags__arr366;
        [FieldOffset(0x116F)] public sbyte byteFlags__arr367;
        [FieldOffset(0x1170)] public sbyte byteFlags__arr368;
        [FieldOffset(0x1171)] public sbyte byteFlags__arr369;
        [FieldOffset(0x1172)] public sbyte byteFlags__arr370;
        [FieldOffset(0x1173)] public sbyte byteFlags__arr371;
        [FieldOffset(0x1174)] public sbyte byteFlags__arr372;
        [FieldOffset(0x1175)] public sbyte byteFlags__arr373;
        [FieldOffset(0x1176)] public sbyte byteFlags__arr374;
        [FieldOffset(0x1177)] public sbyte byteFlags__arr375;
        [FieldOffset(0x1178)] public sbyte byteFlags__arr376;
        [FieldOffset(0x1179)] public sbyte byteFlags__arr377;
        [FieldOffset(0x117A)] public sbyte byteFlags__arr378;
        [FieldOffset(0x117B)] public sbyte byteFlags__arr379;
        [FieldOffset(0x117C)] public sbyte byteFlags__arr380;
        [FieldOffset(0x117D)] public sbyte byteFlags__arr381;
        [FieldOffset(0x117E)] public sbyte byteFlags__arr382;
        [FieldOffset(0x117F)] public sbyte byteFlags__arr383;
        [FieldOffset(0x1180)] public sbyte byteFlags__arr384;
        [FieldOffset(0x1181)] public sbyte byteFlags__arr385;
        [FieldOffset(0x1182)] public sbyte byteFlags__arr386;
        [FieldOffset(0x1183)] public sbyte byteFlags__arr387;
        [FieldOffset(0x1184)] public sbyte byteFlags__arr388;
        [FieldOffset(0x1185)] public sbyte byteFlags__arr389;
        [FieldOffset(0x1186)] public sbyte byteFlags__arr390;
        [FieldOffset(0x1187)] public sbyte byteFlags__arr391;
        [FieldOffset(0x1188)] public sbyte byteFlags__arr392;
        [FieldOffset(0x1189)] public sbyte byteFlags__arr393;
        [FieldOffset(0x118A)] public sbyte byteFlags__arr394;
        [FieldOffset(0x118B)] public sbyte byteFlags__arr395;
        [FieldOffset(0x118C)] public sbyte byteFlags__arr396;
        [FieldOffset(0x118D)] public sbyte byteFlags__arr397;
        [FieldOffset(0x118E)] public sbyte byteFlags__arr398;
        [FieldOffset(0x118F)] public sbyte byteFlags__arr399;
        [FieldOffset(0x1190)] public sbyte byteFlags__arr400;
        [FieldOffset(0x1191)] public sbyte byteFlags__arr401;
        [FieldOffset(0x1192)] public sbyte byteFlags__arr402;
        [FieldOffset(0x1193)] public sbyte byteFlags__arr403;
        [FieldOffset(0x1194)] public sbyte byteFlags__arr404;
        [FieldOffset(0x1195)] public sbyte byteFlags__arr405;
        [FieldOffset(0x1196)] public sbyte byteFlags__arr406;
        [FieldOffset(0x1197)] public sbyte byteFlags__arr407;
        [FieldOffset(0x1198)] public sbyte byteFlags__arr408;
        [FieldOffset(0x1199)] public sbyte byteFlags__arr409;
        [FieldOffset(0x119A)] public sbyte byteFlags__arr410;
        [FieldOffset(0x119B)] public sbyte byteFlags__arr411;
        [FieldOffset(0x119C)] public sbyte byteFlags__arr412;
        [FieldOffset(0x119D)] public sbyte byteFlags__arr413;
        [FieldOffset(0x119E)] public sbyte byteFlags__arr414;
        [FieldOffset(0x119F)] public sbyte byteFlags__arr415;
        [FieldOffset(0x11A0)] public sbyte byteFlags__arr416;
        [FieldOffset(0x11A1)] public sbyte byteFlags__arr417;
        [FieldOffset(0x11A2)] public sbyte byteFlags__arr418;
        [FieldOffset(0x11A3)] public sbyte byteFlags__arr419;
        [FieldOffset(0x11A4)] public sbyte byteFlags__arr420;
        [FieldOffset(0x11A5)] public sbyte byteFlags__arr421;
        [FieldOffset(0x11A6)] public sbyte byteFlags__arr422;
        [FieldOffset(0x11A7)] public sbyte byteFlags__arr423;
        [FieldOffset(0x11A8)] public sbyte byteFlags__arr424;
        [FieldOffset(0x11A9)] public sbyte byteFlags__arr425;
        [FieldOffset(0x11AA)] public sbyte byteFlags__arr426;
        [FieldOffset(0x11AB)] public sbyte byteFlags__arr427;
        [FieldOffset(0x11AC)] public sbyte byteFlags__arr428;
        [FieldOffset(0x11AD)] public sbyte byteFlags__arr429;
        [FieldOffset(0x11AE)] public sbyte byteFlags__arr430;
        [FieldOffset(0x11AF)] public sbyte byteFlags__arr431;
        [FieldOffset(0x11B0)] public sbyte byteFlags__arr432;
        [FieldOffset(0x11B1)] public sbyte byteFlags__arr433;
        [FieldOffset(0x11B2)] public sbyte byteFlags__arr434;
        [FieldOffset(0x11B3)] public sbyte byteFlags__arr435;
        [FieldOffset(0x11B4)] public sbyte byteFlags__arr436;
        [FieldOffset(0x11B5)] public sbyte byteFlags__arr437;
        [FieldOffset(0x11B6)] public sbyte byteFlags__arr438;
        [FieldOffset(0x11B7)] public sbyte byteFlags__arr439;
        [FieldOffset(0x11B8)] public sbyte byteFlags__arr440;
        [FieldOffset(0x11B9)] public sbyte byteFlags__arr441;
        [FieldOffset(0x11BA)] public sbyte byteFlags__arr442;
        [FieldOffset(0x11BB)] public sbyte byteFlags__arr443;
        [FieldOffset(0x11BC)] public sbyte byteFlags__arr444;
        [FieldOffset(0x11BD)] public sbyte byteFlags__arr445;
        [FieldOffset(0x11BE)] public sbyte byteFlags__arr446;
        [FieldOffset(0x11BF)] public sbyte byteFlags__arr447;
        [FieldOffset(0x11C0)] public sbyte byteFlags__arr448;
        [FieldOffset(0x11C1)] public sbyte byteFlags__arr449;
        [FieldOffset(0x11C2)] public sbyte byteFlags__arr450;
        [FieldOffset(0x11C3)] public sbyte byteFlags__arr451;
        [FieldOffset(0x11C4)] public sbyte byteFlags__arr452;
        [FieldOffset(0x11C5)] public sbyte byteFlags__arr453;
        [FieldOffset(0x11C6)] public sbyte byteFlags__arr454;
        [FieldOffset(0x11C7)] public sbyte byteFlags__arr455;
        [FieldOffset(0x11C8)] public sbyte byteFlags__arr456;
        [FieldOffset(0x11C9)] public sbyte byteFlags__arr457;
        [FieldOffset(0x11CA)] public sbyte byteFlags__arr458;
        [FieldOffset(0x11CB)] public sbyte byteFlags__arr459;
        [FieldOffset(0x11CC)] public sbyte byteFlags__arr460;
        [FieldOffset(0x11CD)] public sbyte byteFlags__arr461;
        [FieldOffset(0x11CE)] public sbyte byteFlags__arr462;
        [FieldOffset(0x11CF)] public sbyte byteFlags__arr463;
        [FieldOffset(0x11D0)] public sbyte byteFlags__arr464;
        [FieldOffset(0x11D1)] public sbyte byteFlags__arr465;
        [FieldOffset(0x11D2)] public sbyte byteFlags__arr466;
        [FieldOffset(0x11D3)] public sbyte byteFlags__arr467;
        [FieldOffset(0x11D4)] public sbyte byteFlags__arr468;
        [FieldOffset(0x11D5)] public sbyte byteFlags__arr469;
        [FieldOffset(0x11D6)] public sbyte byteFlags__arr470;
        [FieldOffset(0x11D7)] public sbyte byteFlags__arr471;
        [FieldOffset(0x11D8)] public sbyte byteFlags__arr472;
        [FieldOffset(0x11D9)] public sbyte byteFlags__arr473;
        [FieldOffset(0x11DA)] public sbyte byteFlags__arr474;
        [FieldOffset(0x11DB)] public sbyte byteFlags__arr475;
        [FieldOffset(0x11DC)] public sbyte byteFlags__arr476;
        [FieldOffset(0x11DD)] public sbyte byteFlags__arr477;
        [FieldOffset(0x11DE)] public sbyte byteFlags__arr478;
        [FieldOffset(0x11DF)] public sbyte byteFlags__arr479;
        [FieldOffset(0x11E0)] public sbyte byteFlags__arr480;
        [FieldOffset(0x11E1)] public sbyte byteFlags__arr481;
        [FieldOffset(0x11E2)] public sbyte byteFlags__arr482;
        [FieldOffset(0x11E3)] public sbyte byteFlags__arr483;
        [FieldOffset(0x11E4)] public sbyte byteFlags__arr484;
        [FieldOffset(0x11E5)] public sbyte byteFlags__arr485;
        [FieldOffset(0x11E6)] public sbyte byteFlags__arr486;
        [FieldOffset(0x11E7)] public sbyte byteFlags__arr487;
        [FieldOffset(0x11E8)] public sbyte byteFlags__arr488;
        [FieldOffset(0x11E9)] public sbyte byteFlags__arr489;
        [FieldOffset(0x11EA)] public sbyte byteFlags__arr490;
        [FieldOffset(0x11EB)] public sbyte byteFlags__arr491;
        [FieldOffset(0x11EC)] public sbyte byteFlags__arr492;
        [FieldOffset(0x11ED)] public sbyte byteFlags__arr493;
        [FieldOffset(0x11EE)] public sbyte byteFlags__arr494;
        [FieldOffset(0x11EF)] public sbyte byteFlags__arr495;
        [FieldOffset(0x11F0)] public sbyte byteFlags__arr496;
        [FieldOffset(0x11F1)] public sbyte byteFlags__arr497;
        [FieldOffset(0x11F2)] public sbyte byteFlags__arr498;
        [FieldOffset(0x11F3)] public sbyte byteFlags__arr499;
        [FieldOffset(0x11F4)] public sbyte byteFlags__arr500;
        [FieldOffset(0x11F5)] public sbyte byteFlags__arr501;
        [FieldOffset(0x11F6)] public sbyte byteFlags__arr502;
        [FieldOffset(0x11F7)] public sbyte byteFlags__arr503;
        [FieldOffset(0x11F8)] public sbyte byteFlags__arr504;
        [FieldOffset(0x11F9)] public sbyte byteFlags__arr505;
        [FieldOffset(0x11FA)] public sbyte byteFlags__arr506;
        [FieldOffset(0x11FB)] public sbyte byteFlags__arr507;
        [FieldOffset(0x11FC)] public sbyte byteFlags__arr508;
        [FieldOffset(0x11FD)] public sbyte byteFlags__arr509;
        [FieldOffset(0x11FE)] public sbyte byteFlags__arr510;
        [FieldOffset(0x11FF)] public sbyte byteFlags__arr511;
        [FieldOffset(0x1200)] public sbyte byteFlags__arr512;
        [FieldOffset(0x1201)] public sbyte byteFlags__arr513;
        [FieldOffset(0x1202)] public sbyte byteFlags__arr514;
        [FieldOffset(0x1203)] public sbyte byteFlags__arr515;
        [FieldOffset(0x1204)] public sbyte byteFlags__arr516;
        [FieldOffset(0x1205)] public sbyte byteFlags__arr517;
        [FieldOffset(0x1206)] public sbyte byteFlags__arr518;
        [FieldOffset(0x1207)] public sbyte byteFlags__arr519;
        [FieldOffset(0x1208)] public sbyte byteFlags__arr520;
        [FieldOffset(0x1209)] public sbyte byteFlags__arr521;
        [FieldOffset(0x120A)] public sbyte byteFlags__arr522;
        [FieldOffset(0x120B)] public sbyte byteFlags__arr523;
        [FieldOffset(0x120C)] public sbyte byteFlags__arr524;
        [FieldOffset(0x120D)] public sbyte byteFlags__arr525;
        [FieldOffset(0x120E)] public sbyte byteFlags__arr526;
        [FieldOffset(0x120F)] public sbyte byteFlags__arr527;
        [FieldOffset(0x1210)] public sbyte byteFlags__arr528;
        [FieldOffset(0x1211)] public sbyte byteFlags__arr529;
        [FieldOffset(0x1212)] public sbyte byteFlags__arr530;
        [FieldOffset(0x1213)] public sbyte byteFlags__arr531;
        [FieldOffset(0x1214)] public sbyte byteFlags__arr532;
        [FieldOffset(0x1215)] public sbyte byteFlags__arr533;
        [FieldOffset(0x1216)] public sbyte byteFlags__arr534;
        [FieldOffset(0x1217)] public sbyte byteFlags__arr535;
        [FieldOffset(0x1218)] public sbyte byteFlags__arr536;
        [FieldOffset(0x1219)] public sbyte byteFlags__arr537;
        [FieldOffset(0x121A)] public sbyte byteFlags__arr538;
        [FieldOffset(0x121B)] public sbyte byteFlags__arr539;
        [FieldOffset(0x121C)] public sbyte byteFlags__arr540;
        [FieldOffset(0x121D)] public sbyte byteFlags__arr541;
        [FieldOffset(0x121E)] public sbyte byteFlags__arr542;
        [FieldOffset(0x121F)] public sbyte byteFlags__arr543;
        [FieldOffset(0x1220)] public sbyte byteFlags__arr544;
        [FieldOffset(0x1221)] public sbyte byteFlags__arr545;
        [FieldOffset(0x1222)] public sbyte byteFlags__arr546;
        [FieldOffset(0x1223)] public sbyte byteFlags__arr547;
        [FieldOffset(0x1224)] public sbyte byteFlags__arr548;
        [FieldOffset(0x1225)] public sbyte byteFlags__arr549;
        [FieldOffset(0x1226)] public sbyte byteFlags__arr550;
        [FieldOffset(0x1227)] public sbyte byteFlags__arr551;
        [FieldOffset(0x1228)] public sbyte byteFlags__arr552;
        [FieldOffset(0x1229)] public sbyte byteFlags__arr553;
        [FieldOffset(0x122A)] public sbyte byteFlags__arr554;
        [FieldOffset(0x122B)] public sbyte byteFlags__arr555;
        [FieldOffset(0x122C)] public sbyte byteFlags__arr556;
        [FieldOffset(0x122D)] public sbyte byteFlags__arr557;
        [FieldOffset(0x122E)] public sbyte byteFlags__arr558;
        [FieldOffset(0x122F)] public sbyte byteFlags__arr559;
        [FieldOffset(0x1230)] public sbyte byteFlags__arr560;
        [FieldOffset(0x1231)] public sbyte byteFlags__arr561;
        [FieldOffset(0x1232)] public sbyte byteFlags__arr562;
        [FieldOffset(0x1233)] public sbyte byteFlags__arr563;
        [FieldOffset(0x1234)] public sbyte byteFlags__arr564;
        [FieldOffset(0x1235)] public sbyte byteFlags__arr565;
        [FieldOffset(0x1236)] public sbyte byteFlags__arr566;
        [FieldOffset(0x1237)] public sbyte byteFlags__arr567;
        [FieldOffset(0x1238)] public sbyte byteFlags__arr568;
        [FieldOffset(0x1239)] public sbyte byteFlags__arr569;
        [FieldOffset(0x123A)] public sbyte byteFlags__arr570;
        [FieldOffset(0x123B)] public sbyte byteFlags__arr571;
        [FieldOffset(0x123C)] public sbyte byteFlags__arr572;
        [FieldOffset(0x123D)] public sbyte byteFlags__arr573;
        [FieldOffset(0x123E)] public sbyte byteFlags__arr574;
        [FieldOffset(0x123F)] public sbyte byteFlags__arr575;
        [FieldOffset(0x1240)] public sbyte byteFlags__arr576;
        [FieldOffset(0x1241)] public sbyte byteFlags__arr577;
        [FieldOffset(0x1242)] public sbyte byteFlags__arr578;
        [FieldOffset(0x1243)] public sbyte byteFlags__arr579;
        [FieldOffset(0x1244)] public sbyte byteFlags__arr580;
        [FieldOffset(0x1245)] public sbyte byteFlags__arr581;
        [FieldOffset(0x1246)] public sbyte byteFlags__arr582;
        [FieldOffset(0x1247)] public sbyte byteFlags__arr583;
        [FieldOffset(0x1248)] public sbyte byteFlags__arr584;
        [FieldOffset(0x1249)] public sbyte byteFlags__arr585;
        [FieldOffset(0x124A)] public sbyte byteFlags__arr586;
        [FieldOffset(0x124B)] public sbyte byteFlags__arr587;
        [FieldOffset(0x124C)] public sbyte byteFlags__arr588;
        [FieldOffset(0x124D)] public sbyte byteFlags__arr589;
        [FieldOffset(0x124E)] public sbyte byteFlags__arr590;
        [FieldOffset(0x124F)] public sbyte byteFlags__arr591;
        [FieldOffset(0x1250)] public sbyte byteFlags__arr592;
        [FieldOffset(0x1251)] public sbyte byteFlags__arr593;
        [FieldOffset(0x1252)] public sbyte byteFlags__arr594;
        [FieldOffset(0x1253)] public sbyte byteFlags__arr595;
        [FieldOffset(0x1254)] public sbyte byteFlags__arr596;
        [FieldOffset(0x1255)] public sbyte byteFlags__arr597;
        [FieldOffset(0x1256)] public sbyte byteFlags__arr598;
        [FieldOffset(0x1257)] public sbyte byteFlags__arr599;
        [FieldOffset(0x1258)] public sbyte byteFlags__arr600;
        [FieldOffset(0x1259)] public sbyte byteFlags__arr601;
        [FieldOffset(0x125A)] public sbyte byteFlags__arr602;
        [FieldOffset(0x125B)] public sbyte byteFlags__arr603;
        [FieldOffset(0x125C)] public sbyte byteFlags__arr604;
        [FieldOffset(0x125D)] public sbyte byteFlags__arr605;
        [FieldOffset(0x125E)] public sbyte byteFlags__arr606;
        [FieldOffset(0x125F)] public sbyte byteFlags__arr607;
        [FieldOffset(0x1260)] public sbyte byteFlags__arr608;
        [FieldOffset(0x1261)] public sbyte byteFlags__arr609;
        [FieldOffset(0x1262)] public sbyte byteFlags__arr610;
        [FieldOffset(0x1263)] public sbyte byteFlags__arr611;
        [FieldOffset(0x1264)] public sbyte byteFlags__arr612;
        [FieldOffset(0x1265)] public sbyte byteFlags__arr613;
        [FieldOffset(0x1266)] public sbyte byteFlags__arr614;
        [FieldOffset(0x1267)] public sbyte byteFlags__arr615;
        [FieldOffset(0x1268)] public sbyte byteFlags__arr616;
        [FieldOffset(0x1269)] public sbyte byteFlags__arr617;
        [FieldOffset(0x126A)] public sbyte byteFlags__arr618;
        [FieldOffset(0x126B)] public sbyte byteFlags__arr619;
        [FieldOffset(0x126C)] public sbyte byteFlags__arr620;
        [FieldOffset(0x126D)] public sbyte byteFlags__arr621;
        [FieldOffset(0x126E)] public sbyte byteFlags__arr622;
        [FieldOffset(0x126F)] public sbyte byteFlags__arr623;
        [FieldOffset(0x1270)] public sbyte byteFlags__arr624;
        [FieldOffset(0x1271)] public sbyte byteFlags__arr625;
        [FieldOffset(0x1272)] public sbyte byteFlags__arr626;
        [FieldOffset(0x1273)] public sbyte byteFlags__arr627;
        [FieldOffset(0x1274)] public sbyte byteFlags__arr628;
        [FieldOffset(0x1275)] public sbyte byteFlags__arr629;
        [FieldOffset(0x1276)] public sbyte byteFlags__arr630;
        [FieldOffset(0x1277)] public sbyte byteFlags__arr631;
        [FieldOffset(0x1278)] public sbyte byteFlags__arr632;
        [FieldOffset(0x1279)] public sbyte byteFlags__arr633;
        [FieldOffset(0x127A)] public sbyte byteFlags__arr634;
        [FieldOffset(0x127B)] public sbyte byteFlags__arr635;
        [FieldOffset(0x127C)] public sbyte byteFlags__arr636;
        [FieldOffset(0x127D)] public sbyte byteFlags__arr637;
        [FieldOffset(0x127E)] public sbyte byteFlags__arr638;
        [FieldOffset(0x127F)] public sbyte byteFlags__arr639;
        [FieldOffset(0x1280)] public sbyte byteFlags__arr640;
        [FieldOffset(0x1281)] public sbyte byteFlags__arr641;
        [FieldOffset(0x1282)] public sbyte byteFlags__arr642;
        [FieldOffset(0x1283)] public sbyte byteFlags__arr643;
        [FieldOffset(0x1284)] public sbyte byteFlags__arr644;
        [FieldOffset(0x1285)] public sbyte byteFlags__arr645;
        [FieldOffset(0x1286)] public sbyte byteFlags__arr646;
        [FieldOffset(0x1287)] public sbyte byteFlags__arr647;
        [FieldOffset(0x1288)] public sbyte byteFlags__arr648;
        [FieldOffset(0x1289)] public sbyte byteFlags__arr649;
        [FieldOffset(0x128A)] public sbyte byteFlags__arr650;
        [FieldOffset(0x128B)] public sbyte byteFlags__arr651;
        [FieldOffset(0x128C)] public sbyte byteFlags__arr652;
        [FieldOffset(0x128D)] public sbyte byteFlags__arr653;
        [FieldOffset(0x128E)] public sbyte byteFlags__arr654;
        [FieldOffset(0x128F)] public sbyte byteFlags__arr655;
        [FieldOffset(0x1290)] public sbyte byteFlags__arr656;
        [FieldOffset(0x1291)] public sbyte byteFlags__arr657;
        [FieldOffset(0x1292)] public sbyte byteFlags__arr658;
        [FieldOffset(0x1293)] public sbyte byteFlags__arr659;
        [FieldOffset(0x1294)] public sbyte byteFlags__arr660;
        [FieldOffset(0x1295)] public sbyte byteFlags__arr661;
        [FieldOffset(0x1296)] public sbyte byteFlags__arr662;
        [FieldOffset(0x1297)] public sbyte byteFlags__arr663;
        [FieldOffset(0x1298)] public sbyte byteFlags__arr664;
        [FieldOffset(0x1299)] public sbyte byteFlags__arr665;
        [FieldOffset(0x129A)] public sbyte byteFlags__arr666;
        [FieldOffset(0x129B)] public sbyte byteFlags__arr667;
        [FieldOffset(0x129C)] public sbyte byteFlags__arr668;
        [FieldOffset(0x129D)] public sbyte byteFlags__arr669;
        [FieldOffset(0x129E)] public sbyte byteFlags__arr670;
        [FieldOffset(0x129F)] public sbyte byteFlags__arr671;
        [FieldOffset(0x12A0)] public sbyte byteFlags__arr672;
        [FieldOffset(0x12A1)] public sbyte byteFlags__arr673;
        [FieldOffset(0x12A2)] public sbyte byteFlags__arr674;
        [FieldOffset(0x12A3)] public sbyte byteFlags__arr675;
        [FieldOffset(0x12A4)] public sbyte byteFlags__arr676;
        [FieldOffset(0x12A5)] public sbyte byteFlags__arr677;
        [FieldOffset(0x12A6)] public sbyte byteFlags__arr678;
        [FieldOffset(0x12A7)] public sbyte byteFlags__arr679;
        [FieldOffset(0x12A8)] public sbyte byteFlags__arr680;
        [FieldOffset(0x12A9)] public sbyte byteFlags__arr681;
        [FieldOffset(0x12AA)] public sbyte byteFlags__arr682;
        [FieldOffset(0x12AB)] public sbyte byteFlags__arr683;
        [FieldOffset(0x12AC)] public sbyte byteFlags__arr684;
        [FieldOffset(0x12AD)] public sbyte byteFlags__arr685;
        [FieldOffset(0x12AE)] public sbyte byteFlags__arr686;
        [FieldOffset(0x12AF)] public sbyte byteFlags__arr687;
        [FieldOffset(0x12B0)] public sbyte byteFlags__arr688;
        [FieldOffset(0x12B1)] public sbyte byteFlags__arr689;
        [FieldOffset(0x12B2)] public sbyte byteFlags__arr690;
        [FieldOffset(0x12B3)] public sbyte byteFlags__arr691;
        [FieldOffset(0x12B4)] public sbyte byteFlags__arr692;
        [FieldOffset(0x12B5)] public sbyte byteFlags__arr693;
        [FieldOffset(0x12B6)] public sbyte byteFlags__arr694;
        [FieldOffset(0x12B7)] public sbyte byteFlags__arr695;
        [FieldOffset(0x12B8)] public sbyte byteFlags__arr696;
        [FieldOffset(0x12B9)] public sbyte byteFlags__arr697;
        [FieldOffset(0x12BA)] public sbyte byteFlags__arr698;
        [FieldOffset(0x12BB)] public sbyte byteFlags__arr699;
        [FieldOffset(0x12BC)] public sbyte byteFlags__arr700;
        [FieldOffset(0x12BD)] public sbyte byteFlags__arr701;
        [FieldOffset(0x12BE)] public sbyte byteFlags__arr702;
        [FieldOffset(0x12BF)] public sbyte byteFlags__arr703;
        [FieldOffset(0x12C0)] public sbyte byteFlags__arr704;
        [FieldOffset(0x12C1)] public sbyte byteFlags__arr705;
        [FieldOffset(0x12C2)] public sbyte byteFlags__arr706;
        [FieldOffset(0x12C3)] public sbyte byteFlags__arr707;
        [FieldOffset(0x12C4)] public sbyte byteFlags__arr708;
        [FieldOffset(0x12C5)] public sbyte byteFlags__arr709;
        [FieldOffset(0x12C6)] public sbyte byteFlags__arr710;
        [FieldOffset(0x12C7)] public sbyte byteFlags__arr711;
        [FieldOffset(0x12C8)] public sbyte byteFlags__arr712;
        [FieldOffset(0x12C9)] public sbyte byteFlags__arr713;
        [FieldOffset(0x12CA)] public sbyte byteFlags__arr714;
        [FieldOffset(0x12CB)] public sbyte byteFlags__arr715;
        [FieldOffset(0x12CC)] public sbyte byteFlags__arr716;
        [FieldOffset(0x12CD)] public sbyte byteFlags__arr717;
        [FieldOffset(0x12CE)] public sbyte byteFlags__arr718;
        [FieldOffset(0x12CF)] public sbyte byteFlags__arr719;
        [FieldOffset(0x12D0)] public sbyte byteFlags__arr720;
        [FieldOffset(0x12D1)] public sbyte byteFlags__arr721;
        [FieldOffset(0x12D2)] public sbyte byteFlags__arr722;
        [FieldOffset(0x12D3)] public sbyte byteFlags__arr723;
        [FieldOffset(0x12D4)] public sbyte byteFlags__arr724;
        [FieldOffset(0x12D5)] public sbyte byteFlags__arr725;
        [FieldOffset(0x12D6)] public sbyte byteFlags__arr726;
        [FieldOffset(0x12D7)] public sbyte byteFlags__arr727;
        [FieldOffset(0x12D8)] public sbyte byteFlags__arr728;
        [FieldOffset(0x12D9)] public sbyte byteFlags__arr729;
        [FieldOffset(0x12DA)] public sbyte byteFlags__arr730;
        [FieldOffset(0x12DB)] public sbyte byteFlags__arr731;
        [FieldOffset(0x12DC)] public sbyte byteFlags__arr732;
        [FieldOffset(0x12DD)] public sbyte byteFlags__arr733;
        [FieldOffset(0x12DE)] public sbyte byteFlags__arr734;
        [FieldOffset(0x12DF)] public sbyte byteFlags__arr735;
        [FieldOffset(0x12E0)] public sbyte byteFlags__arr736;
        [FieldOffset(0x12E1)] public sbyte byteFlags__arr737;
        [FieldOffset(0x12E2)] public sbyte byteFlags__arr738;
        [FieldOffset(0x12E3)] public sbyte byteFlags__arr739;
        [FieldOffset(0x12E4)] public sbyte byteFlags__arr740;
        [FieldOffset(0x12E5)] public sbyte byteFlags__arr741;
        [FieldOffset(0x12E6)] public sbyte byteFlags__arr742;
        [FieldOffset(0x12E7)] public sbyte byteFlags__arr743;
        [FieldOffset(0x12E8)] public sbyte byteFlags__arr744;
        [FieldOffset(0x12E9)] public sbyte byteFlags__arr745;
        [FieldOffset(0x12EA)] public sbyte byteFlags__arr746;
        [FieldOffset(0x12EB)] public sbyte byteFlags__arr747;
        [FieldOffset(0x12EC)] public sbyte byteFlags__arr748;
        [FieldOffset(0x12ED)] public sbyte byteFlags__arr749;
        [FieldOffset(0x12EE)] public sbyte byteFlags__arr750;
        [FieldOffset(0x12EF)] public sbyte byteFlags__arr751;
        [FieldOffset(0x12F0)] public sbyte byteFlags__arr752;
        [FieldOffset(0x12F1)] public sbyte byteFlags__arr753;
        [FieldOffset(0x12F2)] public sbyte byteFlags__arr754;
        [FieldOffset(0x12F3)] public sbyte byteFlags__arr755;
        [FieldOffset(0x12F4)] public sbyte byteFlags__arr756;
        [FieldOffset(0x12F5)] public sbyte byteFlags__arr757;
        [FieldOffset(0x12F6)] public sbyte byteFlags__arr758;
        [FieldOffset(0x12F7)] public sbyte byteFlags__arr759;
        [FieldOffset(0x12F8)] public sbyte byteFlags__arr760;
        [FieldOffset(0x12F9)] public sbyte byteFlags__arr761;
        [FieldOffset(0x12FA)] public sbyte byteFlags__arr762;
        [FieldOffset(0x12FB)] public sbyte byteFlags__arr763;
        [FieldOffset(0x12FC)] public sbyte byteFlags__arr764;
        [FieldOffset(0x12FD)] public sbyte byteFlags__arr765;
        [FieldOffset(0x12FE)] public sbyte byteFlags__arr766;
        [FieldOffset(0x12FF)] public sbyte byteFlags__arr767;
        [FieldOffset(0x1300)] public sbyte byteFlags__arr768;
        [FieldOffset(0x1301)] public sbyte byteFlags__arr769;
        [FieldOffset(0x1302)] public sbyte byteFlags__arr770;
        [FieldOffset(0x1303)] public sbyte byteFlags__arr771;
        [FieldOffset(0x1304)] public sbyte byteFlags__arr772;
        [FieldOffset(0x1305)] public sbyte byteFlags__arr773;
        [FieldOffset(0x1306)] public sbyte byteFlags__arr774;
        [FieldOffset(0x1307)] public sbyte byteFlags__arr775;
        [FieldOffset(0x1308)] public sbyte byteFlags__arr776;
        [FieldOffset(0x1309)] public sbyte byteFlags__arr777;
        [FieldOffset(0x130A)] public sbyte byteFlags__arr778;
        [FieldOffset(0x130B)] public sbyte byteFlags__arr779;
        [FieldOffset(0x130C)] public sbyte byteFlags__arr780;
        [FieldOffset(0x130D)] public sbyte byteFlags__arr781;
        [FieldOffset(0x130E)] public sbyte byteFlags__arr782;
        [FieldOffset(0x130F)] public sbyte byteFlags__arr783;
        [FieldOffset(0x1310)] public sbyte byteFlags__arr784;
        [FieldOffset(0x1311)] public sbyte byteFlags__arr785;
        [FieldOffset(0x1312)] public sbyte byteFlags__arr786;
        [FieldOffset(0x1313)] public sbyte byteFlags__arr787;
        [FieldOffset(0x1314)] public sbyte byteFlags__arr788;
        [FieldOffset(0x1315)] public sbyte byteFlags__arr789;
        [FieldOffset(0x1316)] public sbyte byteFlags__arr790;
        [FieldOffset(0x1317)] public sbyte byteFlags__arr791;
        [FieldOffset(0x1318)] public sbyte byteFlags__arr792;
        [FieldOffset(0x1319)] public sbyte byteFlags__arr793;
        [FieldOffset(0x131A)] public sbyte byteFlags__arr794;
        [FieldOffset(0x131B)] public sbyte byteFlags__arr795;
        [FieldOffset(0x131C)] public sbyte byteFlags__arr796;
        [FieldOffset(0x131D)] public sbyte byteFlags__arr797;
        [FieldOffset(0x131E)] public sbyte byteFlags__arr798;
        [FieldOffset(0x131F)] public sbyte byteFlags__arr799;
        [FieldOffset(0x1320)] public sbyte byteFlags__arr800;
        [FieldOffset(0x1321)] public sbyte byteFlags__arr801;
        [FieldOffset(0x1322)] public sbyte byteFlags__arr802;
        [FieldOffset(0x1323)] public sbyte byteFlags__arr803;
        [FieldOffset(0x1324)] public sbyte byteFlags__arr804;
        [FieldOffset(0x1325)] public sbyte byteFlags__arr805;
        [FieldOffset(0x1326)] public sbyte byteFlags__arr806;
        [FieldOffset(0x1327)] public sbyte byteFlags__arr807;
        [FieldOffset(0x1328)] public sbyte byteFlags__arr808;
        [FieldOffset(0x1329)] public sbyte byteFlags__arr809;
        [FieldOffset(0x132A)] public sbyte byteFlags__arr810;
        [FieldOffset(0x132B)] public sbyte byteFlags__arr811;
        [FieldOffset(0x132C)] public sbyte byteFlags__arr812;
        [FieldOffset(0x132D)] public sbyte byteFlags__arr813;
        [FieldOffset(0x132E)] public sbyte byteFlags__arr814;
        [FieldOffset(0x132F)] public sbyte byteFlags__arr815;
        [FieldOffset(0x1330)] public sbyte byteFlags__arr816;
        [FieldOffset(0x1331)] public sbyte byteFlags__arr817;
        [FieldOffset(0x1332)] public sbyte byteFlags__arr818;
        [FieldOffset(0x1333)] public sbyte byteFlags__arr819;
        [FieldOffset(0x1334)] public sbyte byteFlags__arr820;
        [FieldOffset(0x1335)] public sbyte byteFlags__arr821;
        [FieldOffset(0x1336)] public sbyte byteFlags__arr822;
        [FieldOffset(0x1337)] public sbyte byteFlags__arr823;
        [FieldOffset(0x1338)] public sbyte byteFlags__arr824;
        [FieldOffset(0x1339)] public sbyte byteFlags__arr825;
        [FieldOffset(0x133A)] public sbyte byteFlags__arr826;
        [FieldOffset(0x133B)] public sbyte byteFlags__arr827;
        [FieldOffset(0x133C)] public sbyte byteFlags__arr828;
        [FieldOffset(0x133D)] public sbyte byteFlags__arr829;
        [FieldOffset(0x133E)] public sbyte byteFlags__arr830;
        [FieldOffset(0x133F)] public sbyte byteFlags__arr831;
        [FieldOffset(0x1340)] public sbyte byteFlags__arr832;
        [FieldOffset(0x1341)] public sbyte byteFlags__arr833;
        [FieldOffset(0x1342)] public sbyte byteFlags__arr834;
        [FieldOffset(0x1343)] public sbyte byteFlags__arr835;
        [FieldOffset(0x1344)] public sbyte byteFlags__arr836;
        [FieldOffset(0x1345)] public sbyte byteFlags__arr837;
        [FieldOffset(0x1346)] public sbyte byteFlags__arr838;
        [FieldOffset(0x1347)] public sbyte byteFlags__arr839;
        [FieldOffset(0x1348)] public sbyte byteFlags__arr840;
        [FieldOffset(0x1349)] public sbyte byteFlags__arr841;
        [FieldOffset(0x134A)] public sbyte byteFlags__arr842;
        [FieldOffset(0x134B)] public sbyte byteFlags__arr843;
        [FieldOffset(0x134C)] public sbyte byteFlags__arr844;
        [FieldOffset(0x134D)] public sbyte byteFlags__arr845;
        [FieldOffset(0x134E)] public sbyte byteFlags__arr846;
        [FieldOffset(0x134F)] public sbyte byteFlags__arr847;
        [FieldOffset(0x1350)] public sbyte byteFlags__arr848;
        [FieldOffset(0x1351)] public sbyte byteFlags__arr849;
        [FieldOffset(0x1352)] public sbyte byteFlags__arr850;
        [FieldOffset(0x1353)] public sbyte byteFlags__arr851;
        [FieldOffset(0x1354)] public sbyte byteFlags__arr852;
        [FieldOffset(0x1355)] public sbyte byteFlags__arr853;
        [FieldOffset(0x1356)] public sbyte byteFlags__arr854;
        [FieldOffset(0x1357)] public sbyte byteFlags__arr855;
        [FieldOffset(0x1358)] public sbyte byteFlags__arr856;
        [FieldOffset(0x1359)] public sbyte byteFlags__arr857;
        [FieldOffset(0x135A)] public sbyte byteFlags__arr858;
        [FieldOffset(0x135B)] public sbyte byteFlags__arr859;
        [FieldOffset(0x135C)] public sbyte byteFlags__arr860;
        [FieldOffset(0x135D)] public sbyte byteFlags__arr861;
        [FieldOffset(0x135E)] public sbyte byteFlags__arr862;
        [FieldOffset(0x135F)] public sbyte byteFlags__arr863;
        [FieldOffset(0x1360)] public sbyte byteFlags__arr864;
        [FieldOffset(0x1361)] public sbyte byteFlags__arr865;
        [FieldOffset(0x1362)] public sbyte byteFlags__arr866;
        [FieldOffset(0x1363)] public sbyte byteFlags__arr867;
        [FieldOffset(0x1364)] public sbyte byteFlags__arr868;
        [FieldOffset(0x1365)] public sbyte byteFlags__arr869;
        [FieldOffset(0x1366)] public sbyte byteFlags__arr870;
        [FieldOffset(0x1367)] public sbyte byteFlags__arr871;
        [FieldOffset(0x1368)] public sbyte byteFlags__arr872;
        [FieldOffset(0x1369)] public sbyte byteFlags__arr873;
        [FieldOffset(0x136A)] public sbyte byteFlags__arr874;
        [FieldOffset(0x136B)] public sbyte byteFlags__arr875;
        [FieldOffset(0x136C)] public sbyte byteFlags__arr876;
        [FieldOffset(0x136D)] public sbyte byteFlags__arr877;
        [FieldOffset(0x136E)] public sbyte byteFlags__arr878;
        [FieldOffset(0x136F)] public sbyte byteFlags__arr879;
        [FieldOffset(0x1370)] public sbyte byteFlags__arr880;
        [FieldOffset(0x1371)] public sbyte byteFlags__arr881;
        [FieldOffset(0x1372)] public sbyte byteFlags__arr882;
        [FieldOffset(0x1373)] public sbyte byteFlags__arr883;
        [FieldOffset(0x1374)] public sbyte byteFlags__arr884;
        [FieldOffset(0x1375)] public sbyte byteFlags__arr885;
        [FieldOffset(0x1376)] public sbyte byteFlags__arr886;
        [FieldOffset(0x1377)] public sbyte byteFlags__arr887;
        [FieldOffset(0x1378)] public sbyte byteFlags__arr888;
        [FieldOffset(0x1379)] public sbyte byteFlags__arr889;
        [FieldOffset(0x137A)] public sbyte byteFlags__arr890;
        [FieldOffset(0x137B)] public sbyte byteFlags__arr891;
        [FieldOffset(0x137C)] public sbyte byteFlags__arr892;
        [FieldOffset(0x137D)] public sbyte byteFlags__arr893;
        [FieldOffset(0x137E)] public sbyte byteFlags__arr894;
        [FieldOffset(0x137F)] public sbyte byteFlags__arr895;
        [FieldOffset(0x1380)] public sbyte byteFlags__arr896;
        [FieldOffset(0x1381)] public sbyte byteFlags__arr897;
        [FieldOffset(0x1382)] public sbyte byteFlags__arr898;
        [FieldOffset(0x1383)] public sbyte byteFlags__arr899;
        [FieldOffset(0x1384)] public sbyte byteFlags__arr900;
        [FieldOffset(0x1385)] public sbyte byteFlags__arr901;
        [FieldOffset(0x1386)] public sbyte byteFlags__arr902;
        [FieldOffset(0x1387)] public sbyte byteFlags__arr903;
        [FieldOffset(0x1388)] public sbyte byteFlags__arr904;
        [FieldOffset(0x1389)] public sbyte byteFlags__arr905;
        [FieldOffset(0x138A)] public sbyte byteFlags__arr906;
        [FieldOffset(0x138B)] public sbyte byteFlags__arr907;
        [FieldOffset(0x138C)] public sbyte byteFlags__arr908;
        [FieldOffset(0x138D)] public sbyte byteFlags__arr909;
        [FieldOffset(0x138E)] public sbyte byteFlags__arr910;
        [FieldOffset(0x138F)] public sbyte byteFlags__arr911;
        [FieldOffset(0x1390)] public sbyte byteFlags__arr912;
        [FieldOffset(0x1391)] public sbyte byteFlags__arr913;
        [FieldOffset(0x1392)] public sbyte byteFlags__arr914;
        [FieldOffset(0x1393)] public sbyte byteFlags__arr915;
        [FieldOffset(0x1394)] public sbyte byteFlags__arr916;
        [FieldOffset(0x1395)] public sbyte byteFlags__arr917;
        [FieldOffset(0x1396)] public sbyte byteFlags__arr918;
        [FieldOffset(0x1397)] public sbyte byteFlags__arr919;
        [FieldOffset(0x1398)] public sbyte byteFlags__arr920;
        [FieldOffset(0x1399)] public sbyte byteFlags__arr921;
        [FieldOffset(0x139A)] public sbyte byteFlags__arr922;
        [FieldOffset(0x139B)] public sbyte byteFlags__arr923;
        [FieldOffset(0x139C)] public sbyte byteFlags__arr924;
        [FieldOffset(0x139D)] public sbyte byteFlags__arr925;
        [FieldOffset(0x139E)] public sbyte byteFlags__arr926;
        [FieldOffset(0x139F)] public sbyte byteFlags__arr927;
        [FieldOffset(0x13A0)] public sbyte byteFlags__arr928;
        [FieldOffset(0x13A1)] public sbyte byteFlags__arr929;
        [FieldOffset(0x13A2)] public sbyte byteFlags__arr930;
        [FieldOffset(0x13A3)] public sbyte byteFlags__arr931;
        [FieldOffset(0x13A4)] public sbyte byteFlags__arr932;
        [FieldOffset(0x13A5)] public sbyte byteFlags__arr933;
        [FieldOffset(0x13A6)] public sbyte byteFlags__arr934;
        [FieldOffset(0x13A7)] public sbyte byteFlags__arr935;
        [FieldOffset(0x13A8)] public sbyte byteFlags__arr936;
        [FieldOffset(0x13A9)] public sbyte byteFlags__arr937;
        [FieldOffset(0x13AA)] public sbyte byteFlags__arr938;
        [FieldOffset(0x13AB)] public sbyte byteFlags__arr939;
        [FieldOffset(0x13AC)] public sbyte byteFlags__arr940;
        [FieldOffset(0x13AD)] public sbyte byteFlags__arr941;
        [FieldOffset(0x13AE)] public sbyte byteFlags__arr942;
        [FieldOffset(0x13AF)] public sbyte byteFlags__arr943;
        [FieldOffset(0x13B0)] public sbyte byteFlags__arr944;
        [FieldOffset(0x13B1)] public sbyte byteFlags__arr945;
        [FieldOffset(0x13B2)] public sbyte byteFlags__arr946;
        [FieldOffset(0x13B3)] public sbyte byteFlags__arr947;
        [FieldOffset(0x13B4)] public sbyte byteFlags__arr948;
        [FieldOffset(0x13B5)] public sbyte byteFlags__arr949;
        [FieldOffset(0x13B6)] public sbyte byteFlags__arr950;
        [FieldOffset(0x13B7)] public sbyte byteFlags__arr951;
        [FieldOffset(0x13B8)] public sbyte byteFlags__arr952;
        [FieldOffset(0x13B9)] public sbyte byteFlags__arr953;
        [FieldOffset(0x13BA)] public sbyte byteFlags__arr954;
        [FieldOffset(0x13BB)] public sbyte byteFlags__arr955;
        [FieldOffset(0x13BC)] public sbyte byteFlags__arr956;
        [FieldOffset(0x13BD)] public sbyte byteFlags__arr957;
        [FieldOffset(0x13BE)] public sbyte byteFlags__arr958;
        [FieldOffset(0x13BF)] public sbyte byteFlags__arr959;
        [FieldOffset(0x13C0)] public sbyte byteFlags__arr960;
        [FieldOffset(0x13C1)] public sbyte byteFlags__arr961;
        [FieldOffset(0x13C2)] public sbyte byteFlags__arr962;
        [FieldOffset(0x13C3)] public sbyte byteFlags__arr963;
        [FieldOffset(0x13C4)] public sbyte byteFlags__arr964;
        [FieldOffset(0x13C5)] public sbyte byteFlags__arr965;
        [FieldOffset(0x13C6)] public sbyte byteFlags__arr966;
        [FieldOffset(0x13C7)] public sbyte byteFlags__arr967;
        [FieldOffset(0x13C8)] public sbyte byteFlags__arr968;
        [FieldOffset(0x13C9)] public sbyte byteFlags__arr969;
        [FieldOffset(0x13CA)] public sbyte byteFlags__arr970;
        [FieldOffset(0x13CB)] public sbyte byteFlags__arr971;
        [FieldOffset(0x13CC)] public sbyte byteFlags__arr972;
        [FieldOffset(0x13CD)] public sbyte byteFlags__arr973;
        [FieldOffset(0x13CE)] public sbyte byteFlags__arr974;
        [FieldOffset(0x13CF)] public sbyte byteFlags__arr975;
        [FieldOffset(0x13D0)] public sbyte byteFlags__arr976;
        [FieldOffset(0x13D1)] public sbyte byteFlags__arr977;
        [FieldOffset(0x13D2)] public sbyte byteFlags__arr978;
        [FieldOffset(0x13D3)] public sbyte byteFlags__arr979;
        [FieldOffset(0x13D4)] public sbyte byteFlags__arr980;
        [FieldOffset(0x13D5)] public sbyte byteFlags__arr981;
        [FieldOffset(0x13D6)] public sbyte byteFlags__arr982;
        [FieldOffset(0x13D7)] public sbyte byteFlags__arr983;
        [FieldOffset(0x13D8)] public sbyte byteFlags__arr984;
        [FieldOffset(0x13D9)] public sbyte byteFlags__arr985;
        [FieldOffset(0x13DA)] public sbyte byteFlags__arr986;
        [FieldOffset(0x13DB)] public sbyte byteFlags__arr987;
        [FieldOffset(0x13DC)] public sbyte byteFlags__arr988;
        [FieldOffset(0x13DD)] public sbyte byteFlags__arr989;
        [FieldOffset(0x13DE)] public sbyte byteFlags__arr990;
        [FieldOffset(0x13DF)] public sbyte byteFlags__arr991;
        [FieldOffset(0x13E0)] public sbyte byteFlags__arr992;
        [FieldOffset(0x13E1)] public sbyte byteFlags__arr993;
        [FieldOffset(0x13E2)] public sbyte byteFlags__arr994;
        [FieldOffset(0x13E3)] public sbyte byteFlags__arr995;
        [FieldOffset(0x13E4)] public sbyte byteFlags__arr996;
        [FieldOffset(0x13E5)] public sbyte byteFlags__arr997;
        [FieldOffset(0x13E6)] public sbyte byteFlags__arr998;
        [FieldOffset(0x13E7)] public sbyte byteFlags__arr999;
        [FieldOffset(0x13E8)] public sbyte byteFlags__arr1000;
        [FieldOffset(0x13E9)] public sbyte byteFlags__arr1001;
        [FieldOffset(0x13EA)] public sbyte byteFlags__arr1002;
        [FieldOffset(0x13EB)] public sbyte byteFlags__arr1003;
        [FieldOffset(0x13EC)] public sbyte byteFlags__arr1004;
        [FieldOffset(0x13ED)] public sbyte byteFlags__arr1005;
        [FieldOffset(0x13EE)] public sbyte byteFlags__arr1006;
        [FieldOffset(0x13EF)] public sbyte byteFlags__arr1007;
        [FieldOffset(0x13F0)] public sbyte byteFlags__arr1008;
        [FieldOffset(0x13F1)] public sbyte byteFlags__arr1009;
        [FieldOffset(0x13F2)] public sbyte byteFlags__arr1010;
        [FieldOffset(0x13F3)] public sbyte byteFlags__arr1011;
        [FieldOffset(0x13F4)] public sbyte byteFlags__arr1012;
        [FieldOffset(0x13F5)] public sbyte byteFlags__arr1013;
        [FieldOffset(0x13F6)] public sbyte byteFlags__arr1014;
        [FieldOffset(0x13F7)] public sbyte byteFlags__arr1015;
        [FieldOffset(0x13F8)] public sbyte byteFlags__arr1016;
        [FieldOffset(0x13F9)] public sbyte byteFlags__arr1017;
        [FieldOffset(0x13FA)] public sbyte byteFlags__arr1018;
        [FieldOffset(0x13FB)] public sbyte byteFlags__arr1019;
        [FieldOffset(0x13FC)] public sbyte byteFlags__arr1020;
        [FieldOffset(0x13FD)] public sbyte byteFlags__arr1021;
        [FieldOffset(0x13FE)] public sbyte byteFlags__arr1022;
        [FieldOffset(0x13FF)] public sbyte byteFlags__arr1023;
        [FieldOffset(0x1400)] public uint intDatas__arr0;
        [FieldOffset(0x1404)] public uint intDatas__arr1;
        [FieldOffset(0x1408)] public uint intDatas__arr2;
        [FieldOffset(0x140C)] public uint intDatas__arr3;
        [FieldOffset(0x1410)] public uint intDatas__arr4;
        [FieldOffset(0x1414)] public uint intDatas__arr5;
        [FieldOffset(0x1418)] public uint intDatas__arr6;
        [FieldOffset(0x141C)] public uint intDatas__arr7;
        [FieldOffset(0x1420)] public uint intDatas__arr8;
        [FieldOffset(0x1424)] public uint intDatas__arr9;
        [FieldOffset(0x1428)] public uint intDatas__arr10;
        [FieldOffset(0x142C)] public uint intDatas__arr11;
        [FieldOffset(0x1430)] public uint intDatas__arr12;
        [FieldOffset(0x1434)] public uint intDatas__arr13;
        [FieldOffset(0x1438)] public uint intDatas__arr14;
        [FieldOffset(0x143C)] public uint intDatas__arr15;
        [FieldOffset(0x1440)] public uint intDatas__arr16;
        [FieldOffset(0x1444)] public uint intDatas__arr17;
        [FieldOffset(0x1448)] public uint intDatas__arr18;
        [FieldOffset(0x144C)] public uint intDatas__arr19;
        [FieldOffset(0x1450)] public uint intDatas__arr20;
        [FieldOffset(0x1454)] public uint intDatas__arr21;
        [FieldOffset(0x1458)] public uint intDatas__arr22;
        [FieldOffset(0x145C)] public uint intDatas__arr23;
        [FieldOffset(0x1460)] public uint intDatas__arr24;
        [FieldOffset(0x1464)] public uint intDatas__arr25;
        [FieldOffset(0x1468)] public uint intDatas__arr26;
        [FieldOffset(0x146C)] public uint intDatas__arr27;
        [FieldOffset(0x1470)] public uint intDatas__arr28;
        [FieldOffset(0x1474)] public uint intDatas__arr29;
        [FieldOffset(0x1478)] public uint intDatas__arr30;
        [FieldOffset(0x147C)] public uint intDatas__arr31;
        [FieldOffset(0x1480)] public uint intDatas__arr32;
        [FieldOffset(0x1484)] public uint intDatas__arr33;
        [FieldOffset(0x1488)] public uint intDatas__arr34;
        [FieldOffset(0x148C)] public uint intDatas__arr35;
        [FieldOffset(0x1490)] public uint intDatas__arr36;
        [FieldOffset(0x1494)] public uint intDatas__arr37;
        [FieldOffset(0x1498)] public uint intDatas__arr38;
        [FieldOffset(0x149C)] public uint intDatas__arr39;
        [FieldOffset(0x14A0)] public uint intDatas__arr40;
        [FieldOffset(0x14A4)] public uint intDatas__arr41;
        [FieldOffset(0x14A8)] public uint intDatas__arr42;
        [FieldOffset(0x14AC)] public uint intDatas__arr43;
        [FieldOffset(0x14B0)] public uint intDatas__arr44;
        [FieldOffset(0x14B4)] public uint intDatas__arr45;
        [FieldOffset(0x14B8)] public uint intDatas__arr46;
        [FieldOffset(0x14BC)] public uint intDatas__arr47;
        [FieldOffset(0x14C0)] public uint intDatas__arr48;
        [FieldOffset(0x14C4)] public uint intDatas__arr49;
        [FieldOffset(0x14C8)] public uint intDatas__arr50;
        [FieldOffset(0x14CC)] public uint intDatas__arr51;
        [FieldOffset(0x14D0)] public uint intDatas__arr52;
        [FieldOffset(0x14D4)] public uint intDatas__arr53;
        [FieldOffset(0x14D8)] public uint intDatas__arr54;
        [FieldOffset(0x14DC)] public uint intDatas__arr55;
        [FieldOffset(0x14E0)] public uint intDatas__arr56;
        [FieldOffset(0x14E4)] public uint intDatas__arr57;
        [FieldOffset(0x14E8)] public uint intDatas__arr58;
        [FieldOffset(0x14EC)] public uint intDatas__arr59;
        [FieldOffset(0x14F0)] public uint intDatas__arr60;
        [FieldOffset(0x14F4)] public uint intDatas__arr61;
        [FieldOffset(0x14F8)] public uint intDatas__arr62;
        [FieldOffset(0x14FC)] public uint intDatas__arr63;
        [FieldOffset(0x1500)] public uint intDatas__arr64;
        [FieldOffset(0x1504)] public uint intDatas__arr65;
        [FieldOffset(0x1508)] public uint intDatas__arr66;
        [FieldOffset(0x150C)] public uint intDatas__arr67;
        [FieldOffset(0x1510)] public uint intDatas__arr68;
        [FieldOffset(0x1514)] public uint intDatas__arr69;
        [FieldOffset(0x1518)] public uint intDatas__arr70;
        [FieldOffset(0x151C)] public uint intDatas__arr71;
        [FieldOffset(0x1520)] public uint intDatas__arr72;
        [FieldOffset(0x1524)] public uint intDatas__arr73;
        [FieldOffset(0x1528)] public uint intDatas__arr74;
        [FieldOffset(0x152C)] public uint intDatas__arr75;
        [FieldOffset(0x1530)] public uint intDatas__arr76;
        [FieldOffset(0x1534)] public uint intDatas__arr77;
        [FieldOffset(0x1538)] public uint intDatas__arr78;
        [FieldOffset(0x153C)] public uint intDatas__arr79;
        [FieldOffset(0x1540)] public uint intDatas__arr80;
        [FieldOffset(0x1544)] public uint intDatas__arr81;
        [FieldOffset(0x1548)] public uint intDatas__arr82;
        [FieldOffset(0x154C)] public uint intDatas__arr83;
        [FieldOffset(0x1550)] public uint intDatas__arr84;
        [FieldOffset(0x1554)] public uint intDatas__arr85;
        [FieldOffset(0x1558)] public uint intDatas__arr86;
        [FieldOffset(0x155C)] public uint intDatas__arr87;
        [FieldOffset(0x1560)] public uint intDatas__arr88;
        [FieldOffset(0x1564)] public uint intDatas__arr89;
        [FieldOffset(0x1568)] public uint intDatas__arr90;
        [FieldOffset(0x156C)] public uint intDatas__arr91;
        [FieldOffset(0x1570)] public uint intDatas__arr92;
        [FieldOffset(0x1574)] public uint intDatas__arr93;
        [FieldOffset(0x1578)] public uint intDatas__arr94;
        [FieldOffset(0x157C)] public uint intDatas__arr95;
        [FieldOffset(0x1580)] public uint intDatas__arr96;
        [FieldOffset(0x1584)] public uint intDatas__arr97;
        [FieldOffset(0x1588)] public uint intDatas__arr98;
        [FieldOffset(0x158C)] public uint intDatas__arr99;
        [FieldOffset(0x1590)] public uint intDatas__arr100;
        [FieldOffset(0x1594)] public uint intDatas__arr101;
        [FieldOffset(0x1598)] public uint intDatas__arr102;
        [FieldOffset(0x159C)] public uint intDatas__arr103;
        [FieldOffset(0x15A0)] public uint intDatas__arr104;
        [FieldOffset(0x15A4)] public uint intDatas__arr105;
        [FieldOffset(0x15A8)] public uint intDatas__arr106;
        [FieldOffset(0x15AC)] public uint intDatas__arr107;
        [FieldOffset(0x15B0)] public uint intDatas__arr108;
        [FieldOffset(0x15B4)] public uint intDatas__arr109;
        [FieldOffset(0x15B8)] public uint intDatas__arr110;
        [FieldOffset(0x15BC)] public uint intDatas__arr111;
        [FieldOffset(0x15C0)] public uint intDatas__arr112;
        [FieldOffset(0x15C4)] public uint intDatas__arr113;
        [FieldOffset(0x15C8)] public uint intDatas__arr114;
        [FieldOffset(0x15CC)] public uint intDatas__arr115;
        [FieldOffset(0x15D0)] public uint intDatas__arr116;
        [FieldOffset(0x15D4)] public uint intDatas__arr117;
        [FieldOffset(0x15D8)] public uint intDatas__arr118;
        [FieldOffset(0x15DC)] public uint intDatas__arr119;
        [FieldOffset(0x15E0)] public uint intDatas__arr120;
        [FieldOffset(0x15E4)] public uint intDatas__arr121;
        [FieldOffset(0x15E8)] public uint intDatas__arr122;
        [FieldOffset(0x15EC)] public uint intDatas__arr123;
        [FieldOffset(0x15F0)] public uint intDatas__arr124;
        [FieldOffset(0x15F4)] public uint intDatas__arr125;
        [FieldOffset(0x15F8)] public uint intDatas__arr126;
        [FieldOffset(0x15FC)] public uint intDatas__arr127;
        [FieldOffset(0x1600)] public uint intDatas__arr128;
        [FieldOffset(0x1604)] public uint intDatas__arr129;
        [FieldOffset(0x1608)] public uint intDatas__arr130;
        [FieldOffset(0x160C)] public uint intDatas__arr131;
        [FieldOffset(0x1610)] public uint intDatas__arr132;
        [FieldOffset(0x1614)] public uint intDatas__arr133;
        [FieldOffset(0x1618)] public uint intDatas__arr134;
        [FieldOffset(0x161C)] public uint intDatas__arr135;
        [FieldOffset(0x1620)] public uint intDatas__arr136;
        [FieldOffset(0x1624)] public uint intDatas__arr137;
        [FieldOffset(0x1628)] public uint intDatas__arr138;
        [FieldOffset(0x162C)] public uint intDatas__arr139;
        [FieldOffset(0x1630)] public uint intDatas__arr140;
        [FieldOffset(0x1634)] public uint intDatas__arr141;
        [FieldOffset(0x1638)] public uint intDatas__arr142;
        [FieldOffset(0x163C)] public uint intDatas__arr143;
        [FieldOffset(0x1640)] public uint intDatas__arr144;
        [FieldOffset(0x1644)] public uint intDatas__arr145;
        [FieldOffset(0x1648)] public uint intDatas__arr146;
        [FieldOffset(0x164C)] public uint intDatas__arr147;
        [FieldOffset(0x1650)] public uint intDatas__arr148;
        [FieldOffset(0x1654)] public uint intDatas__arr149;
        [FieldOffset(0x1658)] public uint intDatas__arr150;
        [FieldOffset(0x165C)] public uint intDatas__arr151;
        [FieldOffset(0x1660)] public uint intDatas__arr152;
        [FieldOffset(0x1664)] public uint intDatas__arr153;
        [FieldOffset(0x1668)] public uint intDatas__arr154;
        [FieldOffset(0x166C)] public uint intDatas__arr155;
        [FieldOffset(0x1670)] public uint intDatas__arr156;
        [FieldOffset(0x1674)] public uint intDatas__arr157;
        [FieldOffset(0x1678)] public uint intDatas__arr158;
        [FieldOffset(0x167C)] public uint intDatas__arr159;
        [FieldOffset(0x1680)] public uint intDatas__arr160;
        [FieldOffset(0x1684)] public uint intDatas__arr161;
        [FieldOffset(0x1688)] public uint intDatas__arr162;
        [FieldOffset(0x168C)] public uint intDatas__arr163;
        [FieldOffset(0x1690)] public uint intDatas__arr164;
        [FieldOffset(0x1694)] public uint intDatas__arr165;
        [FieldOffset(0x1698)] public uint intDatas__arr166;
        [FieldOffset(0x169C)] public uint intDatas__arr167;
        [FieldOffset(0x16A0)] public uint intDatas__arr168;
        [FieldOffset(0x16A4)] public uint intDatas__arr169;
        [FieldOffset(0x16A8)] public uint intDatas__arr170;
        [FieldOffset(0x16AC)] public uint intDatas__arr171;
        [FieldOffset(0x16B0)] public uint intDatas__arr172;
        [FieldOffset(0x16B4)] public uint intDatas__arr173;
        [FieldOffset(0x16B8)] public uint intDatas__arr174;
        [FieldOffset(0x16BC)] public uint intDatas__arr175;
        [FieldOffset(0x16C0)] public uint intDatas__arr176;
        [FieldOffset(0x16C4)] public uint intDatas__arr177;
        [FieldOffset(0x16C8)] public uint intDatas__arr178;
        [FieldOffset(0x16CC)] public uint intDatas__arr179;
        [FieldOffset(0x16D0)] public uint intDatas__arr180;
        [FieldOffset(0x16D4)] public uint intDatas__arr181;
        [FieldOffset(0x16D8)] public uint intDatas__arr182;
        [FieldOffset(0x16DC)] public uint intDatas__arr183;
        [FieldOffset(0x16E0)] public uint intDatas__arr184;
        [FieldOffset(0x16E4)] public uint intDatas__arr185;
        [FieldOffset(0x16E8)] public uint intDatas__arr186;
        [FieldOffset(0x16EC)] public uint intDatas__arr187;
        [FieldOffset(0x16F0)] public uint intDatas__arr188;
        [FieldOffset(0x16F4)] public uint intDatas__arr189;
        [FieldOffset(0x16F8)] public uint intDatas__arr190;
        [FieldOffset(0x16FC)] public uint intDatas__arr191;
        [FieldOffset(0x1700)] public uint intDatas__arr192;
        [FieldOffset(0x1704)] public uint intDatas__arr193;
        [FieldOffset(0x1708)] public uint intDatas__arr194;
        [FieldOffset(0x170C)] public uint intDatas__arr195;
        [FieldOffset(0x1710)] public uint intDatas__arr196;
        [FieldOffset(0x1714)] public uint intDatas__arr197;
        [FieldOffset(0x1718)] public uint intDatas__arr198;
        [FieldOffset(0x171C)] public uint intDatas__arr199;
        [FieldOffset(0x1720)] public uint intDatas__arr200;
        [FieldOffset(0x1724)] public uint intDatas__arr201;
        [FieldOffset(0x1728)] public uint intDatas__arr202;
        [FieldOffset(0x172C)] public uint intDatas__arr203;
        [FieldOffset(0x1730)] public uint intDatas__arr204;
        [FieldOffset(0x1734)] public uint intDatas__arr205;
        [FieldOffset(0x1738)] public uint intDatas__arr206;
        [FieldOffset(0x173C)] public uint intDatas__arr207;
        [FieldOffset(0x1740)] public uint intDatas__arr208;
        [FieldOffset(0x1744)] public uint intDatas__arr209;
        [FieldOffset(0x1748)] public uint intDatas__arr210;
        [FieldOffset(0x174C)] public uint intDatas__arr211;
        [FieldOffset(0x1750)] public uint intDatas__arr212;
        [FieldOffset(0x1754)] public uint intDatas__arr213;
        [FieldOffset(0x1758)] public uint intDatas__arr214;
        [FieldOffset(0x175C)] public uint intDatas__arr215;
        [FieldOffset(0x1760)] public uint intDatas__arr216;
        [FieldOffset(0x1764)] public uint intDatas__arr217;
        [FieldOffset(0x1768)] public uint intDatas__arr218;
        [FieldOffset(0x176C)] public uint intDatas__arr219;
        [FieldOffset(0x1770)] public uint intDatas__arr220;
        [FieldOffset(0x1774)] public uint intDatas__arr221;
        [FieldOffset(0x1778)] public uint intDatas__arr222;
        [FieldOffset(0x177C)] public uint intDatas__arr223;
        [FieldOffset(0x1780)] public uint intDatas__arr224;
        [FieldOffset(0x1784)] public uint intDatas__arr225;
        [FieldOffset(0x1788)] public uint intDatas__arr226;
        [FieldOffset(0x178C)] public uint intDatas__arr227;
        [FieldOffset(0x1790)] public uint intDatas__arr228;
        [FieldOffset(0x1794)] public uint intDatas__arr229;
        [FieldOffset(0x1798)] public uint intDatas__arr230;
        [FieldOffset(0x179C)] public uint intDatas__arr231;
        [FieldOffset(0x17A0)] public uint intDatas__arr232;
        [FieldOffset(0x17A4)] public uint intDatas__arr233;
        [FieldOffset(0x17A8)] public uint intDatas__arr234;
        [FieldOffset(0x17AC)] public uint intDatas__arr235;
        [FieldOffset(0x17B0)] public uint intDatas__arr236;
        [FieldOffset(0x17B4)] public uint intDatas__arr237;
        [FieldOffset(0x17B8)] public uint intDatas__arr238;
        [FieldOffset(0x17BC)] public uint intDatas__arr239;
        [FieldOffset(0x17C0)] public uint intDatas__arr240;
        [FieldOffset(0x17C4)] public uint intDatas__arr241;
        [FieldOffset(0x17C8)] public uint intDatas__arr242;
        [FieldOffset(0x17CC)] public uint intDatas__arr243;
        [FieldOffset(0x17D0)] public uint intDatas__arr244;
        [FieldOffset(0x17D4)] public uint intDatas__arr245;
        [FieldOffset(0x17D8)] public uint intDatas__arr246;
        [FieldOffset(0x17DC)] public uint intDatas__arr247;
        [FieldOffset(0x17E0)] public uint intDatas__arr248;
        [FieldOffset(0x17E4)] public uint intDatas__arr249;
        [FieldOffset(0x17E8)] public uint intDatas__arr250;
        [FieldOffset(0x17EC)] public uint intDatas__arr251;
        [FieldOffset(0x17F0)] public uint intDatas__arr252;
        [FieldOffset(0x17F4)] public uint intDatas__arr253;
        [FieldOffset(0x17F8)] public uint intDatas__arr254;
        [FieldOffset(0x17FC)] public uint intDatas__arr255;
        [FieldOffset(0x1800)] public uint intDatas__arr256;
        [FieldOffset(0x1804)] public uint intDatas__arr257;
        [FieldOffset(0x1808)] public uint intDatas__arr258;
        [FieldOffset(0x180C)] public uint intDatas__arr259;
        [FieldOffset(0x1810)] public uint intDatas__arr260;
        [FieldOffset(0x1814)] public uint intDatas__arr261;
        [FieldOffset(0x1818)] public uint intDatas__arr262;
        [FieldOffset(0x181C)] public uint intDatas__arr263;
        [FieldOffset(0x1820)] public uint intDatas__arr264;
        [FieldOffset(0x1824)] public uint intDatas__arr265;
        [FieldOffset(0x1828)] public uint intDatas__arr266;
        [FieldOffset(0x182C)] public uint intDatas__arr267;
        [FieldOffset(0x1830)] public uint intDatas__arr268;
        [FieldOffset(0x1834)] public uint intDatas__arr269;
        [FieldOffset(0x1838)] public uint intDatas__arr270;
        [FieldOffset(0x183C)] public uint intDatas__arr271;
        [FieldOffset(0x1840)] public uint intDatas__arr272;
        [FieldOffset(0x1844)] public uint intDatas__arr273;
        [FieldOffset(0x1848)] public uint intDatas__arr274;
        [FieldOffset(0x184C)] public uint intDatas__arr275;
        [FieldOffset(0x1850)] public uint intDatas__arr276;
        [FieldOffset(0x1854)] public uint intDatas__arr277;
        [FieldOffset(0x1858)] public uint intDatas__arr278;
        [FieldOffset(0x185C)] public uint intDatas__arr279;
        [FieldOffset(0x1860)] public uint intDatas__arr280;
        [FieldOffset(0x1864)] public uint intDatas__arr281;
        [FieldOffset(0x1868)] public uint intDatas__arr282;
        [FieldOffset(0x186C)] public uint intDatas__arr283;
        [FieldOffset(0x1870)] public uint intDatas__arr284;
        [FieldOffset(0x1874)] public uint intDatas__arr285;
        [FieldOffset(0x1878)] public uint intDatas__arr286;
        [FieldOffset(0x187C)] public uint intDatas__arr287;
        [FieldOffset(0x1880)] public uint intDatas__arr288;
        [FieldOffset(0x1884)] public uint intDatas__arr289;
        [FieldOffset(0x1888)] public uint intDatas__arr290;
        [FieldOffset(0x188C)] public uint intDatas__arr291;
        [FieldOffset(0x1890)] public uint intDatas__arr292;
        [FieldOffset(0x1894)] public uint intDatas__arr293;
        [FieldOffset(0x1898)] public uint intDatas__arr294;
        [FieldOffset(0x189C)] public uint intDatas__arr295;
        [FieldOffset(0x18A0)] public uint intDatas__arr296;
        [FieldOffset(0x18A4)] public uint intDatas__arr297;
        [FieldOffset(0x18A8)] public uint intDatas__arr298;
        [FieldOffset(0x18AC)] public uint intDatas__arr299;
        [FieldOffset(0x18B0)] public uint intDatas__arr300;
        [FieldOffset(0x18B4)] public uint intDatas__arr301;
        [FieldOffset(0x18B8)] public uint intDatas__arr302;
        [FieldOffset(0x18BC)] public uint intDatas__arr303;
        [FieldOffset(0x18C0)] public uint intDatas__arr304;
        [FieldOffset(0x18C4)] public uint intDatas__arr305;
        [FieldOffset(0x18C8)] public uint intDatas__arr306;
        [FieldOffset(0x18CC)] public uint intDatas__arr307;
        [FieldOffset(0x18D0)] public uint intDatas__arr308;
        [FieldOffset(0x18D4)] public uint intDatas__arr309;
        [FieldOffset(0x18D8)] public uint intDatas__arr310;
        [FieldOffset(0x18DC)] public uint intDatas__arr311;
        [FieldOffset(0x18E0)] public uint intDatas__arr312;
        [FieldOffset(0x18E4)] public uint intDatas__arr313;
        [FieldOffset(0x18E8)] public uint intDatas__arr314;
        [FieldOffset(0x18EC)] public uint intDatas__arr315;
        [FieldOffset(0x18F0)] public uint intDatas__arr316;
        [FieldOffset(0x18F4)] public uint intDatas__arr317;
        [FieldOffset(0x18F8)] public uint intDatas__arr318;
        [FieldOffset(0x18FC)] public uint intDatas__arr319;
        [FieldOffset(0x1900)] public uint intDatas__arr320;
        [FieldOffset(0x1904)] public uint intDatas__arr321;
        [FieldOffset(0x1908)] public uint intDatas__arr322;
        [FieldOffset(0x190C)] public uint intDatas__arr323;
        [FieldOffset(0x1910)] public uint intDatas__arr324;
        [FieldOffset(0x1914)] public uint intDatas__arr325;
        [FieldOffset(0x1918)] public uint intDatas__arr326;
        [FieldOffset(0x191C)] public uint intDatas__arr327;
        [FieldOffset(0x1920)] public uint intDatas__arr328;
        [FieldOffset(0x1924)] public uint intDatas__arr329;
        [FieldOffset(0x1928)] public uint intDatas__arr330;
        [FieldOffset(0x192C)] public uint intDatas__arr331;
        [FieldOffset(0x1930)] public uint intDatas__arr332;
        [FieldOffset(0x1934)] public uint intDatas__arr333;
        [FieldOffset(0x1938)] public uint intDatas__arr334;
        [FieldOffset(0x193C)] public uint intDatas__arr335;
        [FieldOffset(0x1940)] public uint intDatas__arr336;
        [FieldOffset(0x1944)] public uint intDatas__arr337;
        [FieldOffset(0x1948)] public uint intDatas__arr338;
        [FieldOffset(0x194C)] public uint intDatas__arr339;
        [FieldOffset(0x1950)] public uint intDatas__arr340;
        [FieldOffset(0x1954)] public uint intDatas__arr341;
        [FieldOffset(0x1958)] public uint intDatas__arr342;
        [FieldOffset(0x195C)] public uint intDatas__arr343;
        [FieldOffset(0x1960)] public uint intDatas__arr344;
        [FieldOffset(0x1964)] public uint intDatas__arr345;
        [FieldOffset(0x1968)] public uint intDatas__arr346;
        [FieldOffset(0x196C)] public uint intDatas__arr347;
        [FieldOffset(0x1970)] public uint intDatas__arr348;
        [FieldOffset(0x1974)] public uint intDatas__arr349;
        [FieldOffset(0x1978)] public uint intDatas__arr350;
        [FieldOffset(0x197C)] public uint intDatas__arr351;
        [FieldOffset(0x1980)] public uint intDatas__arr352;
        [FieldOffset(0x1984)] public uint intDatas__arr353;
        [FieldOffset(0x1988)] public uint intDatas__arr354;
        [FieldOffset(0x198C)] public uint intDatas__arr355;
        [FieldOffset(0x1990)] public uint intDatas__arr356;
        [FieldOffset(0x1994)] public uint intDatas__arr357;
        [FieldOffset(0x1998)] public uint intDatas__arr358;
        [FieldOffset(0x199C)] public uint intDatas__arr359;
        [FieldOffset(0x19A0)] public uint intDatas__arr360;
        [FieldOffset(0x19A4)] public uint intDatas__arr361;
        [FieldOffset(0x19A8)] public uint intDatas__arr362;
        [FieldOffset(0x19AC)] public uint intDatas__arr363;
        [FieldOffset(0x19B0)] public uint intDatas__arr364;
        [FieldOffset(0x19B4)] public uint intDatas__arr365;
        [FieldOffset(0x19B8)] public uint intDatas__arr366;
        [FieldOffset(0x19BC)] public uint intDatas__arr367;
        [FieldOffset(0x19C0)] public uint intDatas__arr368;
        [FieldOffset(0x19C4)] public uint intDatas__arr369;
        [FieldOffset(0x19C8)] public uint intDatas__arr370;
        [FieldOffset(0x19CC)] public uint intDatas__arr371;
        [FieldOffset(0x19D0)] public uint intDatas__arr372;
        [FieldOffset(0x19D4)] public uint intDatas__arr373;
        [FieldOffset(0x19D8)] public uint intDatas__arr374;
        [FieldOffset(0x19DC)] public uint intDatas__arr375;
        [FieldOffset(0x19E0)] public uint intDatas__arr376;
        [FieldOffset(0x19E4)] public uint intDatas__arr377;
        [FieldOffset(0x19E8)] public uint intDatas__arr378;
        [FieldOffset(0x19EC)] public uint intDatas__arr379;
        [FieldOffset(0x19F0)] public uint intDatas__arr380;
        [FieldOffset(0x19F4)] public uint intDatas__arr381;
        [FieldOffset(0x19F8)] public uint intDatas__arr382;
        [FieldOffset(0x19FC)] public uint intDatas__arr383;
        [FieldOffset(0x1A00)] public uint intDatas__arr384;
        [FieldOffset(0x1A04)] public uint intDatas__arr385;
        [FieldOffset(0x1A08)] public uint intDatas__arr386;
        [FieldOffset(0x1A0C)] public uint intDatas__arr387;
        [FieldOffset(0x1A10)] public uint intDatas__arr388;
        [FieldOffset(0x1A14)] public uint intDatas__arr389;
        [FieldOffset(0x1A18)] public uint intDatas__arr390;
        [FieldOffset(0x1A1C)] public uint intDatas__arr391;
        [FieldOffset(0x1A20)] public uint intDatas__arr392;
        [FieldOffset(0x1A24)] public uint intDatas__arr393;
        [FieldOffset(0x1A28)] public uint intDatas__arr394;
        [FieldOffset(0x1A2C)] public uint intDatas__arr395;
        [FieldOffset(0x1A30)] public uint intDatas__arr396;
        [FieldOffset(0x1A34)] public uint intDatas__arr397;
        [FieldOffset(0x1A38)] public uint intDatas__arr398;
        [FieldOffset(0x1A3C)] public uint intDatas__arr399;
        [FieldOffset(0x1A40)] public uint intDatas__arr400;
        [FieldOffset(0x1A44)] public uint intDatas__arr401;
        [FieldOffset(0x1A48)] public uint intDatas__arr402;
        [FieldOffset(0x1A4C)] public uint intDatas__arr403;
        [FieldOffset(0x1A50)] public uint intDatas__arr404;
        [FieldOffset(0x1A54)] public uint intDatas__arr405;
        [FieldOffset(0x1A58)] public uint intDatas__arr406;
        [FieldOffset(0x1A5C)] public uint intDatas__arr407;
        [FieldOffset(0x1A60)] public uint intDatas__arr408;
        [FieldOffset(0x1A64)] public uint intDatas__arr409;
        [FieldOffset(0x1A68)] public uint intDatas__arr410;
        [FieldOffset(0x1A6C)] public uint intDatas__arr411;
        [FieldOffset(0x1A70)] public uint intDatas__arr412;
        [FieldOffset(0x1A74)] public uint intDatas__arr413;
        [FieldOffset(0x1A78)] public uint intDatas__arr414;
        [FieldOffset(0x1A7C)] public uint intDatas__arr415;
        [FieldOffset(0x1A80)] public uint intDatas__arr416;
        [FieldOffset(0x1A84)] public uint intDatas__arr417;
        [FieldOffset(0x1A88)] public uint intDatas__arr418;
        [FieldOffset(0x1A8C)] public uint intDatas__arr419;
        [FieldOffset(0x1A90)] public uint intDatas__arr420;
        [FieldOffset(0x1A94)] public uint intDatas__arr421;
        [FieldOffset(0x1A98)] public uint intDatas__arr422;
        [FieldOffset(0x1A9C)] public uint intDatas__arr423;
        [FieldOffset(0x1AA0)] public uint intDatas__arr424;
        [FieldOffset(0x1AA4)] public uint intDatas__arr425;
        [FieldOffset(0x1AA8)] public uint intDatas__arr426;
        [FieldOffset(0x1AAC)] public uint intDatas__arr427;
        [FieldOffset(0x1AB0)] public uint intDatas__arr428;
        [FieldOffset(0x1AB4)] public uint intDatas__arr429;
        [FieldOffset(0x1AB8)] public uint intDatas__arr430;
        [FieldOffset(0x1ABC)] public uint intDatas__arr431;
        [FieldOffset(0x1AC0)] public uint intDatas__arr432;
        [FieldOffset(0x1AC4)] public uint intDatas__arr433;
        [FieldOffset(0x1AC8)] public uint intDatas__arr434;
        [FieldOffset(0x1ACC)] public uint intDatas__arr435;
        [FieldOffset(0x1AD0)] public uint intDatas__arr436;
        [FieldOffset(0x1AD4)] public uint intDatas__arr437;
        [FieldOffset(0x1AD8)] public uint intDatas__arr438;
        [FieldOffset(0x1ADC)] public uint intDatas__arr439;
        [FieldOffset(0x1AE0)] public uint intDatas__arr440;
        [FieldOffset(0x1AE4)] public uint intDatas__arr441;
        [FieldOffset(0x1AE8)] public uint intDatas__arr442;
        [FieldOffset(0x1AEC)] public uint intDatas__arr443;
        [FieldOffset(0x1AF0)] public uint intDatas__arr444;
        [FieldOffset(0x1AF4)] public uint intDatas__arr445;
        [FieldOffset(0x1AF8)] public uint intDatas__arr446;
        [FieldOffset(0x1AFC)] public uint intDatas__arr447;
        [FieldOffset(0x1B00)] public uint intDatas__arr448;
        [FieldOffset(0x1B04)] public uint intDatas__arr449;
        [FieldOffset(0x1B08)] public uint intDatas__arr450;
        [FieldOffset(0x1B0C)] public uint intDatas__arr451;
        [FieldOffset(0x1B10)] public uint intDatas__arr452;
        [FieldOffset(0x1B14)] public uint intDatas__arr453;
        [FieldOffset(0x1B18)] public uint intDatas__arr454;
        [FieldOffset(0x1B1C)] public uint intDatas__arr455;
        [FieldOffset(0x1B20)] public uint intDatas__arr456;
        [FieldOffset(0x1B24)] public uint intDatas__arr457;
        [FieldOffset(0x1B28)] public uint intDatas__arr458;
        [FieldOffset(0x1B2C)] public uint intDatas__arr459;
        [FieldOffset(0x1B30)] public uint intDatas__arr460;
        [FieldOffset(0x1B34)] public uint intDatas__arr461;
        [FieldOffset(0x1B38)] public uint intDatas__arr462;
        [FieldOffset(0x1B3C)] public uint intDatas__arr463;
        [FieldOffset(0x1B40)] public uint intDatas__arr464;
        [FieldOffset(0x1B44)] public uint intDatas__arr465;
        [FieldOffset(0x1B48)] public uint intDatas__arr466;
        [FieldOffset(0x1B4C)] public uint intDatas__arr467;
        [FieldOffset(0x1B50)] public uint intDatas__arr468;
        [FieldOffset(0x1B54)] public uint intDatas__arr469;
        [FieldOffset(0x1B58)] public uint intDatas__arr470;
        [FieldOffset(0x1B5C)] public uint intDatas__arr471;
        [FieldOffset(0x1B60)] public uint intDatas__arr472;
        [FieldOffset(0x1B64)] public uint intDatas__arr473;
        [FieldOffset(0x1B68)] public uint intDatas__arr474;
        [FieldOffset(0x1B6C)] public uint intDatas__arr475;
        [FieldOffset(0x1B70)] public uint intDatas__arr476;
        [FieldOffset(0x1B74)] public uint intDatas__arr477;
        [FieldOffset(0x1B78)] public uint intDatas__arr478;
        [FieldOffset(0x1B7C)] public uint intDatas__arr479;
        [FieldOffset(0x1B80)] public uint intDatas__arr480;
        [FieldOffset(0x1B84)] public uint intDatas__arr481;
        [FieldOffset(0x1B88)] public uint intDatas__arr482;
        [FieldOffset(0x1B8C)] public uint intDatas__arr483;
        [FieldOffset(0x1B90)] public uint intDatas__arr484;
        [FieldOffset(0x1B94)] public uint intDatas__arr485;
        [FieldOffset(0x1B98)] public uint intDatas__arr486;
        [FieldOffset(0x1B9C)] public uint intDatas__arr487;
        [FieldOffset(0x1BA0)] public uint intDatas__arr488;
        [FieldOffset(0x1BA4)] public uint intDatas__arr489;
        [FieldOffset(0x1BA8)] public uint intDatas__arr490;
        [FieldOffset(0x1BAC)] public uint intDatas__arr491;
        [FieldOffset(0x1BB0)] public uint intDatas__arr492;
        [FieldOffset(0x1BB4)] public uint intDatas__arr493;
        [FieldOffset(0x1BB8)] public uint intDatas__arr494;
        [FieldOffset(0x1BBC)] public uint intDatas__arr495;
        [FieldOffset(0x1BC0)] public uint intDatas__arr496;
        [FieldOffset(0x1BC4)] public uint intDatas__arr497;
        [FieldOffset(0x1BC8)] public uint intDatas__arr498;
        [FieldOffset(0x1BCC)] public uint intDatas__arr499;
        [FieldOffset(0x1BD0)] public uint intDatas__arr500;
        [FieldOffset(0x1BD4)] public uint intDatas__arr501;
        [FieldOffset(0x1BD8)] public uint intDatas__arr502;
        [FieldOffset(0x1BDC)] public uint intDatas__arr503;
        [FieldOffset(0x1BE0)] public uint intDatas__arr504;
        [FieldOffset(0x1BE4)] public uint intDatas__arr505;
        [FieldOffset(0x1BE8)] public uint intDatas__arr506;
        [FieldOffset(0x1BEC)] public uint intDatas__arr507;
        [FieldOffset(0x1BF0)] public uint intDatas__arr508;
        [FieldOffset(0x1BF4)] public uint intDatas__arr509;
        [FieldOffset(0x1BF8)] public uint intDatas__arr510;
        [FieldOffset(0x1BFC)] public uint intDatas__arr511;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x59400)]
    public struct WorldFlagContainerData
    {
        [FieldOffset(0x00)] public WorldFlagData worldDatas__arr0;
        [FieldOffset(0x1C00)] public WorldFlagData worldDatas__arr1;
        [FieldOffset(0x3800)] public WorldFlagData worldDatas__arr2;
        [FieldOffset(0x5400)] public WorldFlagData worldDatas__arr3;
        [FieldOffset(0x7000)] public WorldFlagData worldDatas__arr4;
        [FieldOffset(0x8C00)] public WorldFlagData worldDatas__arr5;
        [FieldOffset(0xA800)] public WorldFlagData worldDatas__arr6;
        [FieldOffset(0xC400)] public WorldFlagData worldDatas__arr7;
        [FieldOffset(0xE000)] public WorldFlagData worldDatas__arr8;
        [FieldOffset(0xFC00)] public WorldFlagData worldDatas__arr9;
        [FieldOffset(0x11800)] public WorldFlagData worldDatas__arr10;
        [FieldOffset(0x13400)] public WorldFlagData worldDatas__arr11;
        [FieldOffset(0x15000)] public WorldFlagData worldDatas__arr12;
        [FieldOffset(0x16C00)] public WorldFlagData worldDatas__arr13;
        [FieldOffset(0x18800)] public WorldFlagData worldDatas__arr14;
        [FieldOffset(0x1A400)] public WorldFlagData worldDatas__arr15;
        [FieldOffset(0x1C000)] public WorldFlagData worldDatas__arr16;
        [FieldOffset(0x1DC00)] public WorldFlagData worldDatas__arr17;
        [FieldOffset(0x1F800)] public WorldFlagData worldDatas__arr18;
        [FieldOffset(0x21400)] public WorldFlagData worldDatas__arr19;
        [FieldOffset(0x23000)] public WorldFlagData worldDatas__arr20;
        [FieldOffset(0x24C00)] public WorldFlagData worldDatas__arr21;
        [FieldOffset(0x26800)] public WorldFlagData worldDatas__arr22;
        [FieldOffset(0x28400)] public WorldFlagData worldDatas__arr23;
        [FieldOffset(0x2A000)] public WorldFlagData worldDatas__arr24;
        [FieldOffset(0x2BC00)] public WorldFlagData worldDatas__arr25;
        [FieldOffset(0x2D800)] public WorldFlagData worldDatas__arr26;
        [FieldOffset(0x2F400)] public WorldFlagData worldDatas__arr27;
        [FieldOffset(0x31000)] public WorldFlagData worldDatas__arr28;
        [FieldOffset(0x32C00)] public WorldFlagData worldDatas__arr29;
        [FieldOffset(0x34800)] public WorldFlagData worldDatas__arr30;
        [FieldOffset(0x36400)] public WorldFlagData worldDatas__arr31;
        [FieldOffset(0x38000)] public WorldFlagData worldDatas__arr32;
        [FieldOffset(0x39C00)] public WorldFlagData worldDatas__arr33;
        [FieldOffset(0x3B800)] public WorldFlagData worldDatas__arr34;
        [FieldOffset(0x3D400)] public WorldFlagData worldDatas__arr35;
        [FieldOffset(0x3F000)] public WorldFlagData worldDatas__arr36;
        [FieldOffset(0x40C00)] public WorldFlagData worldDatas__arr37;
        [FieldOffset(0x42800)] public WorldFlagData worldDatas__arr38;
        [FieldOffset(0x44400)] public WorldFlagData worldDatas__arr39;
        [FieldOffset(0x46000)] public WorldFlagData worldDatas__arr40;
        [FieldOffset(0x47C00)] public WorldFlagData worldDatas__arr41;
        [FieldOffset(0x49800)] public WorldFlagData worldDatas__arr42;
        [FieldOffset(0x4B400)] public WorldFlagData worldDatas__arr43;
        [FieldOffset(0x4D000)] public WorldFlagData worldDatas__arr44;
        [FieldOffset(0x4EC00)] public WorldFlagData worldDatas__arr45;
        [FieldOffset(0x50800)] public WorldFlagData worldDatas__arr46;
        [FieldOffset(0x52400)] public WorldFlagData worldDatas__arr47;
        [FieldOffset(0x54000)] public WorldFlagData worldDatas__arr48;
        [FieldOffset(0x55C00)] public WorldFlagData worldDatas__arr49;
        [FieldOffset(0x57800)] public WorldFlagData debugWorldData;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct StatValue
    {
        [FieldOffset(0x00)] public int value;
        [FieldOffset(0x04)] public bool assigned;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x8C)]
    public struct StatsContainerData
    {
        [FieldOffset(0x00)] public StatValue stats;
        [FieldOffset(0x08)] public float runLength;
        [FieldOffset(0x0C)] public uint reserved__arr0;
        [FieldOffset(0x10)] public uint reserved__arr1;
        [FieldOffset(0x14)] public uint reserved__arr2;
        [FieldOffset(0x18)] public uint reserved__arr3;
        [FieldOffset(0x1C)] public uint reserved__arr4;
        [FieldOffset(0x20)] public uint reserved__arr5;
        [FieldOffset(0x24)] public uint reserved__arr6;
        [FieldOffset(0x28)] public uint reserved__arr7;
        [FieldOffset(0x2C)] public uint reserved__arr8;
        [FieldOffset(0x30)] public uint reserved__arr9;
        [FieldOffset(0x34)] public uint reserved__arr10;
        [FieldOffset(0x38)] public uint reserved__arr11;
        [FieldOffset(0x3C)] public uint reserved__arr12;
        [FieldOffset(0x40)] public uint reserved__arr13;
        [FieldOffset(0x44)] public uint reserved__arr14;
        [FieldOffset(0x48)] public uint reserved__arr15;
        [FieldOffset(0x4C)] public uint reserved__arr16;
        [FieldOffset(0x50)] public uint reserved__arr17;
        [FieldOffset(0x54)] public uint reserved__arr18;
        [FieldOffset(0x58)] public uint reserved__arr19;
        [FieldOffset(0x5C)] public uint reserved__arr20;
        [FieldOffset(0x60)] public uint reserved__arr21;
        [FieldOffset(0x64)] public uint reserved__arr22;
        [FieldOffset(0x68)] public uint reserved__arr23;
        [FieldOffset(0x6C)] public uint reserved__arr24;
        [FieldOffset(0x70)] public uint reserved__arr25;
        [FieldOffset(0x74)] public uint reserved__arr26;
        [FieldOffset(0x78)] public uint reserved__arr27;
        [FieldOffset(0x7C)] public uint reserved__arr28;
        [FieldOffset(0x80)] public uint reserved__arr29;
        [FieldOffset(0x84)] public uint reserved__arr30;
        [FieldOffset(0x88)] public uint reserved__arr31;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x11CA8)]
    public struct AddContentDataGame
    {
        [FieldOffset(0x00)] public StageData stages__arr0;
        [FieldOffset(0x44)] public StageData stages__arr1;
        [FieldOffset(0x88)] public StageData stages__arr2;
        [FieldOffset(0xCC)] public StageData stages__arr3;
        [FieldOffset(0x110)] public StageData stages__arr4;
        [FieldOffset(0x154)] public StageData stages__arr5;
        [FieldOffset(0x198)] public StageData stages__arr6;
        [FieldOffset(0x1DC)] public StageData stages__arr7;
        [FieldOffset(0x220)] public StageData stages__arr8;
        [FieldOffset(0x264)] public StageData stages__arr9;
        [FieldOffset(0x2A8)] public WorldFlagData worldDatas__arr0;
        [FieldOffset(0x1EA8)] public WorldFlagData worldDatas__arr1;
        [FieldOffset(0x3AA8)] public WorldFlagData worldDatas__arr2;
        [FieldOffset(0x56A8)] public WorldFlagData worldDatas__arr3;
        [FieldOffset(0x72A8)] public WorldFlagData worldDatas__arr4;
        [FieldOffset(0x8EA8)] public WorldFlagData worldDatas__arr5;
        [FieldOffset(0xAAA8)] public WorldFlagData worldDatas__arr6;
        [FieldOffset(0xC6A8)] public WorldFlagData worldDatas__arr7;
        [FieldOffset(0xE2A8)] public WorldFlagData worldDatas__arr8;
        [FieldOffset(0xFEA8)] public WorldFlagData worldDatas__arr9;
        [FieldOffset(0x11AA8)] public uint reserved__arr0;
        [FieldOffset(0x11AAC)] public uint reserved__arr1;
        [FieldOffset(0x11AB0)] public uint reserved__arr2;
        [FieldOffset(0x11AB4)] public uint reserved__arr3;
        [FieldOffset(0x11AB8)] public uint reserved__arr4;
        [FieldOffset(0x11ABC)] public uint reserved__arr5;
        [FieldOffset(0x11AC0)] public uint reserved__arr6;
        [FieldOffset(0x11AC4)] public uint reserved__arr7;
        [FieldOffset(0x11AC8)] public uint reserved__arr8;
        [FieldOffset(0x11ACC)] public uint reserved__arr9;
        [FieldOffset(0x11AD0)] public uint reserved__arr10;
        [FieldOffset(0x11AD4)] public uint reserved__arr11;
        [FieldOffset(0x11AD8)] public uint reserved__arr12;
        [FieldOffset(0x11ADC)] public uint reserved__arr13;
        [FieldOffset(0x11AE0)] public uint reserved__arr14;
        [FieldOffset(0x11AE4)] public uint reserved__arr15;
        [FieldOffset(0x11AE8)] public uint reserved__arr16;
        [FieldOffset(0x11AEC)] public uint reserved__arr17;
        [FieldOffset(0x11AF0)] public uint reserved__arr18;
        [FieldOffset(0x11AF4)] public uint reserved__arr19;
        [FieldOffset(0x11AF8)] public uint reserved__arr20;
        [FieldOffset(0x11AFC)] public uint reserved__arr21;
        [FieldOffset(0x11B00)] public uint reserved__arr22;
        [FieldOffset(0x11B04)] public uint reserved__arr23;
        [FieldOffset(0x11B08)] public uint reserved__arr24;
        [FieldOffset(0x11B0C)] public uint reserved__arr25;
        [FieldOffset(0x11B10)] public uint reserved__arr26;
        [FieldOffset(0x11B14)] public uint reserved__arr27;
        [FieldOffset(0x11B18)] public uint reserved__arr28;
        [FieldOffset(0x11B1C)] public uint reserved__arr29;
        [FieldOffset(0x11B20)] public uint reserved__arr30;
        [FieldOffset(0x11B24)] public uint reserved__arr31;
        [FieldOffset(0x11B28)] public uint reserved__arr32;
        [FieldOffset(0x11B2C)] public uint reserved__arr33;
        [FieldOffset(0x11B30)] public uint reserved__arr34;
        [FieldOffset(0x11B34)] public uint reserved__arr35;
        [FieldOffset(0x11B38)] public uint reserved__arr36;
        [FieldOffset(0x11B3C)] public uint reserved__arr37;
        [FieldOffset(0x11B40)] public uint reserved__arr38;
        [FieldOffset(0x11B44)] public uint reserved__arr39;
        [FieldOffset(0x11B48)] public uint reserved__arr40;
        [FieldOffset(0x11B4C)] public uint reserved__arr41;
        [FieldOffset(0x11B50)] public uint reserved__arr42;
        [FieldOffset(0x11B54)] public uint reserved__arr43;
        [FieldOffset(0x11B58)] public uint reserved__arr44;
        [FieldOffset(0x11B5C)] public uint reserved__arr45;
        [FieldOffset(0x11B60)] public uint reserved__arr46;
        [FieldOffset(0x11B64)] public uint reserved__arr47;
        [FieldOffset(0x11B68)] public uint reserved__arr48;
        [FieldOffset(0x11B6C)] public uint reserved__arr49;
        [FieldOffset(0x11B70)] public uint reserved__arr50;
        [FieldOffset(0x11B74)] public uint reserved__arr51;
        [FieldOffset(0x11B78)] public uint reserved__arr52;
        [FieldOffset(0x11B7C)] public uint reserved__arr53;
        [FieldOffset(0x11B80)] public uint reserved__arr54;
        [FieldOffset(0x11B84)] public uint reserved__arr55;
        [FieldOffset(0x11B88)] public uint reserved__arr56;
        [FieldOffset(0x11B8C)] public uint reserved__arr57;
        [FieldOffset(0x11B90)] public uint reserved__arr58;
        [FieldOffset(0x11B94)] public uint reserved__arr59;
        [FieldOffset(0x11B98)] public uint reserved__arr60;
        [FieldOffset(0x11B9C)] public uint reserved__arr61;
        [FieldOffset(0x11BA0)] public uint reserved__arr62;
        [FieldOffset(0x11BA4)] public uint reserved__arr63;
        [FieldOffset(0x11BA8)] public uint reserved__arr64;
        [FieldOffset(0x11BAC)] public uint reserved__arr65;
        [FieldOffset(0x11BB0)] public uint reserved__arr66;
        [FieldOffset(0x11BB4)] public uint reserved__arr67;
        [FieldOffset(0x11BB8)] public uint reserved__arr68;
        [FieldOffset(0x11BBC)] public uint reserved__arr69;
        [FieldOffset(0x11BC0)] public uint reserved__arr70;
        [FieldOffset(0x11BC4)] public uint reserved__arr71;
        [FieldOffset(0x11BC8)] public uint reserved__arr72;
        [FieldOffset(0x11BCC)] public uint reserved__arr73;
        [FieldOffset(0x11BD0)] public uint reserved__arr74;
        [FieldOffset(0x11BD4)] public uint reserved__arr75;
        [FieldOffset(0x11BD8)] public uint reserved__arr76;
        [FieldOffset(0x11BDC)] public uint reserved__arr77;
        [FieldOffset(0x11BE0)] public uint reserved__arr78;
        [FieldOffset(0x11BE4)] public uint reserved__arr79;
        [FieldOffset(0x11BE8)] public uint reserved__arr80;
        [FieldOffset(0x11BEC)] public uint reserved__arr81;
        [FieldOffset(0x11BF0)] public uint reserved__arr82;
        [FieldOffset(0x11BF4)] public uint reserved__arr83;
        [FieldOffset(0x11BF8)] public uint reserved__arr84;
        [FieldOffset(0x11BFC)] public uint reserved__arr85;
        [FieldOffset(0x11C00)] public uint reserved__arr86;
        [FieldOffset(0x11C04)] public uint reserved__arr87;
        [FieldOffset(0x11C08)] public uint reserved__arr88;
        [FieldOffset(0x11C0C)] public uint reserved__arr89;
        [FieldOffset(0x11C10)] public uint reserved__arr90;
        [FieldOffset(0x11C14)] public uint reserved__arr91;
        [FieldOffset(0x11C18)] public uint reserved__arr92;
        [FieldOffset(0x11C1C)] public uint reserved__arr93;
        [FieldOffset(0x11C20)] public uint reserved__arr94;
        [FieldOffset(0x11C24)] public uint reserved__arr95;
        [FieldOffset(0x11C28)] public uint reserved__arr96;
        [FieldOffset(0x11C2C)] public uint reserved__arr97;
        [FieldOffset(0x11C30)] public uint reserved__arr98;
        [FieldOffset(0x11C34)] public uint reserved__arr99;
        [FieldOffset(0x11C38)] public uint reserved__arr100;
        [FieldOffset(0x11C3C)] public uint reserved__arr101;
        [FieldOffset(0x11C40)] public uint reserved__arr102;
        [FieldOffset(0x11C44)] public uint reserved__arr103;
        [FieldOffset(0x11C48)] public uint reserved__arr104;
        [FieldOffset(0x11C4C)] public uint reserved__arr105;
        [FieldOffset(0x11C50)] public uint reserved__arr106;
        [FieldOffset(0x11C54)] public uint reserved__arr107;
        [FieldOffset(0x11C58)] public uint reserved__arr108;
        [FieldOffset(0x11C5C)] public uint reserved__arr109;
        [FieldOffset(0x11C60)] public uint reserved__arr110;
        [FieldOffset(0x11C64)] public uint reserved__arr111;
        [FieldOffset(0x11C68)] public uint reserved__arr112;
        [FieldOffset(0x11C6C)] public uint reserved__arr113;
        [FieldOffset(0x11C70)] public uint reserved__arr114;
        [FieldOffset(0x11C74)] public uint reserved__arr115;
        [FieldOffset(0x11C78)] public uint reserved__arr116;
        [FieldOffset(0x11C7C)] public uint reserved__arr117;
        [FieldOffset(0x11C80)] public uint reserved__arr118;
        [FieldOffset(0x11C84)] public uint reserved__arr119;
        [FieldOffset(0x11C88)] public uint reserved__arr120;
        [FieldOffset(0x11C8C)] public uint reserved__arr121;
        [FieldOffset(0x11C90)] public uint reserved__arr122;
        [FieldOffset(0x11C94)] public uint reserved__arr123;
        [FieldOffset(0x11C98)] public uint reserved__arr124;
        [FieldOffset(0x11C9C)] public uint reserved__arr125;
        [FieldOffset(0x11CA0)] public uint reserved__arr126;
        [FieldOffset(0x11CA4)] public uint reserved__arr127;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x6C6F0)]
    public struct GameData
    {
        [FieldOffset(0x00)] public HeaderData header;
        [FieldOffset(0x30)] public GamePlayData gameplay;
        [FieldOffset(0x80)] public CharacterData character;
        [FieldOffset(0xB0)] public WhitespaceStageData whitespace;
        [FieldOffset(0xE0)] public StageContainerData stages;
        [FieldOffset(0xE28)] public CollectionData collection;
        [FieldOffset(0x13C8)] public QAData qa;
        [FieldOffset(0x1490)] public FlagContainerData flags;
        [FieldOffset(0x15B0)] public WorldFlagContainerData worldFlags;
        [FieldOffset(0x5A9B0)] public StatsContainerData stats;
        [FieldOffset(0x5AA3C)] public AddContentDataGame addData;
    }

}