Library "EnemyJumperConfig"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x34)]
    public struct EnemyJumperPatrolConfig
    {
        [FieldOffset(0x00)] public float rotateSpeedMin;
        [FieldOffset(0x04)] public float rotateSpeedMax;
        [FieldOffset(0x08)] public float speedMin;
        [FieldOffset(0x0C)] public float speedMax;
        [FieldOffset(0x10)] public float changeTimeIdlePatrolMin;
        [FieldOffset(0x14)] public float changeTimeIdlePatrolMax;
        [FieldOffset(0x18)] public float lockonDistance;
        [FieldOffset(0x1C)] public float unlockDistance;
        [FieldOffset(0x20)] public float distance;
        [FieldOffset(0x24)] public float minElevation;
        [FieldOffset(0x28)] public float maxElevation;
        [FieldOffset(0x2C)] public float panningSuspensionK;
        [FieldOffset(0x30)] public float interiorPanningSuspensionK;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct EnemyJumperAutoLockonParam
    {
        [FieldOffset(0x00)] public float distance;
        [FieldOffset(0x04)] public float lockOnMinDistance;
        [FieldOffset(0x10)] public Vector3 playerOffset;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x80)]
    public struct EnemyJumperCommonParam
    {
        [FieldOffset(0x00)] public float killWaitTime;
        [FieldOffset(0x04)] public float colliderRadius;
        [FieldOffset(0x08)] public float colliderHeight;
        [FieldOffset(0x0C)] public float headRadius;
        [FieldOffset(0x10)] public float headHeight;
        [FieldOffset(0x14)] public float damageColliderRadiusOffset;
        [FieldOffset(0x18)] public float eyesightDistance;
        [FieldOffset(0x1C)] public float maxSpeed;
        [FieldOffset(0x20)] public float checkBarrierDistance;
        [FieldOffset(0x24)] public EnemyJumperPatrolConfig patrolConfig;
        [FieldOffset(0x60)] public EnemyJumperAutoLockonParam lockonCamera;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public struct EnemyJumperCommonLevelParam
    {
        [FieldOffset(0x00)] public int maxHealthPoint;
        [FieldOffset(0x04)] public float attackRate;
        [FieldOffset(0x08)] public ushort expItemNum;
        [FieldOffset(0x0A)] public ushort exp;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public struct EnemyJumperLevelParam
    {
        [FieldOffset(0x00)] public int level;
        [FieldOffset(0x04)] public EnemyJumperCommonLevelParam common;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct EnemyJumperLevelBand
    {
        [FieldOffset(0x00)] public int level;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct CharacterControllerCollision
    {
        [FieldOffset(0x00)] public float height;
        [FieldOffset(0x04)] public float radius;
        [FieldOffset(0x10)] public Vector3 offset;
        [FieldOffset(0x20)] public Vector3 scale;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public struct MovementParam
    {
        [FieldOffset(0x00)] public float rotateSpeedMin;
        [FieldOffset(0x04)] public float rotateSpeedMax;
        [FieldOffset(0x08)] public float speedMin;
        [FieldOffset(0x0C)] public float speedMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct SpringPlayer
    {
        [FieldOffset(0x00)] public float velocity;
        [FieldOffset(0x04)] public float targetCursorMaxDistance;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct BattleParam
    {
        [FieldOffset(0x00)] public float stompingRange;
        [FieldOffset(0x04)] public float stompingTotalNum;
        [FieldOffset(0x08)] public float interpalTimeFinal;
        [FieldOffset(0x0C)] public float range;
        [FieldOffset(0x10)] public float riseDistance;
        [FieldOffset(0x14)] public float riseTime;
        [FieldOffset(0x18)] public float upLoopTime;
        [FieldOffset(0x1C)] public float chaseSpeed;
        [FieldOffset(0x20)] public float speed;
        [FieldOffset(0x24)] public float groundImpactRadius;
        [FieldOffset(0x28)] public SpringPlayer springPlayer;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x160)]
    public struct EnemyJumperConfig
    {
        [FieldOffset(0x00)] public EnemyJumperCommonParam commonParam;
        [FieldOffset(0x80)] public unsafe fixed byte /* EnemyJumperLevelParam[5] */ _levelParams[80];

        public unsafe EnemyJumperLevelParam* levelParams
        {
            get
            {
                fixed (byte* p_levelParams = _levelParams)
                    return (EnemyJumperLevelParam*)p_levelParams;
            }
        }

        [FieldOffset(0xD0)] public unsafe fixed byte /* EnemyJumperLevelBand[5] */ _levelBand[20];

        public unsafe EnemyJumperLevelBand* levelBand
        {
            get
            {
                fixed (byte* p_levelBand = _levelBand)
                    return (EnemyJumperLevelBand*)p_levelBand;
            }
        }

        [FieldOffset(0xF0)] public CharacterControllerCollision characterControllerCollision;
        [FieldOffset(0x120)] public MovementParam movement;
        [FieldOffset(0x130)] public BattleParam battleParam;
    }

}