Library "EnemyJumperSubConfig"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x14)]
    public struct EnemyJumperSubCommonParam
    {
        [FieldOffset(0x00)] public float killWaitTime;
        [FieldOffset(0x04)] public float colliderRadius;
        [FieldOffset(0x08)] public float colliderHeight;
        [FieldOffset(0x0C)] public float damageColliderRadiusOffset;
        [FieldOffset(0x10)] public float eyesightDistance;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public struct EnemyJumperSubCommonLevelParam
    {
        [FieldOffset(0x00)] public int maxHealthPoint;
        [FieldOffset(0x04)] public float attackRate;
        [FieldOffset(0x08)] public ushort expItemNum;
        [FieldOffset(0x0A)] public ushort exp;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x10)]
    public struct EnemyJumperSubLevelParam
    {
        [FieldOffset(0x00)] public int level;
        [FieldOffset(0x04)] public EnemyJumperSubCommonLevelParam common;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct EnemyJumperSubLevelBand
    {
        [FieldOffset(0x00)] public int level;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x78)]
    public struct EnemyJumperSubConfig
    {
        [FieldOffset(0x00)] public EnemyJumperSubCommonParam commonParam;
        [FieldOffset(0x14)] public unsafe fixed byte /* EnemyJumperSubLevelParam[5] */ _levelParams[80];

        public unsafe EnemyJumperSubLevelParam* levelParams
        {
            get
            {
                fixed (byte* p_levelParams = _levelParams)
                    return (EnemyJumperSubLevelParam*)p_levelParams;
            }
        }

        [FieldOffset(0x64)] public unsafe fixed byte /* EnemyJumperSubLevelBand[5] */ _levelBand[20];

        public unsafe EnemyJumperSubLevelBand* levelBand
        {
            get
            {
                fixed (byte* p_levelBand = _levelBand)
                    return (EnemyJumperSubLevelBand*)p_levelBand;
            }
        }
    }

}