Library "FishingParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct FishingCommonParam
    {
        [FieldOffset(0x00)] public float baseWaveThickness;
        [FieldOffset(0x04)] public float baseWaveSuccessRatioNormal;
        [FieldOffset(0x08)] public float baseWaveSuccessRatioHold;
        [FieldOffset(0x0C)] public float singleWaveThickness;
        [FieldOffset(0x10)] public float baseWaveEdgeThickness;
        [FieldOffset(0x14)] public float timingEdgeThickness;
        [FieldOffset(0x18)] public uint fishShadowNum;
        [FieldOffset(0x1C)] public float fishApproachIntervalMin;
        [FieldOffset(0x20)] public float fishApproachIntervalMax;
        [FieldOffset(0x24)] public float fishEscapeDistance;
        [FieldOffset(0x28)] public uint buoyTwitchNumMin;
        [FieldOffset(0x2C)] public uint buoyTwitchNumMax;
        [FieldOffset(0x30)] public float buoyTwitchIntervalMin;
        [FieldOffset(0x34)] public float buoyTwitchIntervalMax;
        [FieldOffset(0x38)] public float inputValidTime;
        [FieldOffset(0x3C)] public float fishingCameraTransitDelay;
        [FieldOffset(0x40)] public float cutinDelay;
        [FieldOffset(0x44)] public float cutinDuration;
        [FieldOffset(0x48)] public float successPullUpDelay;
        [FieldOffset(0x4C)] public uint goldenChestLimitNum;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct FishingSuccessPatternParam
    {
        [FieldOffset(0x00)] public uint successNum;
        [FieldOffset(0x04)] public uint failureNum;
    }

    public enum Type : sbyte
    {
        TYPE_INVALID = 0,
        TYPE_NORMAL = 1,
        TYPE_HOLD = 2
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public struct FishingWaveParam
    {
        [FieldOffset(0x00)] public Type type;
        [FieldOffset(0x04)] public float radius;
        [FieldOffset(0x08)] public float thickness;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x3C)]
    public struct FishingWaveGroupParam
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* FishingWaveParam[5] */ _waves[60];

        public unsafe FishingWaveParam* waves
        {
            get
            {
                fixed (byte* p_waves = _waves)
                    return (FishingWaveParam*)p_waves;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x278)]
    public struct FishingWavePatternParam
    {
        [FieldOffset(0x00)] public float speed;
        [FieldOffset(0x04)] public float intervalMinFirst;
        [FieldOffset(0x08)] public float intervalMaxFirst;
        [FieldOffset(0x0C)] public float intervalMin;
        [FieldOffset(0x10)] public float intervalMax;
        [FieldOffset(0x14)] public float addRadiusMin;
        [FieldOffset(0x18)] public float addRadiusMax;
        [FieldOffset(0x1C)] public uint waveGroupNum;
        [FieldOffset(0x20)] public unsafe fixed byte /* FishingWaveGroupParam[10] */ _waveGroups[600];

        public unsafe FishingWaveGroupParam* waveGroups
        {
            get
            {
                fixed (byte* p_waveGroups = _waveGroups)
                    return (FishingWaveGroupParam*)p_waveGroups;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct FishingFishGroupParam
    {
        [FieldOffset(0x00)] public float rate;
    }

    public enum FishShadowType : sbyte
    {
        SMALL = 0,
        MEDIUM = 1,
        LARGE = 2
    }

    public enum CatchUpMotionType : sbyte
    {
        SHADOW_SIZE = 0,
        LARGE_GOOD_FISH = 1,
        LARGE_GOOD_ITEM = 2,
        LARGE_BAD = 3,
        CatchUpMotionType_LARGE = 4,
        CatchUpMotionType_MEDIUM = 5,
        CatchUpMotionType_SMALL = 6,
        CHEST_GOOD = 7,
        CHEST_VERYGOOD = 8,
        SCROLL = 9
    }

    public enum ToastType : sbyte
    {
        MOTION = 0,
        PATTERN_1 = 1,
        PATTERN_2 = 2,
        PATTERN_3 = 3,
        PATTERN_4 = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x40)]
    public struct FishingFishParam
    {
        [FieldOffset(0x00)] public int fishGroupId;
        [FieldOffset(0x04)] public FishShadowType shadowType;
        [FieldOffset(0x08)] public uint successPatternId;
        [FieldOffset(0x0C)] public uint wavePatternId;
        [FieldOffset(0x10)] public uint expPoint;
        [FieldOffset(0x14)] public uint tokenNum;
        [FieldOffset(0x18)] public bool isRare;
        [FieldOffset(0x19)] public CatchUpMotionType catchUpMotionType;
        [FieldOffset(0x1A)] public ToastType toastType;
        [FieldOffset(0x20)] public Vector3 catchUpOffsetPos;
        [FieldOffset(0x30)] public Vector3 catchUpOffsetRot;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct FishingSpotSpawnFishParam
    {
        [FieldOffset(0x00)] public unsafe fixed int spawnFishId[20];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct FishingFixedResultParam
    {
        [FieldOffset(0x00)] public int count;
        [FieldOffset(0x04)] public int fishId;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x198)]
    public struct FishingSpotFixedResultParam
    {
        [FieldOffset(0x00)] public uint tableSize;
        [FieldOffset(0x04)] public uint achievementUnlockCount;
        [FieldOffset(0x08)] public unsafe fixed byte /* FishingFixedResultParam[50] */ _fixedResultList[400];

        public unsafe FishingFixedResultParam* fixedResultList
        {
            get
            {
                fixed (byte* p_fixedResultList = _fixedResultList)
                    return (FishingFixedResultParam*)p_fixedResultList;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x7C0)]
    public struct FishingSpotParam
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* FishingSpotSpawnFishParam[4] */ _spawnFish[320];

        public unsafe FishingSpotSpawnFishParam* spawnFish
        {
            get
            {
                fixed (byte* p_spawnFish = _spawnFish)
                    return (FishingSpotSpawnFishParam*)p_spawnFish;
            }
        }

        [FieldOffset(0x140)] public unsafe fixed byte /* FishingSpotFixedResultParam[4] */ _fixedResults[1632];

        public unsafe FishingSpotFixedResultParam* fixedResults
        {
            get
            {
                fixed (byte* p_fixedResults = _fixedResults)
                    return (FishingSpotFixedResultParam*)p_fixedResults;
            }
        }

        [FieldOffset(0x7A0)] public unsafe fixed uint useFishCoinNum[4];
        [FieldOffset(0x7B0)] public unsafe fixed uint tokenRate[4];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x4F8)]
    public struct FishingTutorialParam
    {
        [FieldOffset(0x00)] public uint singleWaveSuccessCount;
        [FieldOffset(0x04)] public uint holdWaveSuccessCount;
        [FieldOffset(0x08)] public FishingWavePatternParam singleWave;
        [FieldOffset(0x280)] public FishingWavePatternParam holdWave;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x09)]
    public struct FishingTradeTableParma
    {
        [FieldOffset(0x00)] public unsafe fixed byte sales[9];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x3F)]
    public struct FishingTradeParam
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* FishingTradeTableParma[4] */ _spot[36];

        public unsafe FishingTradeTableParma* spot
        {
            get
            {
                fixed (byte* p_spot = _spot)
                    return (FishingTradeTableParma*)p_spot;
            }
        }

        [FieldOffset(0x24)] public unsafe fixed byte prices[9];
        [FieldOffset(0x2D)] public unsafe fixed byte pricesVeryHard[9];
        [FieldOffset(0x36)] public unsafe fixed byte counts[9];
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x4700)]
    public struct FishingParameter
    {
        [FieldOffset(0x00)] public FishingCommonParam common;
        [FieldOffset(0x50)] public unsafe fixed byte /* FishingSuccessPatternParam[10] */ _successPattern[80];

        public unsafe FishingSuccessPatternParam* successPattern
        {
            get
            {
                fixed (byte* p_successPattern = _successPattern)
                    return (FishingSuccessPatternParam*)p_successPattern;
            }
        }

        [FieldOffset(0xA0)] public unsafe fixed byte /* FishingWavePatternParam[10] */ _wavePattern[6320];

        public unsafe FishingWavePatternParam* wavePattern
        {
            get
            {
                fixed (byte* p_wavePattern = _wavePattern)
                    return (FishingWavePatternParam*)p_wavePattern;
            }
        }

        [FieldOffset(0x1950)] public unsafe fixed byte /* FishingFishGroupParam[10] */ _fishGroup[40];

        public unsafe FishingFishGroupParam* fishGroup
        {
            get
            {
                fixed (byte* p_fishGroup = _fishGroup)
                    return (FishingFishGroupParam*)p_fishGroup;
            }
        }

        [FieldOffset(0x1980)] public unsafe fixed byte /* FishingFishParam[130] */ _fish[8320];

        public unsafe FishingFishParam* fish
        {
            get
            {
                fixed (byte* p_fish = _fish)
                    return (FishingFishParam*)p_fish;
            }
        }

        [FieldOffset(0x3A00)] public FishingSpotParam spot;
        [FieldOffset(0x41C0)] public FishingTutorialParam tutorial;
        [FieldOffset(0x46B8)] public FishingTradeParam trade;
    }

}