Library "FxPlanarProjectionShadowParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x90)]
    public struct FxPlanarProjectionShadowParameter
    {
        [FieldOffset(0x00)] public bool enable;
        [FieldOffset(0x10)] public Vector4 projectionPlane;
        [FieldOffset(0x20)] public unsafe fixed byte /* Vector3[4] */ _lightPosition[64];

        public unsafe Vector3* lightPosition
        {
            get
            {
                fixed (byte* p_lightPosition = _lightPosition)
                    return (Vector3*)p_lightPosition;
            }
        }

        [FieldOffset(0x60)] public sbyte lightCount;
        [FieldOffset(0x64)] public float vanishStart;
        [FieldOffset(0x68)] public float vanishDistance;
        [FieldOffset(0x6C)] public float projectionBias;
        [FieldOffset(0x70)] public Vector3 shadowMapBoxSize;
        [FieldOffset(0x80)] public Vector3 shadowMapBoxOffset;
    }

}