Library "HackingEnemyParameters"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x14)]
    public struct HackingEnemyParameterNormal
    {
        [FieldOffset(0x00)] public ushort hpS;
        [FieldOffset(0x02)] public ushort hpM;
        [FieldOffset(0x04)] public ushort hpL;
        [FieldOffset(0x08)] public float colliderRadius;
        [FieldOffset(0x0C)] public float colliderHeight;
        [FieldOffset(0x10)] public float modelScale;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x0C)]
    public struct HackingEnemyParameterCore
    {
        [FieldOffset(0x00)] public float colliderRadius;
        [FieldOffset(0x04)] public float colliderHeight;
        [FieldOffset(0x08)] public float modelScale;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct HackingEnemyParameters
    {
        [FieldOffset(0x00)] public HackingEnemyParameterNormal normalEnemyParam;
        [FieldOffset(0x14)] public HackingEnemyParameterCore coreEnemyParam;
    }

}