Library "MeteorShowerParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x60)]
    public struct MeteorShowerEffectParameter
    {
        [FieldOffset(0x00)] public float spawnIntervalMax;
        [FieldOffset(0x04)] public float spawnIntervalMin;
        [FieldOffset(0x08)] public float spawnHeightMax;
        [FieldOffset(0x0C)] public float spawnHeightMin;
        [FieldOffset(0x10)] public float spawnHorizonMax;
        [FieldOffset(0x14)] public float spawnHorizonMin;
        [FieldOffset(0x18)] public float speedMax;
        [FieldOffset(0x1C)] public float speedMin;
        [FieldOffset(0x20)] public float lengthMax;
        [FieldOffset(0x24)] public float lengthMin;
        [FieldOffset(0x28)] public float width;
        [FieldOffset(0x2C)] public float angleMax;
        [FieldOffset(0x30)] public float angleMin;
        [FieldOffset(0x34)] public float moveTimeMax;
        [FieldOffset(0x38)] public float moveTimeMin;
        [FieldOffset(0x3C)] public float fadeTimeMax;
        [FieldOffset(0x40)] public float fadeTimeMin;
        [FieldOffset(0x44)] public float spawnAngle;
        [FieldOffset(0x50)] public Vector3 color;
    }

    public enum Symbol : sbyte
    {
        Invalid = -1,
        Seven = 0,
        Bar = 1,
        Fruit = 2,
        Bell = 3,
        NumSymbols = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct ReelParam
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* Symbol[16] */ _symbols[16];

        public unsafe Symbol* symbols
        {
            get
            {
                fixed (byte* p_symbols = _symbols)
                    return (Symbol*)p_symbols;
            }
        }

        [FieldOffset(0x10)] public float spinSpeedMin;
        [FieldOffset(0x14)] public float spinSpeedMax;
        [FieldOffset(0x18)] public float autoStopTimeMin;
        [FieldOffset(0x1C)] public float autoStopTimeMax;
    }

    public enum RateInfo_Symbol : sbyte
    {
        RateInfo_Symbol_Invalid = -1,
        RateInfo_Symbol_Seven = 0,
        RateInfo_Symbol_Bar = 1,
        RateInfo_Symbol_Fruit = 2,
        RateInfo_Symbol_Bell = 3,
        RateInfo_Symbol_NumSymbols = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct RateInfo
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* RateInfo_Symbol[3] */ _symbols[3];

        public unsafe RateInfo_Symbol* symbols
        {
            get
            {
                fixed (byte* p_symbols = _symbols)
                    return (RateInfo_Symbol*)p_symbols;
            }
        }

        [FieldOffset(0x04)] public float rate;
    }

    public enum CeilingInfo_Symbol : sbyte
    {
        CeilingInfo_Symbol_Invalid = -1,
        CeilingInfo_Symbol_Seven = 0,
        CeilingInfo_Symbol_Bar = 1,
        CeilingInfo_Symbol_Fruit = 2,
        CeilingInfo_Symbol_Bell = 3,
        CeilingInfo_Symbol_NumSymbols = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct CeilingInfo
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* CeilingInfo_Symbol[3] */ _symbols[3];

        public unsafe CeilingInfo_Symbol* symbols
        {
            get
            {
                fixed (byte* p_symbols = _symbols)
                    return (CeilingInfo_Symbol*)p_symbols;
            }
        }

        [FieldOffset(0x04)] public uint rollCount;
    }

    public enum PayoutInfo_Symbol : sbyte
    {
        PayoutInfo_Symbol_Invalid = -1,
        PayoutInfo_Symbol_Seven = 0,
        PayoutInfo_Symbol_Bar = 1,
        PayoutInfo_Symbol_Fruit = 2,
        PayoutInfo_Symbol_Bell = 3,
        PayoutInfo_Symbol_NumSymbols = 4
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct PayoutInfo
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* PayoutInfo_Symbol[3] */ _symbols[3];

        public unsafe PayoutInfo_Symbol* symbols
        {
            get
            {
                fixed (byte* p_symbols = _symbols)
                    return (PayoutInfo_Symbol*)p_symbols;
            }
        }

        [FieldOffset(0x04)] public uint payout;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xD8)]
    public struct ObjBonusSlotConfig
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* ReelParam[3] */ _reelParams[96];

        public unsafe ReelParam* reelParams
        {
            get
            {
                fixed (byte* p_reelParams = _reelParams)
                    return (ReelParam*)p_reelParams;
            }
        }

        [FieldOffset(0x60)] public float spinInterval;
        [FieldOffset(0x64)] public unsafe fixed byte /* RateInfo[4] */ _rateInfos[32];

        public unsafe RateInfo* rateInfos
        {
            get
            {
                fixed (byte* p_rateInfos = _rateInfos)
                    return (RateInfo*)p_rateInfos;
            }
        }

        [FieldOffset(0x84)] public unsafe fixed byte /* CeilingInfo[4] */ _ceilingInfos[32];

        public unsafe CeilingInfo* ceilingInfos
        {
            get
            {
                fixed (byte* p_ceilingInfos = _ceilingInfos)
                    return (CeilingInfo*)p_ceilingInfos;
            }
        }

        [FieldOffset(0xA4)] public unsafe fixed byte /* PayoutInfo[4] */ _payoutInfos[32];

        public unsafe PayoutInfo* payoutInfos
        {
            get
            {
                fixed (byte* p_payoutInfos = _payoutInfos)
                    return (PayoutInfo*)p_payoutInfos;
            }
        }

        [FieldOffset(0xC4)] public uint payoutOnBlank;
        [FieldOffset(0xC8)] public bool WinEvenWithPush;
        [FieldOffset(0xCC)] public float retrySpeed;
        [FieldOffset(0xD0)] public float backSpeed;
        [FieldOffset(0xD4)] public float stepSpeed;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x170)]
    public struct MeteorShowerParameter
    {
        [FieldOffset(0x00)] public float rangeFromSonicObjectsDontRespawn;
        [FieldOffset(0x04)] public uint intervalDay;
        [FieldOffset(0x08)] public uint startHour;
        [FieldOffset(0x0C)] public uint startMinute;
        [FieldOffset(0x10)] public uint durationHour;
        [FieldOffset(0x14)] public uint durationMinute;
        [FieldOffset(0x18)] public uint extraIslandSeedRate;
        [FieldOffset(0x1C)] public uint extraIslandKodamaRate;
        [FieldOffset(0x20)] public uint extraIntervalDay;
        [FieldOffset(0x30)] public MeteorShowerEffectParameter effect;
        [FieldOffset(0x90)] public ObjBonusSlotConfig bonusSlotConfig;
    }

}