Library "ObjEffectDebrisParameters"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct ExplosionParameter
    {
        [FieldOffset(0x00)] public Vector3 centerPosOffsetMin;
        [FieldOffset(0x10)] public Vector3 centerPosOffsetMax;
        [FieldOffset(0x20)] public float range;
        [FieldOffset(0x24)] public float powerMin;
        [FieldOffset(0x28)] public float powerMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct ImpulseParameter
    {
        [FieldOffset(0x00)] public Vector3 impulseDir;
        [FieldOffset(0x10)] public float powerMin;
        [FieldOffset(0x14)] public float powerMax;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x70)]
    public struct DebrisPhaseParameter
    {
        [FieldOffset(0x00)] public float marginTime;
        [FieldOffset(0x04)] public float nextTime;
        [FieldOffset(0x08)] public float gravity;
        [FieldOffset(0x0C)] public float moveStopTime;
        [FieldOffset(0x10)] public bool damping;
        [FieldOffset(0x20)] public ExplosionParameter explosionParam;
        [FieldOffset(0x50)] public ImpulseParameter impulseParam;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x150)]
    public struct EffectDebrisParameter
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* DebrisPhaseParameter[3] */ _debrisPhaseParameters[336];

        public unsafe DebrisPhaseParameter* debrisPhaseParameters
        {
            get
            {
                fixed (byte* p_debrisPhaseParameters = _debrisPhaseParameters)
                    return (DebrisPhaseParameter*)p_debrisPhaseParameters;
            }
        }
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xD20)]
    public struct ObjEffectDebrisParameters
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* EffectDebrisParameter[10] */ _effectDebrisParameters[3360];

        public unsafe EffectDebrisParameter* effectDebrisParameters
        {
            get
            {
                fixed (byte* p_effectDebrisParameters = _effectDebrisParameters)
                    return (EffectDebrisParameter*)p_effectDebrisParameters;
            }
        }
    }

}