Library "ObjKodamaQuestParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x30)]
    public struct QuestKodamaCollectionBaseParameter
    {
        [FieldOffset(0x00)] public int clearKodamaNum;
        [FieldOffset(0x04)] public float modelScale;
        [FieldOffset(0x08)] public float capsuleRadius;
        [FieldOffset(0x0C)] public float capsuleHeight;
        [FieldOffset(0x10)] public Vector3 capsuleOffset;
        [FieldOffset(0x20)] public float searchRadius;
        [FieldOffset(0x24)] public float collectTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x24)]
    public struct QuestKodamaCollectionMoveParameter
    {
        [FieldOffset(0x00)] public float rotationAnglePerSec;
        [FieldOffset(0x04)] public float moveSpeed;
        [FieldOffset(0x08)] public float moveStopSpeed;
        [FieldOffset(0x0C)] public float moveStopeTime;
        [FieldOffset(0x10)] public float groupRadius;
        [FieldOffset(0x14)] public float groupMoveAdjustRangeOffset;
        [FieldOffset(0x18)] public float groupLeaderFixTime;
        [FieldOffset(0x1C)] public float returnToCenterDistance;
        [FieldOffset(0x20)] public float returnToCenterRotationAngle;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1C)]
    public struct QuestKodamaCollectionBombParameter
    {
        [FieldOffset(0x00)] public float bombSpawnTrialTime;
        [FieldOffset(0x04)] public ushort numKodamasNeededForBombSpawnRate2;
        [FieldOffset(0x06)] public ushort numKodamasNeededForBombSpawnRate3;
        [FieldOffset(0x08)] public float bombSpawnRate1;
        [FieldOffset(0x0C)] public float bombSpawnRate2;
        [FieldOffset(0x10)] public float bombSpawnRate3;
        [FieldOffset(0x14)] public byte maxAliveBombNum;
        [FieldOffset(0x18)] public float bombSpawnRange;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x14)]
    public struct QuestKodamaCollectionTimerParameter
    {
        [FieldOffset(0x00)] public bool isTimeUp;
        [FieldOffset(0x04)] public float timeLimitSeconds;
        [FieldOffset(0x08)] public float cautionTime;
        [FieldOffset(0x0C)] public float warningTime;
        [FieldOffset(0x10)] public bool useCautionAnimation;
        [FieldOffset(0x11)] public bool useWarningAnimation;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xA0)]
    public struct ObjKodamaQuestGrassIslandParameter
    {
        [FieldOffset(0x00)] public int applicableFailedCount;
        [FieldOffset(0x10)] public QuestKodamaCollectionBaseParameter baseParam;
        [FieldOffset(0x40)] public QuestKodamaCollectionMoveParameter moveParam;
        [FieldOffset(0x64)] public QuestKodamaCollectionBombParameter bombParam;
        [FieldOffset(0x80)] public QuestKodamaCollectionTimerParameter timerParam;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x2C)]
    public struct QuestKodamaCollectionSandBombParameter
    {
        [FieldOffset(0)]  public QuestKodamaCollectionBombParameter questKodamaCollectionBombParameter;
        [FieldOffset(0x1C)] public float sandStormTime;
        [FieldOffset(0x20)] public float noBombsTime;
        [FieldOffset(0x24)] public float sandStormInLerpTime;
        [FieldOffset(0x28)] public float sandStormOutLerpTime;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xB0)]
    public struct ObjKodamaQuestDesertIslandParameter
    {
        [FieldOffset(0x00)] public int applicableFailedCount;
        [FieldOffset(0x10)] public QuestKodamaCollectionBaseParameter baseParam;
        [FieldOffset(0x40)] public QuestKodamaCollectionMoveParameter moveParam;
        [FieldOffset(0x64)] public QuestKodamaCollectionSandBombParameter bombParam;
        [FieldOffset(0x90)] public QuestKodamaCollectionTimerParameter timerParam;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x3F0)]
    public struct ObjKodamaQuestParameter
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* ObjKodamaQuestGrassIslandParameter[3] */ _grassIslandParam[480];

        public unsafe ObjKodamaQuestGrassIslandParameter* grassIslandParam
        {
            get
            {
                fixed (byte* p_grassIslandParam = _grassIslandParam)
                    return (ObjKodamaQuestGrassIslandParameter*)p_grassIslandParam;
            }
        }

        [FieldOffset(0x1E0)] public unsafe fixed byte /* ObjKodamaQuestDesertIslandParameter[3] */ _desertIslandParam[528];

        public unsafe ObjKodamaQuestDesertIslandParameter* desertIslandParam
        {
            get
            {
                fixed (byte* p_desertIslandParam = _desertIslandParam)
                    return (ObjKodamaQuestDesertIslandParameter*)p_desertIslandParam;
            }
        }
    }

}