Library "ObjMowingParameter"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x04)]
    public struct ObjMowingGrassParameter
    {
        [FieldOffset(0x00)] public float radius;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct ObjBeeFlowerParameter
    {
        [FieldOffset(0x00)] public float modelScale;
        [FieldOffset(0x04)] public float capsuleRadiusSprouts;
        [FieldOffset(0x08)] public float capsuleRadiusFlower;
        [FieldOffset(0x0C)] public float capsuleHeightSprouts;
        [FieldOffset(0x10)] public float capsuleHeightFlower;
        [FieldOffset(0x20)] public Vector3 effectOffsetSprouts;
        [FieldOffset(0x30)] public Vector3 effectOffsetFlower;
        [FieldOffset(0x40)] public float beeAttractDist;
        [FieldOffset(0x44)] public float efficacyTimeFlower;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x50)]
    public struct ObjBeeSwarmParameter
    {
        [FieldOffset(0x00)] public Vector3 targetOffset;
        [FieldOffset(0x10)] public Vector3 targetOffsetFlower;
        [FieldOffset(0x20)] public float collRadius;
        [FieldOffset(0x24)] public float modelScale;
        [FieldOffset(0x28)] public float beeMoveSpeed;
        [FieldOffset(0x2C)] public float reflectionAngle;
        [FieldOffset(0x30)] public float coefAverage;
        [FieldOffset(0x34)] public float coefCenter;
        [FieldOffset(0x38)] public float coefRepulse;
        [FieldOffset(0x3C)] public float waitTimeAfterAttack;
        [FieldOffset(0x40)] public float waitTimeAfterFlower;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0xB0)]
    public struct ObjMowingParameterElement
    {
        [FieldOffset(0x00)] public ObjMowingGrassParameter grassParam;
        [FieldOffset(0x10)] public ObjBeeFlowerParameter beeFlowerParam;
        [FieldOffset(0x60)] public ObjBeeSwarmParameter beeSwarm;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x210)]
    public struct ObjMowingParameter
    {
        [FieldOffset(0x00)] public unsafe fixed byte /* ObjMowingParameterElement[3] */ _element[528];

        public unsafe ObjMowingParameterElement* element
        {
            get
            {
                fixed (byte* p_element = _element)
                    return (ObjMowingParameterElement*)p_element;
            }
        }
    }

}