Library "ObjSumoPuckConfig"
{
    #load "System.Numerics.dll"

    using System.Numerics;
    using System.Runtime.InteropServices;

    [StructLayout(LayoutKind.Explicit, Size = 0x38)]
    public struct ObjSumoPuckConfig
    {
        [FieldOffset(0x00)] public float mass;
        [FieldOffset(0x04)] public float slopeAngleMax;
        [FieldOffset(0x08)] public float stairHeightMax;
        [FieldOffset(0x0C)] public float colliderRigidHeight;
        [FieldOffset(0x10)] public float colliderRigidRadius;
        [FieldOffset(0x14)] public float colliderEventHeight;
        [FieldOffset(0x18)] public float colliderEventRadius;
        [FieldOffset(0x1C)] public float colliderOffsetHeightSlingshot;
        [FieldOffset(0x20)] public float explodeRadius;
        [FieldOffset(0x24)] public float bumperBlowSpeed;
        [FieldOffset(0x28)] public float bumperOCTime;
        [FieldOffset(0x2C)] public int damageToEnemy;
        [FieldOffset(0x30)] public float lifeTimeParried;
        [FieldOffset(0x34)] public float decelerationParried;
    }

}