using System.Numerics;
using System.Runtime.InteropServices;

public class ElectricLineParameterClass
{
    [StructLayout(LayoutKind.Explicit, Size = 0x08)]
    public struct ElectricLineConnectData
    {
        [FieldOffset(0x00)] public int challengeNo0;
        [FieldOffset(0x04)] public int challengeNo1;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x20)]
    public struct ElectricLineConnectParameter
    {
        [FieldOffset(0x00)] public int challengeNo0;
        [FieldOffset(0x04)] public int challengeNo1;
        [FieldOffset(0x08)] public ElectricLineConnectData data__arr0;
        [FieldOffset(0x10)] public ElectricLineConnectData data__arr1;
        [FieldOffset(0x18)] public ElectricLineConnectData data__arr2;
    }

    [StructLayout(LayoutKind.Explicit, Size = 0x1900)]
    public struct ElectricLineParameter
    {
        [FieldOffset(0x00)] public ElectricLineConnectParameter connect__arr0;
        [FieldOffset(0x20)] public ElectricLineConnectParameter connect__arr1;
        [FieldOffset(0x40)] public ElectricLineConnectParameter connect__arr2;
        [FieldOffset(0x60)] public ElectricLineConnectParameter connect__arr3;
        [FieldOffset(0x80)] public ElectricLineConnectParameter connect__arr4;
        [FieldOffset(0xA0)] public ElectricLineConnectParameter connect__arr5;
        [FieldOffset(0xC0)] public ElectricLineConnectParameter connect__arr6;
        [FieldOffset(0xE0)] public ElectricLineConnectParameter connect__arr7;
        [FieldOffset(0x100)] public ElectricLineConnectParameter connect__arr8;
        [FieldOffset(0x120)] public ElectricLineConnectParameter connect__arr9;
        [FieldOffset(0x140)] public ElectricLineConnectParameter connect__arr10;
        [FieldOffset(0x160)] public ElectricLineConnectParameter connect__arr11;
        [FieldOffset(0x180)] public ElectricLineConnectParameter connect__arr12;
        [FieldOffset(0x1A0)] public ElectricLineConnectParameter connect__arr13;
        [FieldOffset(0x1C0)] public ElectricLineConnectParameter connect__arr14;
        [FieldOffset(0x1E0)] public ElectricLineConnectParameter connect__arr15;
        [FieldOffset(0x200)] public ElectricLineConnectParameter connect__arr16;
        [FieldOffset(0x220)] public ElectricLineConnectParameter connect__arr17;
        [FieldOffset(0x240)] public ElectricLineConnectParameter connect__arr18;
        [FieldOffset(0x260)] public ElectricLineConnectParameter connect__arr19;
        [FieldOffset(0x280)] public ElectricLineConnectParameter connect__arr20;
        [FieldOffset(0x2A0)] public ElectricLineConnectParameter connect__arr21;
        [FieldOffset(0x2C0)] public ElectricLineConnectParameter connect__arr22;
        [FieldOffset(0x2E0)] public ElectricLineConnectParameter connect__arr23;
        [FieldOffset(0x300)] public ElectricLineConnectParameter connect__arr24;
        [FieldOffset(0x320)] public ElectricLineConnectParameter connect__arr25;
        [FieldOffset(0x340)] public ElectricLineConnectParameter connect__arr26;
        [FieldOffset(0x360)] public ElectricLineConnectParameter connect__arr27;
        [FieldOffset(0x380)] public ElectricLineConnectParameter connect__arr28;
        [FieldOffset(0x3A0)] public ElectricLineConnectParameter connect__arr29;
        [FieldOffset(0x3C0)] public ElectricLineConnectParameter connect__arr30;
        [FieldOffset(0x3E0)] public ElectricLineConnectParameter connect__arr31;
        [FieldOffset(0x400)] public ElectricLineConnectParameter connect__arr32;
        [FieldOffset(0x420)] public ElectricLineConnectParameter connect__arr33;
        [FieldOffset(0x440)] public ElectricLineConnectParameter connect__arr34;
        [FieldOffset(0x460)] public ElectricLineConnectParameter connect__arr35;
        [FieldOffset(0x480)] public ElectricLineConnectParameter connect__arr36;
        [FieldOffset(0x4A0)] public ElectricLineConnectParameter connect__arr37;
        [FieldOffset(0x4C0)] public ElectricLineConnectParameter connect__arr38;
        [FieldOffset(0x4E0)] public ElectricLineConnectParameter connect__arr39;
        [FieldOffset(0x500)] public ElectricLineConnectParameter connect__arr40;
        [FieldOffset(0x520)] public ElectricLineConnectParameter connect__arr41;
        [FieldOffset(0x540)] public ElectricLineConnectParameter connect__arr42;
        [FieldOffset(0x560)] public ElectricLineConnectParameter connect__arr43;
        [FieldOffset(0x580)] public ElectricLineConnectParameter connect__arr44;
        [FieldOffset(0x5A0)] public ElectricLineConnectParameter connect__arr45;
        [FieldOffset(0x5C0)] public ElectricLineConnectParameter connect__arr46;
        [FieldOffset(0x5E0)] public ElectricLineConnectParameter connect__arr47;
        [FieldOffset(0x600)] public ElectricLineConnectParameter connect__arr48;
        [FieldOffset(0x620)] public ElectricLineConnectParameter connect__arr49;
        [FieldOffset(0x640)] public ElectricLineConnectParameter connect__arr50;
        [FieldOffset(0x660)] public ElectricLineConnectParameter connect__arr51;
        [FieldOffset(0x680)] public ElectricLineConnectParameter connect__arr52;
        [FieldOffset(0x6A0)] public ElectricLineConnectParameter connect__arr53;
        [FieldOffset(0x6C0)] public ElectricLineConnectParameter connect__arr54;
        [FieldOffset(0x6E0)] public ElectricLineConnectParameter connect__arr55;
        [FieldOffset(0x700)] public ElectricLineConnectParameter connect__arr56;
        [FieldOffset(0x720)] public ElectricLineConnectParameter connect__arr57;
        [FieldOffset(0x740)] public ElectricLineConnectParameter connect__arr58;
        [FieldOffset(0x760)] public ElectricLineConnectParameter connect__arr59;
        [FieldOffset(0x780)] public ElectricLineConnectParameter connect__arr60;
        [FieldOffset(0x7A0)] public ElectricLineConnectParameter connect__arr61;
        [FieldOffset(0x7C0)] public ElectricLineConnectParameter connect__arr62;
        [FieldOffset(0x7E0)] public ElectricLineConnectParameter connect__arr63;
        [FieldOffset(0x800)] public ElectricLineConnectParameter connect__arr64;
        [FieldOffset(0x820)] public ElectricLineConnectParameter connect__arr65;
        [FieldOffset(0x840)] public ElectricLineConnectParameter connect__arr66;
        [FieldOffset(0x860)] public ElectricLineConnectParameter connect__arr67;
        [FieldOffset(0x880)] public ElectricLineConnectParameter connect__arr68;
        [FieldOffset(0x8A0)] public ElectricLineConnectParameter connect__arr69;
        [FieldOffset(0x8C0)] public ElectricLineConnectParameter connect__arr70;
        [FieldOffset(0x8E0)] public ElectricLineConnectParameter connect__arr71;
        [FieldOffset(0x900)] public ElectricLineConnectParameter connect__arr72;
        [FieldOffset(0x920)] public ElectricLineConnectParameter connect__arr73;
        [FieldOffset(0x940)] public ElectricLineConnectParameter connect__arr74;
        [FieldOffset(0x960)] public ElectricLineConnectParameter connect__arr75;
        [FieldOffset(0x980)] public ElectricLineConnectParameter connect__arr76;
        [FieldOffset(0x9A0)] public ElectricLineConnectParameter connect__arr77;
        [FieldOffset(0x9C0)] public ElectricLineConnectParameter connect__arr78;
        [FieldOffset(0x9E0)] public ElectricLineConnectParameter connect__arr79;
        [FieldOffset(0xA00)] public ElectricLineConnectParameter connect__arr80;
        [FieldOffset(0xA20)] public ElectricLineConnectParameter connect__arr81;
        [FieldOffset(0xA40)] public ElectricLineConnectParameter connect__arr82;
        [FieldOffset(0xA60)] public ElectricLineConnectParameter connect__arr83;
        [FieldOffset(0xA80)] public ElectricLineConnectParameter connect__arr84;
        [FieldOffset(0xAA0)] public ElectricLineConnectParameter connect__arr85;
        [FieldOffset(0xAC0)] public ElectricLineConnectParameter connect__arr86;
        [FieldOffset(0xAE0)] public ElectricLineConnectParameter connect__arr87;
        [FieldOffset(0xB00)] public ElectricLineConnectParameter connect__arr88;
        [FieldOffset(0xB20)] public ElectricLineConnectParameter connect__arr89;
        [FieldOffset(0xB40)] public ElectricLineConnectParameter connect__arr90;
        [FieldOffset(0xB60)] public ElectricLineConnectParameter connect__arr91;
        [FieldOffset(0xB80)] public ElectricLineConnectParameter connect__arr92;
        [FieldOffset(0xBA0)] public ElectricLineConnectParameter connect__arr93;
        [FieldOffset(0xBC0)] public ElectricLineConnectParameter connect__arr94;
        [FieldOffset(0xBE0)] public ElectricLineConnectParameter connect__arr95;
        [FieldOffset(0xC00)] public ElectricLineConnectParameter connect__arr96;
        [FieldOffset(0xC20)] public ElectricLineConnectParameter connect__arr97;
        [FieldOffset(0xC40)] public ElectricLineConnectParameter connect__arr98;
        [FieldOffset(0xC60)] public ElectricLineConnectParameter connect__arr99;
        [FieldOffset(0xC80)] public ElectricLineConnectParameter connect__arr100;
        [FieldOffset(0xCA0)] public ElectricLineConnectParameter connect__arr101;
        [FieldOffset(0xCC0)] public ElectricLineConnectParameter connect__arr102;
        [FieldOffset(0xCE0)] public ElectricLineConnectParameter connect__arr103;
        [FieldOffset(0xD00)] public ElectricLineConnectParameter connect__arr104;
        [FieldOffset(0xD20)] public ElectricLineConnectParameter connect__arr105;
        [FieldOffset(0xD40)] public ElectricLineConnectParameter connect__arr106;
        [FieldOffset(0xD60)] public ElectricLineConnectParameter connect__arr107;
        [FieldOffset(0xD80)] public ElectricLineConnectParameter connect__arr108;
        [FieldOffset(0xDA0)] public ElectricLineConnectParameter connect__arr109;
        [FieldOffset(0xDC0)] public ElectricLineConnectParameter connect__arr110;
        [FieldOffset(0xDE0)] public ElectricLineConnectParameter connect__arr111;
        [FieldOffset(0xE00)] public ElectricLineConnectParameter connect__arr112;
        [FieldOffset(0xE20)] public ElectricLineConnectParameter connect__arr113;
        [FieldOffset(0xE40)] public ElectricLineConnectParameter connect__arr114;
        [FieldOffset(0xE60)] public ElectricLineConnectParameter connect__arr115;
        [FieldOffset(0xE80)] public ElectricLineConnectParameter connect__arr116;
        [FieldOffset(0xEA0)] public ElectricLineConnectParameter connect__arr117;
        [FieldOffset(0xEC0)] public ElectricLineConnectParameter connect__arr118;
        [FieldOffset(0xEE0)] public ElectricLineConnectParameter connect__arr119;
        [FieldOffset(0xF00)] public ElectricLineConnectParameter connect__arr120;
        [FieldOffset(0xF20)] public ElectricLineConnectParameter connect__arr121;
        [FieldOffset(0xF40)] public ElectricLineConnectParameter connect__arr122;
        [FieldOffset(0xF60)] public ElectricLineConnectParameter connect__arr123;
        [FieldOffset(0xF80)] public ElectricLineConnectParameter connect__arr124;
        [FieldOffset(0xFA0)] public ElectricLineConnectParameter connect__arr125;
        [FieldOffset(0xFC0)] public ElectricLineConnectParameter connect__arr126;
        [FieldOffset(0xFE0)] public ElectricLineConnectParameter connect__arr127;
        [FieldOffset(0x1000)] public ElectricLineConnectParameter connect__arr128;
        [FieldOffset(0x1020)] public ElectricLineConnectParameter connect__arr129;
        [FieldOffset(0x1040)] public ElectricLineConnectParameter connect__arr130;
        [FieldOffset(0x1060)] public ElectricLineConnectParameter connect__arr131;
        [FieldOffset(0x1080)] public ElectricLineConnectParameter connect__arr132;
        [FieldOffset(0x10A0)] public ElectricLineConnectParameter connect__arr133;
        [FieldOffset(0x10C0)] public ElectricLineConnectParameter connect__arr134;
        [FieldOffset(0x10E0)] public ElectricLineConnectParameter connect__arr135;
        [FieldOffset(0x1100)] public ElectricLineConnectParameter connect__arr136;
        [FieldOffset(0x1120)] public ElectricLineConnectParameter connect__arr137;
        [FieldOffset(0x1140)] public ElectricLineConnectParameter connect__arr138;
        [FieldOffset(0x1160)] public ElectricLineConnectParameter connect__arr139;
        [FieldOffset(0x1180)] public ElectricLineConnectParameter connect__arr140;
        [FieldOffset(0x11A0)] public ElectricLineConnectParameter connect__arr141;
        [FieldOffset(0x11C0)] public ElectricLineConnectParameter connect__arr142;
        [FieldOffset(0x11E0)] public ElectricLineConnectParameter connect__arr143;
        [FieldOffset(0x1200)] public ElectricLineConnectParameter connect__arr144;
        [FieldOffset(0x1220)] public ElectricLineConnectParameter connect__arr145;
        [FieldOffset(0x1240)] public ElectricLineConnectParameter connect__arr146;
        [FieldOffset(0x1260)] public ElectricLineConnectParameter connect__arr147;
        [FieldOffset(0x1280)] public ElectricLineConnectParameter connect__arr148;
        [FieldOffset(0x12A0)] public ElectricLineConnectParameter connect__arr149;
        [FieldOffset(0x12C0)] public ElectricLineConnectParameter connect__arr150;
        [FieldOffset(0x12E0)] public ElectricLineConnectParameter connect__arr151;
        [FieldOffset(0x1300)] public ElectricLineConnectParameter connect__arr152;
        [FieldOffset(0x1320)] public ElectricLineConnectParameter connect__arr153;
        [FieldOffset(0x1340)] public ElectricLineConnectParameter connect__arr154;
        [FieldOffset(0x1360)] public ElectricLineConnectParameter connect__arr155;
        [FieldOffset(0x1380)] public ElectricLineConnectParameter connect__arr156;
        [FieldOffset(0x13A0)] public ElectricLineConnectParameter connect__arr157;
        [FieldOffset(0x13C0)] public ElectricLineConnectParameter connect__arr158;
        [FieldOffset(0x13E0)] public ElectricLineConnectParameter connect__arr159;
        [FieldOffset(0x1400)] public ElectricLineConnectParameter connect__arr160;
        [FieldOffset(0x1420)] public ElectricLineConnectParameter connect__arr161;
        [FieldOffset(0x1440)] public ElectricLineConnectParameter connect__arr162;
        [FieldOffset(0x1460)] public ElectricLineConnectParameter connect__arr163;
        [FieldOffset(0x1480)] public ElectricLineConnectParameter connect__arr164;
        [FieldOffset(0x14A0)] public ElectricLineConnectParameter connect__arr165;
        [FieldOffset(0x14C0)] public ElectricLineConnectParameter connect__arr166;
        [FieldOffset(0x14E0)] public ElectricLineConnectParameter connect__arr167;
        [FieldOffset(0x1500)] public ElectricLineConnectParameter connect__arr168;
        [FieldOffset(0x1520)] public ElectricLineConnectParameter connect__arr169;
        [FieldOffset(0x1540)] public ElectricLineConnectParameter connect__arr170;
        [FieldOffset(0x1560)] public ElectricLineConnectParameter connect__arr171;
        [FieldOffset(0x1580)] public ElectricLineConnectParameter connect__arr172;
        [FieldOffset(0x15A0)] public ElectricLineConnectParameter connect__arr173;
        [FieldOffset(0x15C0)] public ElectricLineConnectParameter connect__arr174;
        [FieldOffset(0x15E0)] public ElectricLineConnectParameter connect__arr175;
        [FieldOffset(0x1600)] public ElectricLineConnectParameter connect__arr176;
        [FieldOffset(0x1620)] public ElectricLineConnectParameter connect__arr177;
        [FieldOffset(0x1640)] public ElectricLineConnectParameter connect__arr178;
        [FieldOffset(0x1660)] public ElectricLineConnectParameter connect__arr179;
        [FieldOffset(0x1680)] public ElectricLineConnectParameter connect__arr180;
        [FieldOffset(0x16A0)] public ElectricLineConnectParameter connect__arr181;
        [FieldOffset(0x16C0)] public ElectricLineConnectParameter connect__arr182;
        [FieldOffset(0x16E0)] public ElectricLineConnectParameter connect__arr183;
        [FieldOffset(0x1700)] public ElectricLineConnectParameter connect__arr184;
        [FieldOffset(0x1720)] public ElectricLineConnectParameter connect__arr185;
        [FieldOffset(0x1740)] public ElectricLineConnectParameter connect__arr186;
        [FieldOffset(0x1760)] public ElectricLineConnectParameter connect__arr187;
        [FieldOffset(0x1780)] public ElectricLineConnectParameter connect__arr188;
        [FieldOffset(0x17A0)] public ElectricLineConnectParameter connect__arr189;
        [FieldOffset(0x17C0)] public ElectricLineConnectParameter connect__arr190;
        [FieldOffset(0x17E0)] public ElectricLineConnectParameter connect__arr191;
        [FieldOffset(0x1800)] public ElectricLineConnectParameter connect__arr192;
        [FieldOffset(0x1820)] public ElectricLineConnectParameter connect__arr193;
        [FieldOffset(0x1840)] public ElectricLineConnectParameter connect__arr194;
        [FieldOffset(0x1860)] public ElectricLineConnectParameter connect__arr195;
        [FieldOffset(0x1880)] public ElectricLineConnectParameter connect__arr196;
        [FieldOffset(0x18A0)] public ElectricLineConnectParameter connect__arr197;
        [FieldOffset(0x18C0)] public ElectricLineConnectParameter connect__arr198;
        [FieldOffset(0x18E0)] public ElectricLineConnectParameter connect__arr199;
    }

}